-- MariaDB dump 10.19  Distrib 10.4.32-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: exolabir_index
-- ------------------------------------------------------
-- Server version	10.4.32-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Current Database: `exolabir_index`
--

CREATE DATABASE /*!32312 IF NOT EXISTS*/ `exolabir_index` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci */;

USE `exolabir_index`;

--
-- Table structure for table `_migrations`
--

DROP TABLE IF EXISTS `_migrations`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `_migrations` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `filename` varchar(255) NOT NULL,
  `applied_at` datetime NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_migration_filename` (`filename`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `_migrations`
--

LOCK TABLES `_migrations` WRITE;
/*!40000 ALTER TABLE `_migrations` DISABLE KEYS */;
INSERT INTO `_migrations` VALUES (1,'001_create_cases.sql','2026-07-09 00:42:03'),(2,'002_create_case_files.sql','2026-07-09 00:42:03'),(3,'003_fix_doctors_fk_to_users.sql','2026-07-09 00:43:05'),(4,'004_create_audit_log.sql','2026-07-09 00:43:05'),(5,'005_add_bank_account_to_invoices.sql','2026-07-09 01:42:12'),(6,'006_add_parent_id_clinic_id.sql','2026-07-22 17:25:32'),(7,'007_create_roles_table.sql','2026-07-22 17:25:32'),(8,'008_add_designer.sql','2026-09-01 00:51:14'),(9,'009_create_notifications.sql','2026-09-01 00:51:14'),(10,'010_add_receipt_number.sql','2026-09-01 00:51:14'),(11,'011_lab_billing.sql','2026-09-01 00:51:14'),(12,'012_add_entity_comments.sql','2026-09-01 00:51:14'),(13,'013_create_notifications.sql','2026-09-01 00:51:14'),(14,'014_case_design_fee_and_price_override_type.sql','2026-09-01 00:51:14'),(15,'015_designer_case_scope.sql','2026-09-01 00:51:14'),(16,'016_designer_view_all_cases_and_user_uploads.sql','2026-09-01 00:51:14'),(17,'017_doctor_create_cases_and_designer_case_scope.sql','2026-09-01 00:51:14'),(18,'018_designer_invoices.sql','2026-09-01 00:51:14'),(19,'019_doctor_gallery.sql','2026-09-01 00:51:14'),(20,'020_label_marking_and_outsourcing.sql','2026-09-01 00:51:14'),(21,'021_side_outsourcing.sql','2026-09-01 00:51:14'),(22,'022_outsourced_rate.sql','2026-09-01 00:51:14'),(23,'023_file_descriptions.sql','2026-09-01 00:51:14'),(24,'024_branches.sql','2026-09-01 00:51:14'),(25,'025_branch_admin_role.sql','2026-09-01 00:51:14'),(26,'026_branch_ownership.sql','2026-09-01 00:51:14'),(27,'027_doctor_lab_affiliation.sql','2026-09-01 00:51:14'),(28,'028_expense_payments.sql','2026-09-01 00:51:14'),(29,'029_shared_prices_and_default_designer.sql','2026-09-01 00:51:14'),(30,'030_reassign_cases_to_doctor_branch.sql','2026-09-01 00:51:14'),(31,'031_branch_receivables.sql','2026-09-01 00:51:14'),(32,'032_fix_outsource_source_branch.sql','2026-09-01 00:51:14'),(33,'033_central_lab_user.sql','2026-09-01 00:51:14'),(34,'034_fix_qazvin_outsource_cases.sql','2026-09-01 00:51:14'),(35,'035_fix_outsource_rates_unique.sql','2026-09-01 00:51:14'),(36,'036_price_links.sql','2026-09-01 00:51:14'),(37,'037_unify_price_links.sql','2026-09-01 00:51:14'),(38,'038_case_files_uploader.sql','2026-09-01 00:51:14'),(39,'039_case_files_file_type.sql','2026-09-01 00:51:14'),(40,'040_role_permissions.sql','2026-09-01 00:51:14'),(41,'041_case_activity_log.sql','2026-09-01 00:51:14'),(42,'042_fix_design_fees.sql','2026-09-01 00:51:14'),(43,'043_fix_design_fee_1126.sql','2026-09-01 00:51:14'),(44,'044_fix_design_fee_1141_1159.sql','2026-09-01 00:52:04');
/*!40000 ALTER TABLE `_migrations` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `audit_log`
--

DROP TABLE IF EXISTS `audit_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `audit_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) DEFAULT NULL,
  `action` varchar(100) NOT NULL,
  `entity_type` varchar(50) DEFAULT NULL,
  `entity_id` int(11) DEFAULT NULL,
  `details` text DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `idx_audit_log_user_id` (`user_id`),
  KEY `idx_audit_log_action` (`action`),
  KEY `idx_audit_log_entity` (`entity_type`,`entity_id`),
  KEY `idx_audit_log_created_at` (`created_at`)
) ENGINE=InnoDB AUTO_INCREMENT=360 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `audit_log`
--

LOCK TABLES `audit_log` WRITE;
/*!40000 ALTER TABLE `audit_log` DISABLE KEYS */;
INSERT INTO `audit_log` VALUES (1,1,'create_bank_account','bank_account',2,'حساب بانکی #2','::1','2026-07-09 01:24:26'),(2,1,'delete_invoice','invoice',8,'حذف فاکتور #8','::1','2026-07-09 01:25:13'),(3,1,'update_invoice','invoice',9,'فاکتور #9','::1','2026-07-09 02:01:03'),(4,1,'delete_invoice','invoice',9,'حذف فاکتور #9','::1','2026-07-09 02:11:51'),(5,1,'create_user','user',11,'کاربر #11','::1','2026-07-10 16:16:20'),(6,1,'update_user','user',3,'کاربر #3','::1','2026-07-10 16:16:46'),(7,1,'create_doctor','doctor',12,'پزشک #12','5.117.26.217','2026-07-15 01:44:29'),(8,1,'create_user','user',13,'کاربر #13','109.125.166.71','2026-07-21 13:05:54'),(9,1,'update_user','user',11,'کاربر #11','93.114.98.123','2026-07-22 17:29:03'),(10,1,'update_user','user',11,'کاربر #11','93.114.98.243','2026-07-28 03:51:51'),(11,1,'update_user','user',1,'کاربر #1','93.114.98.243','2026-07-28 03:52:03'),(12,1,'update_invoice','invoice',10,'فاکتور #10','109.125.166.99','2026-07-30 12:33:36'),(13,1,'delete_invoice','invoice',10,'حذف فاکتور #10','109.125.166.99','2026-07-30 12:37:33'),(14,1,'update_invoice','invoice',11,'فاکتور #11','5.212.234.234','2026-07-30 12:58:43'),(15,1,'delete_invoice','invoice',11,'حذف فاکتور #11','5.212.234.234','2026-07-30 12:58:58'),(16,1,'delete_invoice','invoice',12,'حذف فاکتور #12','5.212.234.234','2026-07-30 13:32:43'),(17,1,'update_invoice','invoice',13,'فاکتور #13','5.212.234.234','2026-07-30 13:36:15'),(18,1,'delete_invoice','invoice',13,'حذف فاکتور #13','5.212.234.234','2026-07-30 13:36:55'),(19,1,'delete_invoice','invoice',14,'حذف فاکتور #14','5.212.234.234','2026-07-30 13:45:43'),(20,1,'update_invoice','invoice',15,'فاکتور #15','5.212.234.234','2026-07-30 13:46:37'),(21,1,'delete_invoice','invoice',15,'حذف فاکتور #15','93.114.98.243','2026-07-30 14:10:58'),(22,1,'update_invoice','invoice',16,'فاکتور #16','93.114.98.243','2026-07-30 14:14:14'),(23,1,'delete_invoice','invoice',16,'حذف فاکتور #16','93.114.98.243','2026-07-30 14:14:21'),(24,1,'update_invoice','invoice',17,'فاکتور #17','5.212.234.234','2026-07-30 14:23:18'),(25,1,'update_invoice','invoice',17,'فاکتور #17','5.212.234.234','2026-07-30 14:31:59'),(26,1,'create_user','user',14,'کاربر #14','109.125.166.121','2026-08-01 11:36:42'),(27,1,'create_user','user',15,'کاربر #15','109.125.166.121','2026-08-01 11:43:18'),(28,1,'update_user','user',14,'کاربر #14','109.125.167.106','2026-08-01 13:00:56'),(29,1,'create_user','user',16,'کاربر #16','109.125.167.106','2026-08-01 13:02:21'),(30,1,'create_user','user',17,'کاربر #17','109.125.167.106','2026-08-01 13:11:45'),(31,1,'create_price','price',11,'قیمت #11','109.125.167.106','2026-08-01 13:12:46'),(32,1,'create_user','user',18,'کاربر #18','109.125.167.173','2026-08-05 15:27:58'),(33,1,'create_payment','payment',1,'پرداخت #1','5.115.125.16','2026-08-08 06:30:38'),(34,1,'update_payment','payment',1,'پرداخت #1','5.115.125.16','2026-08-08 06:31:16'),(35,1,'update_payment','payment',1,'پرداخت #1','109.125.167.151','2026-08-08 15:11:41'),(36,1,'create_doctor','doctor',19,'پزشک #19','109.125.167.151','2026-08-08 15:17:00'),(37,1,'create_doctor','doctor',20,'پزشک #20','109.125.167.151','2026-08-08 15:17:57'),(38,1,'create_doctor','doctor',21,'پزشک #21','109.125.167.151','2026-08-08 15:18:34'),(39,1,'update_doctor','doctor',21,'پزشک #21','109.125.167.151','2026-08-08 15:18:56'),(40,1,'update_user','user',13,'کاربر #13','109.125.167.151','2026-08-08 15:19:53'),(41,1,'create_price_override','price_override',2,'قیمت اختصاصی #2','87.120.106.216','2026-08-08 16:41:13'),(42,1,'create_price_override','price_override',3,'قیمت اختصاصی #3','87.120.106.216','2026-08-08 16:41:38'),(43,1,'update_price_override','price_override',3,'قیمت اختصاصی #3','87.120.106.216','2026-08-08 16:42:23'),(44,1,'update_user','user',18,'کاربر #18','87.120.106.216','2026-08-08 18:07:34'),(45,1,'create_doctor','doctor',22,'پزشک #22','87.120.106.216','2026-08-08 18:40:30'),(46,1,'update_invoice','invoice',18,'فاکتور #18','5.116.254.39','2026-08-08 22:56:32'),(47,1,'create_user','user',23,'کاربر #23','109.125.166.1','2026-08-09 15:23:36'),(48,1,'create_user','user',1,'تغییر رمز عبور #1','109.125.166.1','2026-08-09 15:25:24'),(49,1,'update_user','user',23,'کاربر #23','109.125.166.1','2026-08-09 15:26:16'),(50,23,'create_case_status','case_status',1085,'تغییر وضعیت کیس #1085','213.156.152.55','2026-08-09 18:49:06'),(51,1,'update_doctor','doctor',3,'پزشک #3','213.156.152.55','2026-08-09 18:55:23'),(52,1,'create_user','user',24,'کاربر #24','213.156.152.55','2026-08-09 19:08:59'),(53,1,'update_role','role',6,'نقش #6','213.156.152.55','2026-08-09 19:09:58'),(54,1,'create_price_override','price_override',4,'قیمت اختصاصی #4','213.156.152.55','2026-08-09 19:17:22'),(55,1,'create_price_override','price_override',4,'قیمت اختصاصی #4','213.156.152.55','2026-08-09 19:17:40'),(56,1,'create_doctor','doctor',25,'پزشک #25','213.156.152.55','2026-08-09 19:29:47'),(57,23,'create_case_status','case_status',1085,'تغییر وضعیت کیس #1085','151.234.160.28','2026-08-09 22:12:26'),(58,1,'create_doctor_gallery','doctor_gallery',3,'گالری پروفایل پزشک #3','5.116.44.203','2026-08-10 15:37:42'),(59,1,'create_doctor_gallery','doctor_gallery',3,'گالری پروفایل پزشک #3','5.116.44.203','2026-08-10 15:38:31'),(60,1,'create_doctor_gallery','doctor_gallery',3,'گالری پروفایل پزشک #3','5.116.44.203','2026-08-10 15:39:16'),(61,1,'create_doctor_gallery','doctor_gallery',3,'گالری پروفایل پزشک #3','5.116.44.203','2026-08-10 15:39:45'),(62,1,'create_doctor_gallery','doctor_gallery',3,'گالری پروفایل پزشک #3','5.116.44.203','2026-08-10 15:40:36'),(63,23,'create_case_status','case_status',1060,'تغییر وضعیت کیس #1060','151.234.160.25','2026-08-10 16:41:36'),(64,1,'update_doctor','doctor',12,'پزشک #12','109.125.167.152','2026-08-10 19:15:48'),(65,1,'update_user','user',11,'کاربر #11','109.125.167.152','2026-08-10 19:28:15'),(66,1,'update_user','user',17,'کاربر #17','109.125.167.152','2026-08-10 19:28:25'),(67,1,'update_doctor','doctor',12,'پزشک #12','192.15.254.116','2026-08-11 18:09:13'),(68,23,'create_case_status','case_status',1111,'تغییر وضعیت کیس #1111','31.7.98.35','2026-08-13 19:44:55'),(69,23,'create_case_status','case_status',1111,'تغییر وضعیت کیس #1111','31.7.98.35','2026-08-13 20:00:34'),(70,23,'create_case_status','case_status',1107,'تغییر وضعیت کیس #1107','31.7.98.40','2026-08-14 12:47:49'),(71,23,'create_case_status','case_status',1107,'تغییر وضعیت کیس #1107','31.7.98.40','2026-08-14 12:55:20'),(72,23,'create_case_status','case_status',1108,'تغییر وضعیت کیس #1108','31.7.98.40','2026-08-14 12:55:38'),(73,23,'create_case_status','case_status',1108,'تغییر وضعیت کیس #1108','31.7.98.40','2026-08-14 13:11:02'),(74,23,'create_case_status','case_status',1110,'تغییر وضعیت کیس #1110','31.7.98.40','2026-08-14 13:12:48'),(75,23,'create_case_status','case_status',1110,'تغییر وضعیت کیس #1110','31.7.98.40','2026-08-14 13:22:09'),(76,23,'create_case_status','case_status',1110,'تغییر وضعیت کیس #1110','31.7.98.40','2026-08-14 13:22:11'),(77,23,'create_case_status','case_status',1106,'تغییر وضعیت کیس #1106','31.7.98.40','2026-08-14 13:29:54'),(78,23,'create_case_status','case_status',1106,'تغییر وضعیت کیس #1106','31.7.98.40','2026-08-14 13:35:51'),(79,23,'create_case_status','case_status',1106,'تغییر وضعیت کیس #1106','31.7.98.40','2026-08-14 13:35:53'),(80,23,'create_case_status','case_status',1102,'تغییر وضعیت کیس #1102','31.7.98.40','2026-08-14 13:39:32'),(81,23,'create_case_status','case_status',1097,'تغییر وضعیت کیس #1097','31.7.98.40','2026-08-14 13:53:10'),(82,23,'create_case_status','case_status',1097,'تغییر وضعیت کیس #1097','31.7.98.40','2026-08-14 14:02:18'),(83,23,'create_case_status','case_status',1098,'تغییر وضعیت کیس #1098','31.7.98.40','2026-08-14 14:03:22'),(84,23,'create_case_status','case_status',1098,'تغییر وضعیت کیس #1098','31.7.98.40','2026-08-14 14:19:49'),(85,23,'create_case_status','case_status',1102,'تغییر وضعیت کیس #1102','31.7.98.40','2026-08-14 14:37:43'),(86,23,'create_case_status','case_status',1099,'تغییر وضعیت کیس #1099','31.7.98.40','2026-08-14 14:38:56'),(87,23,'create_case_status','case_status',1112,'تغییر وضعیت کیس #1112','31.7.98.40','2026-08-14 17:55:41'),(88,23,'create_case_status','case_status',1112,'تغییر وضعیت کیس #1112','31.7.96.30','2026-08-14 21:04:15'),(89,23,'create_case_status','case_status',1101,'تغییر وضعیت کیس #1101','31.7.96.30','2026-08-14 21:15:12'),(90,1,'create_case_status','case_status',1114,'تغییر وضعیت کیس #1114','109.125.167.33','2026-08-15 14:48:46'),(91,1,'create_case_status','case_status',1115,'تغییر وضعیت کیس #1115','109.125.167.33','2026-08-15 14:49:07'),(92,1,'create_case_status','case_status',1113,'تغییر وضعیت کیس #1113','109.125.167.33','2026-08-15 14:50:27'),(93,1,'create_case_status','case_status',1114,'تغییر وضعیت کیس #1114','109.125.167.33','2026-08-15 14:51:03'),(94,1,'create_case_status','case_status',1110,'تغییر وضعیت کیس #1110','87.120.106.139','2026-08-15 15:42:26'),(95,1,'create_case_status','case_status',1060,'تغییر وضعیت کیس #1060','87.120.106.139','2026-08-15 15:42:42'),(96,1,'create_case_designer','case_designer',1088,'تغییر طراح کیس #1088','5.215.45.187','2026-08-15 17:29:43'),(97,1,'create_case_status','case_status',1088,'تغییر وضعیت کیس #1088','5.215.45.187','2026-08-15 17:30:16'),(98,23,'create_case_status','case_status',1099,'تغییر وضعیت کیس #1099','151.234.160.168','2026-08-15 20:29:35'),(99,23,'create_case_status','case_status',1078,'تغییر وضعیت کیس #1078','151.234.160.168','2026-08-15 20:35:08'),(100,1,'create_price','price',12,'قیمت #12','109.125.166.76','2026-08-15 20:58:59'),(101,1,'create_price','price',13,'قیمت #13','109.125.166.76','2026-08-15 20:59:30'),(102,1,'create_case_designer','case_designer',1116,'تغییر طراح کیس #1116','109.125.166.156','2026-08-16 10:25:42'),(103,1,'create_case_designer','case_designer',1117,'تغییر طراح کیس #1117','109.125.166.156','2026-08-16 10:25:42'),(104,1,'create_case_designer','case_designer',1124,'تغییر طراح کیس #1124','109.125.166.156','2026-08-16 10:25:42'),(105,1,'create_case_designer','case_designer',1125,'تغییر طراح کیس #1125','109.125.166.156','2026-08-16 10:25:42'),(106,1,'create_case_designer','case_designer',1115,'تغییر طراح کیس #1115','109.125.166.156','2026-08-16 10:25:42'),(107,1,'create_case_designer','case_designer',1114,'تغییر طراح کیس #1114','109.125.166.156','2026-08-16 10:25:42'),(108,1,'create_case_designer','case_designer',1090,'تغییر طراح کیس #1090','109.125.166.156','2026-08-16 10:25:42'),(109,1,'create_case_designer','case_designer',1123,'تغییر طراح کیس #1123','109.125.166.156','2026-08-16 10:25:42'),(110,1,'create_case_designer','case_designer',1088,'تغییر طراح کیس #1088','109.125.166.156','2026-08-16 10:25:42'),(111,1,'create_case_designer','case_designer',1101,'تغییر طراح کیس #1101','109.125.166.156','2026-08-16 10:25:42'),(112,1,'create_case_designer','case_designer',1078,'تغییر طراح کیس #1078','109.125.166.156','2026-08-16 10:25:42'),(113,1,'create_user','user',26,'کاربر #26','109.125.166.145','2026-08-17 11:55:02'),(114,1,'create_case_designer','case_designer',1127,'تغییر طراح کیس #1127','109.125.166.145','2026-08-17 12:05:10'),(115,1,'create_case_designer','case_designer',1101,'تغییر طراح کیس #1101','109.125.166.145','2026-08-17 12:05:30'),(116,1,'create_case_designer','case_designer',1088,'تغییر طراح کیس #1088','109.125.166.145','2026-08-17 12:07:00'),(117,1,'create_case_designer','case_designer',1123,'تغییر طراح کیس #1123','109.125.166.145','2026-08-17 12:14:31'),(118,1,'create_case_designer','case_designer',1090,'تغییر طراح کیس #1090','109.125.166.145','2026-08-17 12:15:10'),(119,1,'create_case_designer','case_designer',1114,'تغییر طراح کیس #1114','109.125.166.145','2026-08-17 12:15:23'),(120,1,'create_case_designer','case_designer',1099,'تغییر طراح کیس #1099','109.125.166.145','2026-08-17 12:15:37'),(121,1,'create_case_designer','case_designer',1115,'تغییر طراح کیس #1115','109.125.166.145','2026-08-17 12:21:37'),(122,1,'create_case_designer','case_designer',1125,'تغییر طراح کیس #1125','109.125.166.145','2026-08-17 12:22:03'),(123,1,'create_case_designer','case_designer',1124,'تغییر طراح کیس #1124','109.125.166.145','2026-08-17 12:29:46'),(124,1,'create_case_designer','case_designer',1117,'تغییر طراح کیس #1117','109.125.166.145','2026-08-17 12:30:15'),(125,1,'create_case_designer','case_designer',1117,'تغییر طراح کیس #1117','109.125.166.145','2026-08-17 12:30:26'),(126,1,'create_case_designer','case_designer',1116,'تغییر طراح کیس #1116','109.125.166.145','2026-08-17 12:30:36'),(127,1,'create_case_designer','case_designer',1128,'تغییر طراح کیس #1128','109.125.166.145','2026-08-17 12:30:46'),(128,1,'create_case_designer','case_designer',1126,'تغییر طراح کیس #1126','109.125.166.145','2026-08-17 12:31:11'),(129,1,'create_case_status','case_status',1112,'تغییر وضعیت کیس #1112','109.125.166.145','2026-08-17 13:05:23'),(130,1,'create_case_designer','case_designer',1112,'تغییر طراح کیس #1112','109.125.166.145','2026-08-17 13:05:25'),(131,1,'create_case_status','case_status',1101,'تغییر وضعیت کیس #1101','109.125.166.145','2026-08-17 13:40:08'),(132,1,'create_case_designer','case_designer',1112,'تغییر طراح کیس #1112','109.125.166.145','2026-08-17 13:41:02'),(133,1,'create_case_designer','case_designer',1108,'تغییر طراح کیس #1108','109.125.167.126','2026-08-17 15:29:30'),(134,1,'create_case_designer','case_designer',1115,'تغییر طراح کیس #1115','109.125.167.126','2026-08-17 15:29:53'),(135,1,'create_case_designer','case_designer',1115,'تغییر طراح کیس #1115','109.125.167.126','2026-08-17 15:30:19'),(136,1,'create_case_status','case_status',1097,'تغییر وضعیت کیس #1097','109.125.167.150','2026-08-17 16:08:30'),(137,1,'create_case_designer','case_designer',1097,'تغییر طراح کیس #1097','109.125.167.150','2026-08-17 16:08:32'),(138,1,'create_case_designer','case_designer',1127,'تغییر طراح کیس #1127','109.125.167.150','2026-08-17 16:18:42'),(139,1,'create_case_designer','case_designer',1101,'تغییر طراح کیس #1101','93.114.98.68','2026-08-17 16:41:59'),(140,1,'create_price_override','price_override',5,'قیمت اختصاصی #5','93.114.98.68','2026-08-17 16:43:50'),(141,1,'create_case_designer','case_designer',1117,'تغییر طراح کیس #1117','93.114.98.68','2026-08-17 16:50:35'),(142,1,'create_case_designer','case_designer',1116,'تغییر طراح کیس #1116','109.125.167.150','2026-08-17 17:25:03'),(143,1,'create_case_designer','case_designer',1125,'تغییر طراح کیس #1125','202.78.163.245','2026-08-17 19:30:49'),(144,1,'create_case_status','case_status',1123,'تغییر وضعیت کیس #1123','93.114.98.202','2026-08-18 19:29:19'),(145,1,'delete_invoice','invoice',18,'حذف فاکتور #18','93.114.98.202','2026-08-18 19:39:42'),(146,1,'delete_price_override','price_override',1,'حذف قیمت اختصاصی #1','87.120.106.139','2026-08-19 14:15:18'),(147,1,'delete_invoice','invoice',21,'حذف فاکتور #21','87.120.106.139','2026-08-19 14:19:44'),(148,1,'delete_invoice','invoice',20,'حذف فاکتور #20','87.120.106.139','2026-08-19 14:19:48'),(149,1,'update_invoice','invoice',22,'فاکتور #22','87.120.106.139','2026-08-19 14:20:56'),(150,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','109.125.166.64','2026-08-19 15:50:55'),(151,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.166.64','2026-08-19 15:51:38'),(152,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.166.64','2026-08-19 15:54:37'),(153,24,'login','user',24,'ورود موفق به سیستم (DONYA)','109.125.166.64','2026-08-19 16:25:36'),(154,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.70.229','2026-08-19 18:50:16'),(155,26,'create_case_status','case_status',1090,'تغییر وضعیت کیس #1090','37.129.70.229','2026-08-19 18:51:02'),(156,26,'create_case_status','case_status',1102,'تغییر وضعیت کیس #1102','37.129.70.229','2026-08-19 18:54:01'),(157,26,'create_case_status','case_status',1114,'تغییر وضعیت کیس #1114','37.129.70.229','2026-08-19 18:54:18'),(158,26,'create_case_status','case_status',1115,'تغییر وضعیت کیس #1115','37.129.70.229','2026-08-19 18:54:31'),(159,26,'create_case_status','case_status',1124,'تغییر وضعیت کیس #1124','37.129.70.229','2026-08-19 18:54:42'),(160,26,'create_case_status','case_status',1126,'تغییر وضعیت کیس #1126','37.129.70.229','2026-08-19 18:54:58'),(161,26,'create_case_status','case_status',1126,'تغییر وضعیت کیس #1126','37.129.70.229','2026-08-19 18:54:58'),(162,26,'create_case_status','case_status',1126,'تغییر وضعیت کیس #1126','37.129.70.229','2026-08-19 18:55:13'),(163,26,'create_case_status','case_status',1128,'تغییر وضعیت کیس #1128','37.129.70.229','2026-08-19 18:55:38'),(164,26,'create_case_status','case_status',1131,'تغییر وضعیت کیس #1131','37.129.70.229','2026-08-19 19:35:03'),(165,26,'create_case_status','case_status',1132,'تغییر وضعیت کیس #1132','37.129.70.229','2026-08-19 19:47:25'),(166,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.70.229','2026-08-20 00:47:37'),(167,26,'create_case_status','case_status',1090,'تغییر وضعیت کیس #1090','37.129.70.229','2026-08-20 00:57:28'),(168,1,'login','user',1,'ورود موفق به سیستم (admin)','83.121.93.2','2026-08-20 01:06:14'),(169,26,'create_case_status','case_status',1102,'تغییر وضعیت کیس #1102','83.123.153.118','2026-08-20 01:41:20'),(170,26,'create_case_status','case_status',1114,'تغییر وضعیت کیس #1114','83.123.153.118','2026-08-20 01:41:32'),(171,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.122.74.127','2026-08-20 08:14:23'),(172,26,'create_case_status','case_status',1115,'تغییر وضعیت کیس #1115','83.122.74.127','2026-08-20 08:15:12'),(173,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.122.74.127','2026-08-20 11:08:17'),(174,26,'create_case_status','case_status',1126,'تغییر وضعیت کیس #1126','83.122.74.127','2026-08-20 11:08:28'),(175,26,'create_case_status','case_status',1124,'تغییر وضعیت کیس #1124','83.122.74.127','2026-08-20 11:11:57'),(176,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.122.66.50','2026-08-20 15:28:06'),(177,26,'create_case_status','case_status',1128,'تغییر وضعیت کیس #1128','83.122.66.50','2026-08-20 15:28:21'),(178,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.122.160.74','2026-08-20 16:31:01'),(179,1,'login','user',1,'ورود موفق به سیستم (admin)','5.117.41.122','2026-08-20 18:31:46'),(180,13,'login','user',13,'ورود موفق به سیستم (fatabjikhala)','5.117.41.122','2026-08-20 18:32:51'),(181,1,'login','user',1,'ورود موفق به سیستم (admin)','5.117.41.122','2026-08-20 18:35:28'),(182,1,'create_payment','payment',2,'پرداخت #2','5.117.41.122','2026-08-20 18:53:05'),(183,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.122.160.74','2026-08-20 19:13:44'),(184,1,'login','user',1,'ورود موفق به سیستم (admin)','93.114.98.68','2026-08-21 11:47:27'),(185,1,'login','user',1,'ورود موفق به سیستم (admin)','93.114.98.202','2026-08-21 16:16:15'),(186,1,'login','user',1,'ورود موفق به سیستم (admin)','83.120.68.67','2026-08-21 18:21:26'),(187,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.83.159','2026-08-22 08:29:17'),(188,24,'login','user',24,'ورود موفق به سیستم (DONYA)','109.125.166.144','2026-08-22 11:56:09'),(189,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.166.144','2026-08-22 12:52:46'),(190,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.83.159','2026-08-22 14:09:42'),(191,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.166.144','2026-08-22 14:37:49'),(192,24,'login','user',24,'ورود موفق به سیستم (DONYA)','109.125.166.144','2026-08-22 14:40:16'),(193,1,'create_case_designer','case_designer',1130,'تغییر طراح کیس #1130','109.125.167.76','2026-08-22 15:20:13'),(194,1,'create_case_designer','case_designer',1129,'تغییر طراح کیس #1129','109.125.167.76','2026-08-22 15:20:13'),(195,13,'login','user',13,'ورود موفق به سیستم (fatabjikhala)','5.106.188.21','2026-08-22 16:14:42'),(196,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.123.156.50','2026-08-22 18:04:14'),(197,26,'create_case_status','case_status',1141,'تغییر وضعیت کیس #1141','83.123.156.50','2026-08-22 18:51:02'),(198,26,'create_case_status','case_status',1141,'تغییر وضعیت کیس #1141','83.123.156.50','2026-08-22 18:51:05'),(199,26,'create_case_status','case_status',1141,'تغییر وضعیت کیس #1141','83.123.156.50','2026-08-22 18:51:07'),(200,26,'create_case_status','case_status',1141,'تغییر وضعیت کیس #1141','83.123.156.50','2026-08-22 18:51:09'),(201,26,'create_case_status','case_status',1141,'تغییر وضعیت کیس #1141','83.123.156.50','2026-08-22 18:51:13'),(202,26,'create_case_status','case_status',1141,'تغییر وضعیت کیس #1141','83.123.156.50','2026-08-22 18:51:18'),(203,1,'create_case_status','case_status',1144,'تغییر وضعیت کیس #1144','109.125.167.163','2026-08-22 19:21:30'),(204,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.167.127','2026-08-23 12:56:15'),(205,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.20.206','2026-08-23 12:56:54'),(206,1,'create_case_designer','case_designer',1068,'تغییر طراح کیس #1068','5.117.47.52','2026-08-23 13:17:33'),(207,1,'create_case_status','case_status',1068,'تغییر وضعیت کیس #1068','5.117.47.52','2026-08-23 13:17:37'),(208,1,'login','user',1,'ورود موفق به سیستم (admin)','5.117.47.52','2026-08-23 18:25:36'),(209,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.195.133','2026-08-23 18:44:04'),(210,1,'create_payment','payment',3,'پرداخت #3','109.125.167.13','2026-08-23 18:51:22'),(211,1,'create_payment','payment',4,'پرداخت #4','109.125.167.13','2026-08-23 18:58:13'),(212,26,'create_case_status','case_status',1131,'تغییر وضعیت کیس #1131','37.129.195.133','2026-08-23 19:02:46'),(213,26,'create_case_status','case_status',1132,'تغییر وضعیت کیس #1132','37.129.195.133','2026-08-23 19:16:13'),(214,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.123.138.183','2026-08-24 07:06:36'),(215,26,'create_case_status','case_status',1129,'تغییر وضعیت کیس #1129','83.123.138.183','2026-08-24 07:08:17'),(216,26,'create_case_status','case_status',1130,'تغییر وضعیت کیس #1130','83.123.138.183','2026-08-24 07:09:01'),(217,26,'create_case_status','case_status',1140,'تغییر وضعیت کیس #1140','83.123.138.183','2026-08-24 07:09:34'),(218,26,'create_case_status','case_status',1142,'تغییر وضعیت کیس #1142','83.123.138.183','2026-08-24 07:09:53'),(219,26,'create_case_status','case_status',1133,'تغییر وضعیت کیس #1133','83.123.138.183','2026-08-24 07:10:22'),(220,26,'create_case_status','case_status',1134,'تغییر وضعیت کیس #1134','83.123.138.183','2026-08-24 07:11:06'),(221,26,'create_case_status','case_status',1135,'تغییر وضعیت کیس #1135','83.123.138.183','2026-08-24 07:11:24'),(222,26,'create_case_status','case_status',1135,'تغییر وضعیت کیس #1135','83.123.138.183','2026-08-24 07:11:26'),(223,26,'create_case_status','case_status',1135,'تغییر وضعیت کیس #1135','83.123.138.183','2026-08-24 07:11:28'),(224,26,'create_case_status','case_status',1135,'تغییر وضعیت کیس #1135','83.123.138.183','2026-08-24 07:11:28'),(225,26,'create_case_status','case_status',1136,'تغییر وضعیت کیس #1136','83.123.138.183','2026-08-24 07:11:40'),(226,26,'create_case_status','case_status',1137,'تغییر وضعیت کیس #1137','83.123.138.183','2026-08-24 07:11:50'),(227,26,'create_case_status','case_status',1145,'تغییر وضعیت کیس #1145','83.123.138.183','2026-08-24 07:12:00'),(228,26,'create_case_status','case_status',1146,'تغییر وضعیت کیس #1146','83.123.138.183','2026-08-24 07:12:11'),(229,26,'create_case_status','case_status',1143,'تغییر وضعیت کیس #1143','83.123.138.183','2026-08-24 07:12:35'),(230,26,'create_case_status','case_status',1147,'تغییر وضعیت کیس #1147','83.123.138.183','2026-08-24 07:12:45'),(231,1,'login','user',1,'ورود موفق به سیستم (admin)','5.115.149.155','2026-08-24 10:00:54'),(232,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.123.138.183','2026-08-24 11:02:48'),(233,26,'create_case_status','case_status',1129,'تغییر وضعیت کیس #1129','83.123.138.183','2026-08-24 11:03:26'),(234,26,'create_case_status','case_status',1130,'تغییر وضعیت کیس #1130','83.123.138.183','2026-08-24 11:08:15'),(235,26,'create_case_status','case_status',1140,'تغییر وضعیت کیس #1140','83.123.138.183','2026-08-24 11:13:08'),(236,26,'create_case_status','case_status',1142,'تغییر وضعیت کیس #1142','83.123.138.183','2026-08-24 11:28:58'),(237,1,'login','user',1,'ورود موفق به سیستم (admin)','85.234.65.170','2026-08-24 13:23:01'),(238,1,'create_case_status','case_status',1131,'تغییر وضعیت کیس #1131','85.234.65.170','2026-08-24 13:23:09'),(239,1,'create_price','price',14,'قیمت #14','109.125.167.241','2026-08-24 18:56:19'),(240,1,'update_price','price',14,'قیمت #14','109.125.167.160','2026-08-24 19:17:44'),(241,1,'create_price','price',15,'قیمت #15','109.125.167.160','2026-08-24 19:18:33'),(242,1,'create_price_override','price_override',6,'قیمت اختصاصی #6','109.125.167.160','2026-08-24 19:19:07'),(243,1,'create_price_override','price_override',7,'قیمت اختصاصی #7','109.125.167.160','2026-08-24 19:19:25'),(244,1,'update_price','price',14,'قیمت #14','109.125.167.160','2026-08-24 19:20:42'),(245,1,'login','user',1,'ورود موفق به سیستم (admin)','5.116.200.140','2026-08-24 21:51:56'),(246,1,'create_price','price',16,'قیمت #16','5.116.200.140','2026-08-24 21:53:57'),(247,1,'create_price','price',17,'قیمت #17','5.116.200.140','2026-08-24 21:55:29'),(248,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.166.168','2026-08-25 12:50:24'),(249,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','83.123.134.62','2026-08-25 13:57:33'),(250,26,'create_case_status','case_status',1133,'تغییر وضعیت کیس #1133','83.123.134.62','2026-08-25 13:58:06'),(251,26,'create_case_status','case_status',1134,'تغییر وضعیت کیس #1134','83.123.134.62','2026-08-25 13:58:38'),(252,26,'create_case_status','case_status',1136,'تغییر وضعیت کیس #1136','83.123.134.62','2026-08-25 14:00:09'),(253,13,'login','user',13,'ورود موفق به سیستم (fatabjikhala)','86.55.235.156','2026-08-25 16:58:49'),(254,1,'login','user',1,'ورود موفق به سیستم (admin)','213.156.152.55','2026-08-25 20:03:21'),(255,1,'login','user',1,'ورود موفق به سیستم (admin)','5.123.57.112','2026-08-25 21:14:01'),(256,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.96.137','2026-08-25 21:34:35'),(257,26,'create_case_status','case_status',1135,'تغییر وضعیت کیس #1135','37.129.96.137','2026-08-25 21:36:23'),(258,26,'create_case_status','case_status',1137,'تغییر وضعیت کیس #1137','37.129.96.137','2026-08-25 21:44:37'),(259,26,'create_case_status','case_status',1145,'تغییر وضعیت کیس #1145','37.129.96.137','2026-08-25 21:45:34'),(260,26,'create_case_status','case_status',1146,'تغییر وضعیت کیس #1146','37.129.96.137','2026-08-25 21:45:44'),(261,26,'create_case_status','case_status',1146,'تغییر وضعیت کیس #1146','37.129.96.137','2026-08-25 21:45:55'),(262,26,'create_case_status','case_status',1143,'تغییر وضعیت کیس #1143','37.129.96.137','2026-08-25 23:08:44'),(263,26,'create_case_status','case_status',1143,'تغییر وضعیت کیس #1143','37.129.96.137','2026-08-25 23:13:52'),(264,26,'create_case_status','case_status',1147,'تغییر وضعیت کیس #1147','37.129.96.137','2026-08-25 23:14:50'),(265,26,'create_case_status','case_status',1147,'تغییر وضعیت کیس #1147','37.129.96.137','2026-08-25 23:59:56'),(266,26,'create_case_status','case_status',1147,'تغییر وضعیت کیس #1147','37.129.96.137','2026-08-25 23:59:57'),(267,26,'create_case_status','case_status',1147,'تغییر وضعیت کیس #1147','37.129.96.137','2026-08-25 23:59:57'),(268,1,'login','user',1,'ورود موفق به سیستم (admin)','57.131.18.135','2026-08-26 09:59:38'),(269,1,'create_price_override','price_override',8,'قیمت اختصاصی #8','57.131.18.135','2026-08-26 10:00:02'),(270,1,'create_price_override','price_override',9,'قیمت اختصاصی #9','57.131.18.135','2026-08-26 10:00:19'),(271,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.96.137','2026-08-26 12:41:55'),(272,26,'create_case_status','case_status',1102,'تغییر وضعیت کیس #1102','37.129.96.137','2026-08-26 12:49:26'),(273,26,'create_case_status','case_status',1102,'تغییر وضعیت کیس #1102','37.129.96.137','2026-08-26 12:50:09'),(274,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:36:23'),(275,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:36:23'),(276,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:49'),(277,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:49'),(278,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:49'),(279,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:49'),(280,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:49'),(281,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:49'),(282,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','109.203.140.6','2026-08-26 13:37:53'),(283,26,'create_case_status','case_status',1150,'تغییر وضعیت کیس #1150','109.203.140.6','2026-08-26 13:38:30'),(284,26,'create_case_status','case_status',1151,'تغییر وضعیت کیس #1151','109.203.140.6','2026-08-26 13:38:47'),(285,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.167.41','2026-08-26 16:38:55'),(286,1,'update_invoice','invoice',25,'فاکتور #25','109.125.167.41','2026-08-26 16:56:02'),(287,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.167.41','2026-08-26 17:35:50'),(288,1,'delete_invoice','invoice',25,'حذف فاکتور #25','109.125.167.41','2026-08-26 17:36:52'),(289,1,'delete_invoice','invoice',24,'حذف فاکتور #24','109.125.167.41','2026-08-26 17:36:57'),(290,1,'delete_invoice','invoice',23,'حذف فاکتور #23','109.125.167.41','2026-08-26 17:37:03'),(291,1,'update_invoice','invoice',27,'فاکتور #27','109.125.167.41','2026-08-26 17:40:37'),(292,1,'update_invoice','invoice',28,'فاکتور #28','109.125.167.41','2026-08-26 17:41:58'),(293,1,'create_case_designer','case_designer',1068,'تغییر طراح کیس #1068','109.125.167.41','2026-08-26 18:19:24'),(294,1,'create_case_designer','case_designer',1067,'تغییر طراح کیس #1067','109.125.167.41','2026-08-26 18:19:24'),(295,1,'create_price','price',18,'قیمت #18','109.125.167.41','2026-08-26 18:40:26'),(296,1,'create_price_override','price_override',10,'قیمت اختصاصی #10','109.125.167.41','2026-08-26 18:44:04'),(297,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.254.69','2026-08-26 19:18:04'),(298,1,'login','user',1,'ورود موفق به سیستم (admin)','5.115.245.14','2026-08-26 21:24:20'),(299,1,'update_user','user',13,'کاربر #13','109.125.166.120','2026-08-26 22:37:58'),(300,1,'delete_price_override','price_override',8,'حذف قیمت اختصاصی #8','109.125.166.120','2026-08-26 22:38:11'),(301,1,'delete_price_override','price_override',9,'حذف قیمت اختصاصی #9','109.125.166.120','2026-08-26 22:38:15'),(302,1,'update_user','user',23,'کاربر #23','109.125.166.120','2026-08-26 22:39:31'),(303,1,'update_user','user',11,'کاربر #11','109.125.166.120','2026-08-26 22:39:46'),(304,1,'update_user','user',23,'کاربر #23','109.125.166.120','2026-08-26 22:39:55'),(305,1,'update_invoice','invoice',29,'فاکتور #29','109.125.166.120','2026-08-26 22:45:03'),(306,1,'create_payment','payment',5,'پرداخت #5','109.125.166.120','2026-08-26 22:46:00'),(307,1,'create_expense_payment','expense_payment',1,'پرداخت هزینه #1','109.125.166.120','2026-08-26 22:47:43'),(308,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','37.129.109.17','2026-08-27 12:25:23'),(309,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','37.129.109.17','2026-08-27 12:29:22'),(310,26,'create_case_status','case_status',1150,'تغییر وضعیت کیس #1150','37.129.109.17','2026-08-27 12:29:52'),(311,26,'create_case_status','case_status',1151,'تغییر وضعیت کیس #1151','37.129.109.17','2026-08-27 12:30:58'),(312,1,'login','user',1,'ورود موفق به سیستم (admin)','5.115.207.182','2026-08-28 10:50:22'),(313,13,'login','user',13,'ورود موفق به سیستم (fatabjikhala)','5.115.207.182','2026-08-28 11:07:40'),(314,1,'login','user',1,'ورود موفق به سیستم (admin)','5.115.207.182','2026-08-28 11:08:25'),(315,1,'login','user',1,'ورود موفق به سیستم (admin)','5.116.21.98','2026-08-28 16:02:43'),(316,1,'login','user',1,'ورود موفق به سیستم (admin)','5.117.221.148','2026-08-29 10:50:56'),(317,13,'login','user',13,'ورود موفق به سیستم (fatabjikhala)','5.217.255.15','2026-08-29 12:40:51'),(318,1,'create_bank_account','bank_account',3,'حساب بانکی #3','109.125.167.220','2026-08-29 13:27:34'),(319,1,'create_expense_payment','expense_payment',2,'پرداخت هزینه #2','109.125.167.220','2026-08-29 13:28:47'),(320,1,'create_case_designer','case_designer',1151,'تغییر طراح کیس #1151','109.125.167.237','2026-08-29 15:34:26'),(321,1,'create_case_designer','case_designer',1150,'تغییر طراح کیس #1150','109.125.167.237','2026-08-29 15:34:26'),(322,1,'create_case_designer','case_designer',1149,'تغییر طراح کیس #1149','109.125.167.237','2026-08-29 15:34:26'),(323,1,'create_case_designer','case_designer',1146,'تغییر طراح کیس #1146','109.125.167.237','2026-08-29 15:34:26'),(324,1,'create_case_designer','case_designer',1145,'تغییر طراح کیس #1145','109.125.167.237','2026-08-29 15:34:26'),(325,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','5.126.13.36','2026-08-29 16:27:16'),(326,1,'create_payment','payment',6,'پرداخت #6','109.125.167.22','2026-08-29 16:50:34'),(327,1,'create_case_designer','case_designer',1151,'تغییر طراح کیس #1151','109.125.167.22','2026-08-29 17:53:01'),(328,1,'create_case_designer','case_designer',1150,'تغییر طراح کیس #1150','109.125.167.22','2026-08-29 17:53:01'),(329,1,'create_case_designer','case_designer',1149,'تغییر طراح کیس #1149','109.125.167.22','2026-08-29 17:53:01'),(330,1,'create_case_designer','case_designer',1146,'تغییر طراح کیس #1146','109.125.167.22','2026-08-29 17:53:01'),(331,1,'create_case_designer','case_designer',1145,'تغییر طراح کیس #1145','109.125.167.22','2026-08-29 17:53:01'),(332,1,'create_case_designer','case_designer',1151,'تغییر طراح کیس #1151','5.115.58.119','2026-08-30 11:36:44'),(333,1,'create_case_designer','case_designer',1150,'تغییر طراح کیس #1150','5.115.58.119','2026-08-30 11:36:44'),(334,1,'create_case_designer','case_designer',1149,'تغییر طراح کیس #1149','5.115.58.119','2026-08-30 11:36:44'),(335,1,'create_case_designer','case_designer',1146,'تغییر طراح کیس #1146','5.115.58.119','2026-08-30 11:36:44'),(336,1,'create_case_designer','case_designer',1145,'تغییر طراح کیس #1145','5.115.58.119','2026-08-30 11:36:44'),(337,1,'create_case_designer','case_designer',1151,'تغییر طراح کیس #1151','109.125.167.2','2026-08-31 13:33:46'),(338,1,'create_case_designer','case_designer',1150,'تغییر طراح کیس #1150','109.125.167.2','2026-08-31 13:33:46'),(339,1,'create_case_designer','case_designer',1149,'تغییر طراح کیس #1149','109.125.167.2','2026-08-31 13:33:46'),(340,1,'create_case_designer','case_designer',1146,'تغییر طراح کیس #1146','109.125.167.2','2026-08-31 13:33:46'),(341,1,'create_case_designer','case_designer',1145,'تغییر طراح کیس #1145','109.125.167.2','2026-08-31 13:33:46'),(342,24,'login','user',24,'ورود موفق به سیستم (DONYA)','5.208.238.53','2026-08-31 15:51:09'),(343,26,'create_case_status','case_status',1149,'تغییر وضعیت کیس #1149','83.122.222.73','2026-08-31 19:10:25'),(344,26,'create_case_status','case_status',1146,'تغییر وضعیت کیس #1146','83.122.222.73','2026-08-31 19:10:34'),(345,26,'create_case_status','case_status',1145,'تغییر وضعیت کیس #1145','83.122.222.73','2026-08-31 19:10:43'),(346,26,'create_case_status','case_status',1150,'تغییر وضعیت کیس #1150','83.122.222.73','2026-08-31 19:10:58'),(347,26,'create_case_status','case_status',1151,'تغییر وضعیت کیس #1151','83.122.222.73','2026-08-31 19:11:17'),(348,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','109.125.167.52','2026-08-31 19:13:30'),(349,26,'create_case_status','case_status',1068,'تغییر وضعیت کیس #1068','83.122.222.73','2026-08-31 19:15:20'),(350,26,'create_case_status','case_status',1067,'تغییر وضعیت کیس #1067','83.122.222.73','2026-08-31 19:15:38'),(351,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','109.125.167.52','2026-08-31 19:28:45'),(352,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.167.52','2026-08-31 19:28:55'),(353,1,'update_role','role',5,'نقش #5','109.125.167.52','2026-08-31 19:34:25'),(354,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','109.125.167.52','2026-08-31 19:34:34'),(355,1,'login','user',1,'ورود موفق به سیستم (admin)','109.125.167.52','2026-08-31 19:37:13'),(356,1,'update_role','role',5,'نقش #5','109.125.167.52','2026-08-31 19:39:02'),(357,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','5.115.82.203','2026-08-31 22:12:18'),(358,26,'login','user',26,'ورود موفق به سیستم (M.A.Yegane)','5.115.82.203','2026-09-01 00:14:25'),(359,1,'login','user',1,'ورود موفق به سیستم (admin)','::1','2026-09-01 01:34:01');
/*!40000 ALTER TABLE `audit_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `bank_accounts`
--

DROP TABLE IF EXISTS `bank_accounts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `bank_accounts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `account_owner_name` varchar(200) NOT NULL,
  `bank_name` varchar(200) NOT NULL,
  `account_number` varchar(50) NOT NULL,
  `iban_sheba` varchar(50) DEFAULT NULL,
  `is_active` tinyint(1) DEFAULT 1,
  `notes` text DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `card_number` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `bank_accounts`
--

LOCK TABLES `bank_accounts` WRITE;
/*!40000 ALTER TABLE `bank_accounts` DISABLE KEYS */;
INSERT INTO `bank_accounts` VALUES (1,1,'مهدی داداش زاده','ملت','9353469403','020120000000009353469403',1,NULL,'2026-06-07 14:41:41','2026-08-23 13:15:36','6104338755376486'),(2,1,'مهدی داداش زاده','ملی','0312698948003','390170000000312698948003',1,NULL,'2026-07-08 23:54:26','2026-08-23 13:15:36','6037991943980957'),(3,1,'محمدعلی یگانه','پاسارگاد','1009115156895641','290570100911515689564001',1,NULL,'2026-08-29 13:27:34','2026-08-29 13:27:34','5022291317205829');
/*!40000 ALTER TABLE `bank_accounts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branch_doctor_access`
--

DROP TABLE IF EXISTS `branch_doctor_access`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branch_doctor_access` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) NOT NULL,
  `doctor_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `branch_id` (`branch_id`,`doctor_id`),
  KEY `doctor_id` (`doctor_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branch_doctor_access`
--

LOCK TABLES `branch_doctor_access` WRITE;
/*!40000 ALTER TABLE `branch_doctor_access` DISABLE KEYS */;
/*!40000 ALTER TABLE `branch_doctor_access` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branch_receivable_items`
--

DROP TABLE IF EXISTS `branch_receivable_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branch_receivable_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `receivable_id` int(11) NOT NULL,
  `case_id` int(11) DEFAULT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `doctor_name` varchar(191) DEFAULT NULL,
  `service_id` int(11) DEFAULT NULL,
  `service_title` varchar(191) DEFAULT NULL,
  `patient_name` varchar(191) DEFAULT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `unit_rate` decimal(14,2) NOT NULL DEFAULT 0.00,
  `total_amount` decimal(14,2) NOT NULL DEFAULT 0.00,
  `received_date` date DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branch_receivable_items`
--

LOCK TABLES `branch_receivable_items` WRITE;
/*!40000 ALTER TABLE `branch_receivable_items` DISABLE KEYS */;
/*!40000 ALTER TABLE `branch_receivable_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branch_receivable_payments`
--

DROP TABLE IF EXISTS `branch_receivable_payments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branch_receivable_payments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `receivable_id` int(11) NOT NULL,
  `amount` decimal(14,2) NOT NULL DEFAULT 0.00,
  `payment_date` date DEFAULT NULL,
  `method` varchar(50) DEFAULT NULL,
  `reference` varchar(191) DEFAULT NULL,
  `notes` varchar(191) DEFAULT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branch_receivable_payments`
--

LOCK TABLES `branch_receivable_payments` WRITE;
/*!40000 ALTER TABLE `branch_receivable_payments` DISABLE KEYS */;
/*!40000 ALTER TABLE `branch_receivable_payments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branch_receivables`
--

DROP TABLE IF EXISTS `branch_receivables`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branch_receivables` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `invoice_number` varchar(30) NOT NULL,
  `branch_id` int(11) DEFAULT NULL,
  `partner_branch_id` int(11) DEFAULT NULL,
  `total_amount` decimal(14,2) NOT NULL DEFAULT 0.00,
  `period_label` varchar(100) DEFAULT NULL,
  `invoice_date` date DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `payment_status` enum('unpaid','partial','paid') NOT NULL DEFAULT 'unpaid',
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `invoice_number` (`invoice_number`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1 COLLATE=latin1_swedish_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branch_receivables`
--

LOCK TABLES `branch_receivables` WRITE;
/*!40000 ALTER TABLE `branch_receivables` DISABLE KEYS */;
/*!40000 ALTER TABLE `branch_receivables` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branch_service_prices`
--

DROP TABLE IF EXISTS `branch_service_prices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branch_service_prices` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `custom_price` decimal(15,2) NOT NULL DEFAULT 0.00,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `branch_id` (`branch_id`,`service_id`),
  KEY `service_id` (`service_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branch_service_prices`
--

LOCK TABLES `branch_service_prices` WRITE;
/*!40000 ALTER TABLE `branch_service_prices` DISABLE KEYS */;
INSERT INTO `branch_service_prices` VALUES (1,1,1,2000000.00,'2026-08-31 22:13:13','2026-08-31 22:13:40');
/*!40000 ALTER TABLE `branch_service_prices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `branches`
--

DROP TABLE IF EXISTS `branches`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `branches` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `parent_id` int(11) DEFAULT NULL,
  `name` varchar(255) NOT NULL,
  `code` varchar(50) DEFAULT NULL,
  `owner_user_id` int(11) DEFAULT NULL,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `parent_id` (`parent_id`),
  KEY `owner_user_id` (`owner_user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `branches`
--

LOCK TABLES `branches` WRITE;
/*!40000 ALTER TABLE `branches` DISABLE KEYS */;
INSERT INTO `branches` VALUES (1,NULL,'شعبه اصلی (اسلامشهر)','MAIN',1,1,'2026-08-23 09:45:18','2026-08-23 09:45:18'),(2,1,'قزوین','QAZVIN',13,1,'2026-08-26 19:07:38','2026-08-26 19:07:38');
/*!40000 ALTER TABLE `branches` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `case_activity_log`
--

DROP TABLE IF EXISTS `case_activity_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `case_activity_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `case_id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `action` varchar(40) NOT NULL,
  `details` text DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `idx_cal_case_time` (`case_id`,`created_at`),
  KEY `idx_cal_action` (`action`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `case_activity_log`
--

LOCK TABLES `case_activity_log` WRITE;
/*!40000 ALTER TABLE `case_activity_log` DISABLE KEYS */;
INSERT INTO `case_activity_log` VALUES (1,1143,1,'view','مشاهده صفحه کیس','::1','2026-08-31 21:54:19');
/*!40000 ALTER TABLE `case_activity_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `case_files`
--

DROP TABLE IF EXISTS `case_files`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `case_files` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `case_id` int(11) NOT NULL,
  `filename` varchar(255) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `file_type` varchar(30) DEFAULT NULL,
  `mime` varchar(100) DEFAULT NULL,
  `size` int(11) DEFAULT NULL,
  `uploader_id` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `case_id` (`case_id`),
  CONSTRAINT `fk_case_files_case` FOREIGN KEY (`case_id`) REFERENCES `cases` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=213 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `case_files`
--

LOCK TABLES `case_files` WRITE;
/*!40000 ALTER TABLE `case_files` DISABLE KEYS */;
INSERT INTO `case_files` VALUES (4,1022,'1a67f10ba7f3880e.stl','2026-06-29_00003-003_MultiLater A3_خانوم شکوری_----12-crown_cad.stl',NULL,NULL,'application/octet-stream',1082484,NULL,'2026-07-08 18:26:38'),(5,1022,'c8789d22078b2ac5.stl','2026-06-29_00003-003_MultiLater A3_خانوم شکوری_----13-crown_cad.stl',NULL,NULL,'application/octet-stream',1359784,NULL,'2026-07-08 18:26:38'),(6,1021,'fb716bea39841dbb.stl','2026-06-28_00003-001_MultiLayer A3_خانوم محمودی_----45-crown_cad.stl',NULL,NULL,'application/octet-stream',1411084,NULL,'2026-07-08 18:28:17'),(7,1023,'4ee10b1be145ae87.stl','2026-06-29_00003-004_MultiLayer A1_خانوم حیدری_----13-12-11-21-bridge_slm_cad.stl',NULL,NULL,'application/octet-stream',4711684,NULL,'2026-07-08 18:28:40'),(8,1023,'e639a62974bfc098.ply','260629002-upperjaw-beforerepair.ply',NULL,NULL,'application/octet-stream',315641,NULL,'2026-07-08 18:28:40'),(14,1032,'4e8352455fb4a00b.ply','260713001-biteregister.ply',NULL,NULL,'application/octet-stream',2805491,NULL,'2026-07-13 12:45:15'),(15,1032,'36b2c8cd7e8e64a2.ply','260713001-lowerjaw.ply',NULL,NULL,'application/octet-stream',6006279,NULL,'2026-07-13 12:45:15'),(16,1032,'72ecf5ad7d40b0b4.ply','260713001-upperjaw.ply',NULL,NULL,'application/octet-stream',8865496,NULL,'2026-07-13 12:45:15'),(17,1032,'36f3ea526cc35f40.png','case.png',NULL,NULL,'image/png',230124,NULL,'2026-07-13 12:45:15'),(18,1030,'89641afedd45033e.ply','260713005-biteregister.ply',NULL,NULL,'application/octet-stream',4064278,NULL,'2026-07-13 14:17:00'),(19,1030,'5bd0bfd6faf9146b.ply','260713005-lowerjaw.ply',NULL,NULL,'application/octet-stream',7274263,NULL,'2026-07-13 14:17:00'),(20,1030,'0500ae18e791e1ef.ply','260713005-upperjaw.ply',NULL,NULL,'application/octet-stream',6039601,NULL,'2026-07-13 14:17:00'),(21,1030,'9e58c840b79b4327.png','case.png',NULL,NULL,'image/png',228295,NULL,'2026-07-13 14:17:00'),(22,1034,'7c656df44b765006.png','2026-07-14_00002-001_MultiLayer A3_حمید حسین پور_----preview.png',NULL,NULL,'image/png',162883,NULL,'2026-07-14 12:10:50'),(23,1034,'ad6ed1d521f80ba8.ply','260713004-biteregister.ply',NULL,NULL,'application/octet-stream',1205645,NULL,'2026-07-14 12:10:50'),(24,1034,'30ef6ca129d40186.ply','260713004-lowerjaw.ply',NULL,NULL,'application/octet-stream',1530292,NULL,'2026-07-14 12:10:50'),(25,1034,'47860f9cdfe6edfc.ply','260713004-upperjaw.ply',NULL,NULL,'application/octet-stream',5826778,NULL,'2026-07-14 12:10:50'),(26,1034,'7b225c4a315b0dcf.stl','2026-07-14_00002-001_MultiLayer A3_حمید حسین پور_----26-crown_cad.stl',NULL,NULL,'application/octet-stream',3028084,NULL,'2026-07-14 12:36:54'),(27,1042,'c6f9178d090d97e1.stl','2026-06-21_00005-001_پروین کشاورز_MultiLayer A1_----15-14-bridge_slm_cad.stl',NULL,NULL,'application/octet-stream',2466084,NULL,'2026-07-15 12:57:41'),(28,1050,'1a077fdef1070d8f.rar','Proj-Rest_2026-07-18_165439-hajarfarajolahi-zahrahoseni-1.rar',NULL,NULL,'application/x-compressed',32745109,NULL,'2026-07-21 10:33:25'),(29,1056,'fe0efa555c5b4e9d.stl','2026-07-15_00005-005_MultiLayer A2_مینا بابایی_----37-crown_cad.stl',NULL,NULL,'application/octet-stream',2590584,NULL,'2026-07-22 14:03:45'),(57,1085,'98fbc3dfadcc1c96.rar','1085-3.rar',NULL,NULL,'application/x-compressed',25418054,NULL,'2026-08-09 18:33:51'),(74,1088,'689fabdeac64f250.ply','260807005-biteregister0.ply',NULL,NULL,'application/octet-stream',2308391,NULL,'2026-08-10 13:10:49'),(75,1088,'68109d7551aa2397.ply','260807005-biteregister1.ply',NULL,NULL,'application/octet-stream',2080781,NULL,'2026-08-10 13:10:49'),(76,1088,'80492333b589eb66.ply','260807005-lowerjaw.ply',NULL,NULL,'application/octet-stream',8970341,NULL,'2026-08-10 13:10:49'),(77,1088,'d75c20c385acbd03.ply','260807005-upperjaw.ply',NULL,NULL,'application/octet-stream',9499847,NULL,'2026-08-10 13:10:49'),(78,1088,'b05f62c9048b20b0.png','case.png',NULL,NULL,'image/png',227751,NULL,'2026-08-10 13:10:49'),(79,1088,'ca62a8de218aeb92.png','data.png',NULL,NULL,'image/png',864036,NULL,'2026-08-10 13:10:49'),(80,1060,'8a51578657d10ef4.rar','1060 baghbani.rar',NULL,NULL,'application/x-compressed',1001106,NULL,'2026-08-10 13:15:55'),(81,1101,'0746fadb6f1cd88c.ply','260805001-biteregister.ply',NULL,NULL,'application/octet-stream',2048710,NULL,'2026-08-10 13:29:52'),(82,1101,'5ddd574bda3ea7cc.ply','260805001-lowerjaw.ply',NULL,NULL,'application/octet-stream',5014861,NULL,'2026-08-10 13:29:52'),(83,1101,'13e7304df4025c04.ply','260805001-upperjaw.ply',NULL,NULL,'application/octet-stream',6520829,NULL,'2026-08-10 13:29:52'),(84,1101,'bb5a329f55f8e48f.png','case.png',NULL,NULL,'image/png',226095,NULL,'2026-08-10 13:29:52'),(85,1101,'bcd9e1b3c1f429c4.png','data.png',NULL,NULL,'image/png',588028,NULL,'2026-08-10 13:29:52'),(91,1060,'32a18ea5dad8fc1c.png','baqbani_proximal.png',NULL,NULL,'image/png',1111052,NULL,'2026-08-10 13:55:08'),(92,1108,'case_1108_1786370552.zip','case_1108.zip',NULL,NULL,'application/zip',11378208,NULL,'2026-08-10 14:02:41'),(93,1107,'case_1107_1786370692.zip','case_1107.zip',NULL,NULL,'application/zip',9426284,NULL,'2026-08-10 14:04:58'),(94,1106,'case_1106_1786370760.zip','case_1106.zip',NULL,NULL,'application/zip',10639801,NULL,'2026-08-10 14:06:07'),(95,1060,'case_1060_1786370997.zip','case_1060.zip',NULL,NULL,'application/zip',9636965,NULL,'2026-08-10 14:10:05'),(96,1078,'case_1078_1786371106.zip','case_1078.zip',NULL,NULL,'application/zip',11938619,NULL,'2026-08-10 14:11:54'),(97,1085,'case_1085_1786371263.zip','case_1085.zip',NULL,NULL,'application/zip',9745591,NULL,'2026-08-10 14:14:31'),(98,1098,'case_1098_1786371375.zip','case_1098.zip',NULL,NULL,'application/zip',12382742,NULL,'2026-08-10 14:16:24'),(99,1109,'case_1109_1786374735.zip','case_1109.zip',NULL,NULL,'application/zip',33938210,NULL,'2026-08-10 15:12:24'),(100,1110,'case_1110_1786377416.zip','case_1110.zip',NULL,NULL,'application/zip',36927180,NULL,'2026-08-10 15:57:06'),(101,1099,'case_1099_1786377641.zip','case_1099.zip',NULL,NULL,'application/zip',9200583,NULL,'2026-08-10 16:00:47'),(102,1111,'case_1111_1786399895.zip','case_1111.zip',NULL,NULL,'application/zip',6799368,NULL,'2026-08-10 22:11:39'),(103,1102,'case_1102_1786400129.zip','case_1102.zip',NULL,NULL,'application/zip',10353924,NULL,'2026-08-10 22:15:37'),(104,1097,'case_1097_1786400399.zip','case_1097.zip',NULL,NULL,'application/zip',12604642,NULL,'2026-08-10 22:20:09'),(105,1111,'1dabb069b3796993.rar','case 1111.rar',NULL,NULL,'application/x-compressed',7367671,NULL,'2026-08-13 16:30:22'),(106,1107,'3c0bb9e40481c2a6.rar','mahnaz babaha C2.rar',NULL,NULL,'application/x-compressed',579006,NULL,'2026-08-14 09:25:05'),(107,1108,'a128aceda1259c39.rar','taghi rostami A3.rar',NULL,NULL,'application/x-compressed',963997,NULL,'2026-08-14 09:42:14'),(108,1110,'f76fd53224af0e36.rar','shahnaz ebadian BL2.rar',NULL,NULL,'application/x-compressed',1311380,NULL,'2026-08-14 09:52:41'),(109,1112,'case_1112_1786701773.zip','case_1112.zip',NULL,NULL,'application/zip',34794943,NULL,'2026-08-14 10:03:01'),(110,1106,'339cb4ab8238b6f6.rar','agayi A3.rar',NULL,NULL,'application/x-compressed',847497,NULL,'2026-08-14 10:06:39'),(111,1097,'f94329fa141da40b.rar','latifi A3.rar',NULL,NULL,'application/x-compressed',1175915,NULL,'2026-08-14 10:33:02'),(112,1098,'5eb4e4baad44b7f7.rar','dadash zadeh A3.rar',NULL,NULL,'application/x-compressed',1928208,NULL,'2026-08-14 10:50:23'),(114,1110,'4662efa52aecf863.ply','2026-08-10_100_421-LowerJaw.ply',NULL,NULL,'application/octet-stream',9538405,NULL,'2026-08-14 11:11:36'),(115,1110,'3ee04a1281988b33.stl','shahnaz abedian Cast.stl',NULL,NULL,'application/octet-stream',9967184,NULL,'2026-08-14 11:50:28'),(117,1116,'case_1116_1786782756.zip','case_1116.zip',NULL,NULL,'application/zip',8254105,NULL,'2026-08-15 08:32:43'),(118,1117,'case_1117_1786783467.zip','case_1117.zip',NULL,NULL,'application/zip',8981777,NULL,'2026-08-15 08:44:35'),(120,1114,'case_1114_1786790787.zip','case_1114.zip',NULL,NULL,'application/zip',13430267,NULL,'2026-08-15 10:46:43'),(121,1123,'case_1123_1786792493.zip','case_1123.zip',NULL,NULL,'application/zip',10881108,NULL,'2026-08-15 11:15:01'),(122,1115,'case_1115_1786792693.zip','case_1115.zip',NULL,NULL,'application/zip',9922975,NULL,'2026-08-15 11:18:20'),(123,1090,'case_1090_1786792997.zip','case_1090.zip',NULL,NULL,'application/zip',11779340,NULL,'2026-08-15 11:23:26'),(125,1124,'case_1124_1786805328.zip','case_1124.zip',NULL,NULL,'application/zip',46082762,NULL,'2026-08-15 14:48:59'),(128,1126,'case_1126_1786873071.zip','case_1126.zip',NULL,NULL,'application/zip',8740547,NULL,'2026-08-16 09:37:57'),(129,1127,'case_1127_1786894644.zip','case_1127.zip',NULL,NULL,'application/zip',7115510,NULL,'2026-08-16 15:37:30'),(130,1128,'case_1128_1786895040.zip','case_1128.zip',NULL,NULL,'application/zip',11897846,NULL,'2026-08-16 15:44:07'),(131,1123,'fa8b7e3f495361f3.zip','case_1123_intraoral.zip',NULL,NULL,'application/x-zip-compressed',11616439,NULL,'2026-08-17 08:44:18'),(132,1099,'9ddf326a69793e77.rar','MohammadZade.rar',NULL,NULL,'application/octet-stream',21548390,NULL,'2026-08-17 08:50:16'),(133,1125,'case_1125_1786956932.zip','case_1125.zip',NULL,NULL,'application/zip',12371409,NULL,'2026-08-17 08:55:41'),(134,1129,'case_1129_1786971006.zip','case_1129.zip',NULL,NULL,'application/zip',7780965,NULL,'2026-08-17 12:50:11'),(135,1130,'case_1130_1786975289.zip','case_1130.zip',NULL,NULL,'application/zip',7788638,NULL,'2026-08-17 14:01:34'),(136,1131,'case_1131_1787050492.zip','case_1131.zip',NULL,NULL,'application/zip',9727248,NULL,'2026-08-18 10:54:57'),(137,1123,'15e8b2056c1b499e.rar','1123 - Maryam FeyziZade - BL2  - 13-12.22-23.rar',NULL,NULL,'application/x-compressed',3609803,NULL,'2026-08-18 15:54:38'),(138,1123,'b6afaff10a53875b.rar','1123 - Maryam FeyziZade - BL2  - 13-12.22-23.rar',NULL,NULL,'application/x-compressed',7108089,NULL,'2026-08-18 15:55:04'),(139,1131,'7eb2f2ece71c8594.jpeg','IMG_3001.jpeg',NULL,NULL,'image/jpeg',3337566,NULL,'2026-08-19 12:30:05'),(140,1131,'0221f4ff2848489e.jpeg','IMG_2999.jpeg',NULL,NULL,'image/jpeg',3430946,NULL,'2026-08-19 12:30:05'),(146,1132,'1132_hasan touheyd naya_A3_13_14_15_16.zip','1132_hasan touheyd naya_A3_13_14_15_16.zip',NULL,NULL,'application/zip',8741864,NULL,'2026-08-19 13:04:02'),(147,1090,'55614d76fb26fba0.rar','1090 - Fathi - A3 - 34.rar',NULL,NULL,'application/x-compressed',2268611,NULL,'2026-08-19 21:27:22'),(148,1131,'4a75125db68212fe.jpeg','IMG_2994.jpeg',NULL,NULL,'image/jpeg',3318077,NULL,'2026-08-19 21:38:09'),(149,1131,'ec6b2cba2a43eb50.jpeg','IMG_2993.jpeg',NULL,NULL,'image/jpeg',3665560,NULL,'2026-08-19 21:38:09'),(150,1131,'0e8a68d19e1b5de2.jpeg','IMG_2997.jpeg',NULL,NULL,'image/jpeg',3394090,NULL,'2026-08-19 21:38:09'),(151,1131,'3dd4cd1856022450.jpeg','IMG_2998.jpeg',NULL,NULL,'image/jpeg',3500536,NULL,'2026-08-19 21:38:09'),(152,1131,'f7d8c056d218641b.jpeg','IMG_2995.jpeg',NULL,NULL,'image/jpeg',3007193,NULL,'2026-08-19 21:38:09'),(153,1131,'1b76a30ecb48c355.jpeg','IMG_2996.jpeg',NULL,NULL,'image/jpeg',3340162,NULL,'2026-08-19 21:38:09'),(154,1114,'99025de29c9f7491.rar','1114 - Hossein Mazi - A3 - 37-36.16.rar',NULL,NULL,'application/x-compressed',5327390,NULL,'2026-08-19 22:11:51'),(155,1115,'28035f8321d1a3b8.rar','1115 - Amin Babaii - A3 - 35.rar',NULL,NULL,'application/x-compressed',2191619,NULL,'2026-08-20 04:45:13'),(156,1126,'01e93a26e5646d93.rar','1126 - Nilifar Zamani - A3 - 46.rar',NULL,NULL,'application/x-compressed',2446305,NULL,'2026-08-20 05:07:43'),(157,1124,'57cf58ca7d50aefd.rar','1124 - Habibe Panahi - A2 - 33-32-31.rar',NULL,NULL,'application/x-compressed',3300477,NULL,'2026-08-20 07:41:49'),(158,1128,'f6e03c37170a6ecb.rar','1128 - Emad Moazami - A2 - 11_12_21_22.rar',NULL,NULL,'application/x-compressed',4022878,NULL,'2026-08-20 11:59:03'),(159,1133,'1133_khanoum beygadali_A3_44_45_46.zip','1133_khanoum beygadali_A3_44_45_46.zip',NULL,NULL,'application/zip',10783830,NULL,'2026-08-22 08:30:25'),(160,1134,'1134_aghai peyran_A3_13،27.zip','1134_aghai peyran_A3_13،27.zip',NULL,NULL,'application/zip',12260971,NULL,'2026-08-22 08:32:48'),(161,1135,'1135_khanoum lateyfi_A3_15_16_17.zip','1135_khanoum lateyfi_A3_15_16_17.zip',NULL,NULL,'application/zip',12446063,NULL,'2026-08-22 08:40:04'),(162,1136,'1136_khanoum mahamadi_BL2_15.zip','1136_khanoum mahamadi_BL2_15.zip',NULL,NULL,'application/zip',11470076,NULL,'2026-08-22 08:42:04'),(163,1137,'1137_aghai geylani_A3_42_43_44_45.zip','1137_aghai geylani_A3_42_43_44_45.zip',NULL,NULL,'application/zip',9350984,NULL,'2026-08-22 08:46:08'),(164,1145,'1145_sameyh razi_BL3_16،25_26_27.zip','1145_sameyh razi_BL3_16،25_26_27.zip',NULL,NULL,'application/zip',23359057,NULL,'2026-08-22 13:30:46'),(165,1146,'1146_aley aghayi_BL3_25،45_46.zip','1146_aley aghayi_BL3_25،45_46.zip',NULL,NULL,'application/zip',22138147,NULL,'2026-08-22 13:47:52'),(167,1143,'1143_seyd valeyh_B1_11_12،21_22،13_14.zip','1143_seyd valeyh_B1_11_12،21_22،13_14.zip',NULL,NULL,'application/zip',12373459,NULL,'2026-08-22 14:02:09'),(168,1144,'1144_paravanah kashaouraz_BL3_46_47.zip','1144_paravanah kashaouraz_BL3_46_47.zip',NULL,NULL,'application/zip',9455653,NULL,'2026-08-22 14:21:27'),(169,1141,'1141_akaram ghadeyri_BL2_15.zip','1141_akaram ghadeyri_BL2_15.zip',NULL,NULL,'application/zip',11811726,NULL,'2026-08-22 14:21:36'),(170,1142,'1142_faheymah karami_A2_35.zip','1142_faheymah karami_A2_35.zip',NULL,NULL,'application/zip',11693289,NULL,'2026-08-22 14:21:45'),(171,1140,'1140_hameyd tahanayan_A3_46.zip','1140_hameyd tahanayan_A3_46.zip',NULL,NULL,'application/zip',8940230,NULL,'2026-08-22 14:23:24'),(172,1141,'5131f4bc75f85a5e.rar','1141_akaram ghadeyri_BL2_15-14.rar',NULL,NULL,'application/x-compressed',3324447,NULL,'2026-08-22 15:20:19'),(173,1144,'715a22601ec0621e.rar','1144_paravanah kashaouraz_BL3_46_47.rar',NULL,NULL,'application/x-compressed',3337108,NULL,'2026-08-22 15:41:59'),(174,1068,'1068_faئzah maghasoudi_A2_16.zip','1068_faئzah maghasoudi_A2_16.zip',NULL,NULL,'application/zip',40767499,NULL,'2026-08-23 09:43:02'),(175,1147,'1147_zahara aeyn alalah zadah_A3_25.zip','1147_zahara aeyn alalah zadah_A3_25.zip',NULL,NULL,'application/zip',7857247,NULL,'2026-08-23 13:32:34'),(176,1131,'52b21e3a8f968a66.rar','1131 - Maleki - BL2 -  11،12،13،14،15،21،22،23،24،25،34،33،32،31،41،42،43،44.rar',NULL,NULL,'application/x-compressed',32884474,NULL,'2026-08-23 15:37:40'),(177,1132,'9737a99895588d9f.rar','1132_hasan touheyd naya_A3_13_14_15_16.rar',NULL,NULL,'application/x-compressed',4662110,NULL,'2026-08-23 15:56:13'),(178,1129,'c2eaffc6a4d860e9.rar','1129 - Hanie KhalilNasab - A3 - 24.rar',NULL,NULL,'application/x-compressed',2313220,NULL,'2026-08-24 07:33:14'),(179,1130,'d6625c21b313ff77.rar','1130 - Shahnaz Heydari - A3 - 16.rar',NULL,NULL,'application/x-compressed',2595466,NULL,'2026-08-24 07:42:50'),(180,1140,'a358d4101bb5cacd.rar','1140_hameyd tahanayan_A3_46.rar',NULL,NULL,'application/x-compressed',2610579,NULL,'2026-08-24 07:51:29'),(181,1142,'9b186d6df030336e.rar','1142_faheymah karami_A2_35.rar',NULL,NULL,'application/x-compressed',2466813,NULL,'2026-08-24 08:05:14'),(187,1149,'1149_aghai shaharayar_A3_46_47.zip','1149_aghai shaharayar_A3_46_47.zip',NULL,NULL,'application/zip',11781334,NULL,'2026-08-24 15:42:54'),(188,1148,'1148_marazeyh nouralalahi_A3_25.zip','1148_marazeyh nouralalahi_A3_25.zip',NULL,NULL,'application/zip',7219808,NULL,'2026-08-24 15:46:00'),(189,1151,'1151_khanoum daleymi_BL2_15.zip','1151_khanoum daleymi_BL2_15.zip',NULL,NULL,'application/zip',11417026,NULL,'2026-08-24 15:55:22'),(190,1133,'0f3a3387f522d71b.rar','1133_khanoum beygadali_A3_44_45_46.rar',NULL,NULL,'application/x-compressed',4084788,NULL,'2026-08-25 10:28:15'),(191,1134,'402316608f7baae0.rar','1134_aghai peyran_A3_13،27.rar',NULL,NULL,'application/x-compressed',3963596,NULL,'2026-08-25 10:29:29'),(192,1136,'80f1a292583bbcf3.rar','1136_khanoum mahamadi_BL2_15.rar',NULL,NULL,'application/x-compressed',2243716,NULL,'2026-08-25 10:30:25'),(193,1135,'bc9e1df85acbe450.rar','1135_khanoum lateyfi_A3_15_16_17.rar',NULL,NULL,'application/x-compressed',3820941,NULL,'2026-08-25 10:33:25'),(195,1143,'817f84c58c64a2dd.rar','1143_seyd valeyh_B1_11_12،21_22،13_14.rar',NULL,NULL,'application/x-compressed',6474002,NULL,'2026-08-25 19:39:05'),(196,1147,'f41ffdf06a3dcb0c.rar','1147_zahara aeyn alalah zadah_A3_25.rar',NULL,NULL,'application/x-compressed',2150682,NULL,'2026-08-25 20:19:19'),(197,1102,'62f260bada877f75.rar','1102 - Morteza KhodaBakhshi - A1-A2 - 21-12.rar',NULL,NULL,'application/x-compressed',3234351,NULL,'2026-08-26 09:20:05'),(198,1137,'545ac72527adaecf.rar','1137_aghai geylani_A3_42_43_44_45.rar',NULL,NULL,'application/x-compressed',4912466,NULL,'2026-08-26 15:52:28'),(199,1067,'1067_zahara khanaki_A3_13،23.zip','1067_zahara khanaki_A3_13،23.zip',NULL,NULL,'application/zip',39539013,NULL,'2026-08-26 15:55:11'),(200,1137,'b0804306ffb195ff.rar','1137_aghai geylani_A3_26.rar',NULL,NULL,'application/x-compressed',3252732,NULL,'2026-08-26 16:22:06'),(201,1158,'1158_leyley kazami_B1_13_14_15_16_17,23_24_25_26.zip','1158_leyley kazami_B1_13_14_15_16_17,23_24_25_26.zip',NULL,NULL,'application/zip',15434681,NULL,'2026-08-26 17:55:30'),(202,1158,'1158_leyley kazami_B1_13_14_15_16_17,23_24_25_26_20260826.zip','1158_leyley kazami_B1_13_14_15_16_17,23_24_25_26_20260826.zip','علاوه بر اسکن داخل دهانی ، از قالب هم اسکن تهیه شد چون پزشک نخ زیرلثه نبسته بود \r\nسانترال ها و لترال ها فقط فریم ساخته میشه و قراره بصورت دستی پودر گذاری لب شیشه ای انجام بشه. \r\nکیس 1160 برای لترال ها در نظر گرفته شده است.',NULL,'application/zip',14645309,NULL,'2026-08-26 18:37:05'),(203,1157,'1157_haseyn valadakhani_A2_12.zip','1157_haseyn valadakhani_A2_12.zip',NULL,NULL,'application/zip',10919306,NULL,'2026-08-28 07:24:58'),(204,1164,'1164_lya kanakavi_A2_16.zip','1164_lya kanakavi_A2_16.zip',NULL,NULL,'application/zip',10701370,NULL,'2026-08-29 10:11:16'),(205,1165,'1165_mareym kanakavi_A2_15,46.zip','1165_mareym kanakavi_A2_15,46.zip',NULL,NULL,'application/zip',10890375,NULL,'2026-08-29 10:24:34'),(206,1166,'1166_aghai sakhaout_A2_37.zip','1166_aghai sakhaout_A2_37.zip',NULL,NULL,'application/zip',9908471,NULL,'2026-08-29 10:34:09'),(207,1152,'1152_zahara afakarayan_14،24_25_26،45.zip','1152_zahara afakarayan_14،24_25_26،45.zip',NULL,NULL,'application/zip',11487064,NULL,'2026-08-29 10:48:26'),(208,1162,'1162_khanoum seyfi_A3_35.zip','1162_khanoum seyfi_A3_35.zip',NULL,NULL,'application/zip',9537540,NULL,'2026-08-29 14:48:35'),(209,1161,'1161_farashatah daravishi_D2_33.zip','1161_farashatah daravishi_D2_33.zip',NULL,NULL,'application/zip',12520536,NULL,'2026-08-29 14:50:49'),(210,1159,'1159_aleyraza atasheyn_BL3_13_14_15.zip','1159_aleyraza atasheyn_BL3_13_14_15.zip',NULL,NULL,'application/zip',13375309,NULL,'2026-08-29 14:54:44'),(211,1167,'1167_mareym lajali_A3_36.zip','1167_mareym lajali_A3_36.zip',NULL,NULL,'application/zip',12117549,NULL,'2026-08-31 12:37:06'),(212,1168,'1168_yghoub tashakari_A3_25.zip','1168_yghoub tashakari_A3_25.zip',NULL,NULL,'application/zip',8096591,NULL,'2026-08-31 13:08:28');
/*!40000 ALTER TABLE `case_files` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `case_status_history`
--

DROP TABLE IF EXISTS `case_status_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `case_status_history` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `case_id` int(11) NOT NULL,
  `status_id` int(11) NOT NULL,
  `changed_by_admin_id` int(11) DEFAULT NULL,
  `changed_at` datetime NOT NULL DEFAULT current_timestamp(),
  `notes` text DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_case_status_history_case_id` (`case_id`),
  KEY `idx_case_status_history_status_id` (`status_id`),
  KEY `idx_case_status_history_changed_at` (`changed_at`),
  CONSTRAINT `fk_case_status_history_case` FOREIGN KEY (`case_id`) REFERENCES `cases` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk_case_status_history_status` FOREIGN KEY (`status_id`) REFERENCES `case_statuses` (`id`) ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `case_status_history`
--

LOCK TABLES `case_status_history` WRITE;
/*!40000 ALTER TABLE `case_status_history` DISABLE KEYS */;
/*!40000 ALTER TABLE `case_status_history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `case_statuses`
--

DROP TABLE IF EXISTS `case_statuses`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `case_statuses` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_case_statuses_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `case_statuses`
--

LOCK TABLES `case_statuses` WRITE;
/*!40000 ALTER TABLE `case_statuses` DISABLE KEYS */;
INSERT INTO `case_statuses` VALUES (1,'ثبت شد','2026-06-30 18:52:23'),(2,'در حال انجام','2026-06-30 18:52:23'),(3,'آماده تحویل','2026-06-30 18:52:23'),(4,'تحویل شد','2026-06-30 18:52:23'),(5,'لغو شد','2026-06-30 18:52:23'),(7,'ارسال به میلینگ','2026-07-15 09:49:45'),(8,'گچ ریزی شد','2026-07-26 01:01:33'),(9,'در حال طراحی','2026-07-26 01:01:33'),(10,'طراحی شده','2026-07-26 01:01:57'),(11,'میلینگ شده','2026-07-26 01:01:57'),(12,'ارسال شده به زینتر','2026-07-26 01:02:27'),(13,'زینتر شده','2026-07-26 01:02:27'),(14,'ارسال به گلیز','2026-07-26 01:02:43'),(15,'گلیز شده','2026-07-26 01:02:43'),(16,'ارسال به کنترل کیفی','2026-07-26 01:03:03'),(17,'کنترل کیفی شده','2026-07-26 01:03:03'),(18,'ارسال به لاب همکار','2026-08-04 23:57:02'),(19,'اسکن شد','2026-08-08 17:45:23'),(20,'برای کنترل طراحی به پزشک ارسال شد','2026-08-09 15:55:24'),(21,'برای کنترل طراحی به مدیر ارسال شد','2026-08-09 15:55:24'),(22,'تکرار','2026-08-23 13:17:13');
/*!40000 ALTER TABLE `case_statuses` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cases`
--

DROP TABLE IF EXISTS `cases`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `cases` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) NOT NULL DEFAULT 1,
  `source_branch_id` int(11) DEFAULT NULL,
  `parent_id` int(11) DEFAULT NULL,
  `doctor_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `patient_name` varchar(255) DEFAULT NULL,
  `receipt_number` varchar(20) DEFAULT NULL,
  `location_type` enum('teeth','upper','lower','both') DEFAULT NULL,
  `teeth` varchar(100) DEFAULT NULL,
  `shade` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `unit_price` decimal(15,2) DEFAULT NULL,
  `total_price` decimal(15,2) DEFAULT NULL,
  `design_fee` decimal(15,2) NOT NULL DEFAULT 0.00,
  `received_date` date DEFAULT NULL,
  `invoice_id` int(11) DEFAULT NULL,
  `designer_invoice_id` int(11) DEFAULT NULL,
  `outsource_invoice_id` int(11) DEFAULT NULL,
  `receivable_invoice_id` int(11) DEFAULT NULL,
  `lab_id` int(11) DEFAULT NULL,
  `outsourced_lab_id` int(11) DEFAULT NULL,
  `outsourced_service_id` int(11) DEFAULT NULL,
  `outsourced_qty` int(11) NOT NULL DEFAULT 0,
  `outsourced_rate` decimal(15,2) DEFAULT NULL,
  `case_type` enum('doctor','lab_in','lab_out') NOT NULL DEFAULT 'doctor',
  `designer_id` int(11) DEFAULT NULL,
  `status_id` int(11) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `label_printed_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_cases_doctor_id` (`doctor_id`),
  KEY `idx_cases_service_id` (`service_id`),
  KEY `idx_cases_invoice_id` (`invoice_id`),
  KEY `idx_cases_status_id` (`status_id`),
  KEY `idx_cases_received_date` (`received_date`),
  KEY `idx_cases_lab` (`lab_id`),
  KEY `idx_cases_parent_id` (`parent_id`),
  KEY `idx_cases_designer_id` (`designer_id`),
  KEY `idx_cases_receipt_number` (`receipt_number`),
  KEY `idx_cases_case_type` (`case_type`),
  CONSTRAINT `fk_cases_designer` FOREIGN KEY (`designer_id`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `fk_cases_doctor` FOREIGN KEY (`doctor_id`) REFERENCES `users` (`id`) ON UPDATE CASCADE,
  CONSTRAINT `fk_cases_parent` FOREIGN KEY (`parent_id`) REFERENCES `cases` (`id`) ON DELETE SET NULL ON UPDATE CASCADE,
  CONSTRAINT `fk_cases_service` FOREIGN KEY (`service_id`) REFERENCES `site_prices` (`id`) ON UPDATE CASCADE,
  CONSTRAINT `fk_cases_status` FOREIGN KEY (`status_id`) REFERENCES `case_statuses` (`id`) ON UPDATE CASCADE,
  CONSTRAINT `fk_cases_user` FOREIGN KEY (`doctor_id`) REFERENCES `users` (`id`) ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=1173 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cases`
--

LOCK TABLES `cases` WRITE;
/*!40000 ALTER TABLE `cases` DISABLE KEYS */;
INSERT INTO `cases` VALUES (1021,1,NULL,NULL,3,1,'خانوم محمودی',NULL,'teeth','45','A3','',1,1900000.00,1900000.00,0.00,'2026-06-27',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-06 17:13:53','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1022,1,NULL,NULL,3,1,'خانوم شکوری',NULL,'teeth','12,13','َA3','',2,1900000.00,3800000.00,0.00,'2026-06-27',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-06 17:16:09','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1023,1,NULL,NULL,3,1,'خانوم حیدری',NULL,'teeth','11,12,13,21','َA1','',4,1900000.00,7600000.00,0.00,'2026-06-28',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-06 17:17:17','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1024,1,NULL,NULL,10,2,'خانوم خانلری',NULL,'teeth','24','A2_A3','',1,2300000.00,2300000.00,0.00,'2026-06-22',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-08 17:11:21','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1025,1,NULL,NULL,2,1,'حمید مهاجری',NULL,'teeth','12،44','A3','',2,960000.00,1920000.00,0.00,'2026-07-12',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-12 18:54:52','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1026,1,NULL,NULL,3,1,'خانوم نعمتنژاد',NULL,'teeth','26','A2','',1,1900000.00,1900000.00,0.00,'2026-07-11',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-12 18:55:55','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1027,1,NULL,NULL,3,1,'خانوم محمودی',NULL,'teeth','27','A3','',1,1900000.00,1900000.00,0.00,'2026-07-11',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-12 18:56:42','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1028,1,NULL,NULL,3,1,'خانوم بالادستیان',NULL,'teeth','47','A3','',1,1900000.00,1900000.00,0.00,'2026-07-11',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-12 18:57:27','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1029,1,NULL,NULL,3,1,'صفدر کاظمی',NULL,'teeth','21_11_12_13، 22_23_24_25','A1','',8,1900000.00,15200000.00,0.00,'2026-07-12',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-13 14:05:57','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1030,1,NULL,NULL,3,1,'آرزو قلیزاده',NULL,'teeth','15_16_17','A2','متصل به هم',3,1900000.00,5700000.00,0.00,'2026-07-12',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-13 14:12:17','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1031,1,NULL,NULL,3,2,'آقای ربیعی',NULL,'teeth','44_45_46،36','A3','نشست روکش یک میل زیر لثه باشد.',4,2300000.00,9200000.00,0.00,'2026-07-13',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-13 14:14:36','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1032,1,NULL,NULL,3,2,'خانوم ربیعی',NULL,'teeth','45_46،35','A3','35 به سایز مولر ساخته شود\nنشست روکش ، یک میل زیر لثه باشد.',3,2300000.00,6900000.00,0.00,'2026-07-13',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-13 14:16:16','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1034,1,NULL,NULL,2,1,'حمیده حسینپور',NULL,'teeth','26','A3','',1,1200000.00,1200000.00,0.00,'2026-07-14',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-14 15:39:45','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1035,1,NULL,NULL,2,1,'الهام خجسته',NULL,'teeth','36','A3','',1,1200000.00,1200000.00,0.00,'2026-05-16',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 15:51:17','2026-08-26 22:45:03','2026-08-15 18:12:57'),(1036,1,NULL,NULL,2,1,'حمیده حسین پور',NULL,'teeth','35','َA3','',1,1200000.00,1200000.00,0.00,'2026-05-16',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 15:52:13','2026-08-26 22:45:03','2026-08-15 18:12:57'),(1037,1,NULL,NULL,2,1,'مجتبی پولادوند',NULL,'teeth','35','A3','',1,1200000.00,1200000.00,0.00,'2026-05-17',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 15:53:45','2026-08-26 22:45:03','2026-08-15 18:12:57'),(1038,1,NULL,NULL,2,1,'مهدی اخوی',NULL,'teeth','15','A3','',1,1200000.00,1200000.00,0.00,'2026-05-19',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 15:56:29','2026-08-26 22:45:03','2026-08-15 18:12:57'),(1039,1,NULL,NULL,2,1,'زهرا سادات میریعقوبی',NULL,'teeth','46','A3','',1,1200000.00,1200000.00,0.00,'2026-05-19',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 15:57:44','2026-08-26 22:45:03','2026-08-15 18:12:57'),(1040,1,NULL,NULL,2,1,'رومینا عبدی',NULL,'teeth','12','A2','',1,1200000.00,1200000.00,0.00,'2026-05-24',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 15:58:27','2026-08-19 14:20:56','2026-08-15 18:12:57'),(1041,1,NULL,NULL,2,1,'زهرا سادات میریعقوبی',NULL,'teeth','15','A3','',1,1200000.00,1200000.00,0.00,'2026-07-15',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 16:06:21','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1042,1,NULL,NULL,12,1,'پروین کشاورز',NULL,'teeth','14_15','A1','',2,1900000.00,3800000.00,0.00,'2026-06-21',27,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-15 16:26:42','2026-08-26 17:40:37','2026-08-15 18:12:57'),(1043,1,NULL,NULL,2,5,'حمیده قربانی',NULL,'teeth','22','A3','',1,1600000.00,1600000.00,0.00,'2026-07-15',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-16 12:34:33','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1044,1,NULL,NULL,2,2,'حمیده قربانی',NULL,'teeth','22','A3','',1,1200000.00,1200000.00,0.00,'2026-07-15',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-16 12:35:00','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1045,1,NULL,NULL,2,1,'آذرشیخ محمدی',NULL,'teeth','21','B1','',1,1200000.00,1200000.00,0.00,'2026-07-16',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-16 12:37:43','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1046,1,NULL,NULL,3,1,'خانوم محمدزاده',NULL,'teeth','14،24،35','A2','',3,1900000.00,5700000.00,0.00,'2026-07-15',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-18 15:09:12','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1047,1,NULL,NULL,3,1,'آقای عالیش زاده',NULL,'teeth','16،26،47','َA3','',3,1900000.00,5700000.00,0.00,'2026-07-15',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-18 15:11:36','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1048,1,NULL,NULL,2,1,'منصور احمدزاده',NULL,'teeth','15،16_17','A3','',3,1200000.00,3600000.00,0.00,'2026-07-19',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-20 02:22:50','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1049,1,NULL,NULL,2,1,'زینب موسیقلیزاده',NULL,'teeth','45_46','A3','',2,1200000.00,2400000.00,0.00,'2026-07-18',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-20 17:48:46','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1050,1,NULL,NULL,2,3,'هاجر فرج اللهی',NULL,'teeth','14_24','BL3','',8,0.00,0.00,0.00,'2026-07-21',22,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-21 13:06:30','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1055,1,NULL,NULL,2,1,'مهدی نوراللهی',NULL,'teeth','15','A3','',1,1200000.00,1200000.00,0.00,'2026-07-20',22,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-22 17:30:37','2026-08-19 14:20:19','2026-08-15 18:12:57'),(1056,1,NULL,NULL,12,1,'مینا بابایی',NULL,'teeth','37','A2','',1,1900000.00,1900000.00,0.00,'2026-07-14',27,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-22 17:32:44','2026-08-26 17:40:37','2026-08-15 18:12:57'),(1057,1,NULL,NULL,12,1,'زهرا زنده دل',NULL,'teeth','45','A2','',1,1900000.00,1900000.00,0.00,'2026-07-22',27,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-22 20:20:31','2026-08-26 17:40:37','2026-08-15 18:12:57'),(1058,1,NULL,NULL,3,1,'خانوم نکودری',NULL,'teeth','27','A3','',1,1900000.00,1900000.00,0.00,'2026-07-22',17,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-22 20:21:13','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1059,1,NULL,NULL,3,1,'آقای قریب زاده',NULL,'teeth','17،35','َA3','',2,1900000.00,3800000.00,0.00,'2026-07-22',17,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-22 20:22:21','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1060,1,NULL,NULL,3,1,'خانم باغبانی',NULL,'teeth','17','Bl2','',1,1900000.00,1900000.00,120000.00,'2026-07-22',17,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',23,4,'2026-07-22 20:22:51','2026-08-17 12:32:16','2026-08-15 18:12:57'),(1061,1,NULL,NULL,3,2,'آقای تقی زاده',NULL,'teeth','45','A3','',1,2300000.00,2300000.00,0.00,'2026-07-23',26,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-25 17:15:30','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1062,1,NULL,NULL,3,1,'محمد سرداری',NULL,'teeth','21_22_23_24_25_26_27،11_12_13_14_15','BL2','',12,1900000.00,22800000.00,0.00,'2026-07-23',26,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-25 17:17:26','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1063,1,NULL,NULL,3,2,'آقای آقایی',NULL,'teeth','36،25','A3','',2,2300000.00,4600000.00,0.00,'2026-07-23',26,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-25 17:18:20','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1064,1,NULL,NULL,3,1,'آقای کریمی',NULL,'teeth','25،27','BL2','',2,1900000.00,3800000.00,0.00,'2026-07-25',26,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-26 00:59:24','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1065,1,NULL,NULL,3,1,'آقای حمزه پور',NULL,'teeth','13_14_15','A3','',3,1900000.00,5700000.00,0.00,'2026-07-25',26,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-26 01:10:10','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1066,1,NULL,NULL,12,1,'زهرا داوودآبادی',NULL,'teeth','26','A2','',1,1900000.00,1900000.00,0.00,'2026-07-26',27,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-26 01:10:55','2026-08-26 17:39:57','2026-08-15 18:12:57'),(1067,1,NULL,NULL,12,1,'زهرا خانکی',NULL,'teeth','13،23','A3','',2,1900000.00,3800000.00,320000.00,'2026-07-26',27,2,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',26,9,'2026-07-26 22:29:30','2026-08-31 19:15:38','2026-08-26 18:54:09'),(1068,1,NULL,NULL,12,1,'فائزه مقصودی',NULL,'teeth','16','A2','',1,1900000.00,1900000.00,160000.00,'2026-07-26',27,2,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',26,9,'2026-07-26 23:35:10','2026-08-31 19:15:20','2026-08-26 18:54:09'),(1069,1,NULL,NULL,12,1,'سمیرا ایمانی',NULL,'teeth','45','A2','',1,1900000.00,1900000.00,0.00,'2026-07-27',27,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-07-28 03:01:03','2026-08-26 17:39:57','2026-08-15 18:12:57'),(1070,1,NULL,NULL,3,1,'خانوم لطیفی',NULL,'teeth','15','A3','',1,1900000.00,1900000.00,0.00,'2026-06-15',17,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-07-30 12:30:00','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1071,1,NULL,NULL,3,1,'مریم فیضی زاده',NULL,'teeth','12_13،22_23،45،33_34_35','BL2','',8,1900000.00,15200000.00,0.00,'2026-07-18',17,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',1,4,'2026-07-30 14:31:19','2026-08-15 18:12:57','2026-08-15 18:12:57'),(1072,1,NULL,NULL,12,1,'اکرم جعفرسعیدی',NULL,'teeth','15،25','A2','',2,1900000.00,3800000.00,0.00,'2026-07-29',27,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-01 11:31:13','2026-08-26 17:39:57','2026-08-15 18:12:57'),(1073,1,NULL,NULL,16,1,'زینب رضایی','0203','teeth','14،15','A3','',2,1900000.00,3800000.00,0.00,'2026-07-28',28,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-01 13:03:39','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1074,1,NULL,NULL,15,1,'مهناز حسینی','0202','teeth','11','A2','2/3 سرویکال A3.5\n1/3 انسیزال D2\n(بلنک A2 میشه ؟)',1,1900000.00,1900000.00,0.00,'2026-07-28',28,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-01 13:05:45','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1075,1,NULL,NULL,15,1,'حسین محمدزاده','0201','teeth','17','A1','2/3 سرویکال  A2\n1/3 اکلوزال C1',1,1900000.00,1900000.00,0.00,'2026-07-28',28,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-01 13:08:02','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1076,1,NULL,NULL,15,1,'سعید مالکی','0204','teeth','24','B2','',1,1900000.00,1900000.00,0.00,'2026-07-28',28,NULL,NULL,NULL,11,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-01 13:09:32','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1077,1,NULL,NULL,15,11,'اسما سلمانی','0205','teeth','25','','',1,1000000.00,1000000.00,0.00,'2026-07-28',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-01 13:15:39','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1078,1,NULL,NULL,3,1,'خانم ابراهیم پور','0901','teeth','35','A3','',1,1900000.00,1900000.00,0.00,'2026-07-30',26,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-03 10:52:58','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1079,1,NULL,NULL,3,1,'علی اعظمی',NULL,'teeth','11_12_13_14_15_16_17،21_22_23_24_25_26_27','A1','',14,1900000.00,26600000.00,0.00,'2026-08-02',26,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-03 10:54:15','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1080,1,NULL,NULL,15,11,'محمد هادی بابایی','0206','teeth','26','','',1,1000000.00,1000000.00,0.00,'2026-08-01',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-03 10:57:10','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1081,1,NULL,NULL,3,11,'آقای معظمی','0902','teeth','11،12،21،22','','',4,1000000.00,4000000.00,0.00,'2026-08-01',26,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-03 10:58:10','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1082,1,NULL,NULL,3,11,'خانوم گرسابی','0903','teeth','15','','',1,1000000.00,1000000.00,0.00,'2026-08-01',26,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-03 10:59:05','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1083,1,NULL,NULL,2,1,'سمیرا عبداللهی',NULL,'teeth','16','B1','',1,1200000.00,1200000.00,0.00,'2026-07-28',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-03 11:02:22','2026-08-26 22:44:44','2026-08-15 18:12:57'),(1084,1,NULL,NULL,2,1,'فرزانه نورمحمدی',NULL,'teeth','23،24_25_26','A1','',4,1200000.00,4800000.00,0.00,'2026-08-01',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-03 11:03:48','2026-08-26 22:44:44','2026-08-15 18:12:57'),(1085,1,NULL,NULL,3,1,'خانوم حسینی',NULL,'teeth','32،33_34_35_36','A3','',5,1900000.00,9500000.00,600000.00,'2026-08-06',26,1,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',23,4,'2026-08-08 16:35:20','2026-09-01 00:51:14','2026-08-15 18:12:57'),(1086,1,NULL,NULL,12,1,'علی کریمی',NULL,'teeth','14،24','A3','',2,1900000.00,3800000.00,0.00,'2026-08-06',27,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-08 16:38:31','2026-08-26 17:39:57','2026-08-15 18:12:57'),(1087,1,NULL,NULL,15,1,'پرویز قره داغی','0211','teeth','15','A3','',1,1900000.00,1900000.00,0.00,'2026-08-05',28,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-08 16:39:42','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1088,1,NULL,NULL,19,1,'آقای داوودی','2864','teeth','35_36_37_38','A3','',4,1300000.00,5200000.00,0.00,'2026-08-06',19,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',1,4,'2026-08-08 16:44:28','2026-08-25 13:43:33','2026-08-15 18:12:57'),(1089,1,NULL,NULL,19,1,'خانوم خلیلی','2862','teeth','24_25_26،34','A3','',4,1300000.00,5200000.00,0.00,'2026-08-03',19,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',NULL,4,'2026-08-08 16:45:48','2026-08-18 19:40:20','2026-08-15 18:12:57'),(1090,1,NULL,NULL,3,1,'خانوم فتحی','0904','teeth','34','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-08',26,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-08 17:42:48','2026-09-01 00:51:14','2026-08-15 18:12:57'),(1091,1,NULL,NULL,15,11,'طاهره طهماسبی','0210','teeth','15','','',1,1000000.00,1000000.00,0.00,'2026-08-05',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-08 18:37:33','2026-08-31 15:25:16','2026-08-15 18:12:57'),(1092,1,NULL,NULL,22,11,'حسین ولدخانی','0207','teeth','12','','',1,1000000.00,1000000.00,0.00,'2026-08-03',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-08 18:41:42','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1093,1,NULL,NULL,15,11,'فرشته درویشی','0209','teeth','33','','',1,1000000.00,1000000.00,0.00,'2026-08-05',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-08 18:42:33','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1094,1,NULL,NULL,3,1,'خانوم مموئی',NULL,'teeth','46','A3','',1,1900000.00,1900000.00,0.00,'2026-07-26',26,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-08 18:45:45','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1095,1,NULL,NULL,19,1,'خانوم گرشاسبی','2863','teeth','15','A3','',1,1300000.00,1300000.00,0.00,'2026-08-03',19,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',1,4,'2026-08-08 20:58:02','2026-08-18 19:40:20','2026-08-15 18:12:57'),(1096,1,NULL,NULL,15,11,'علی اکبر ابولحسنی','0212','teeth','23','','',1,1000000.00,1000000.00,0.00,'2026-08-08',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'doctor',NULL,18,'2026-08-09 18:30:26','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1097,1,NULL,NULL,3,1,'خانوم لطیفی','2866','teeth','24_25','A3','متصل است.',2,1300000.00,2600000.00,0.00,'2026-08-07',19,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',1,4,'2026-08-09 19:21:15','2026-08-22 13:01:36','2026-08-15 18:12:57'),(1098,1,NULL,NULL,3,1,'خانوم داداش زاده','2865','teeth','15_16','A3','متصل است',2,1300000.00,2840000.00,240000.00,'2026-08-07',19,1,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',23,4,'2026-08-09 19:24:16','2026-08-25 13:43:33','2026-08-15 18:12:57'),(1099,1,2,NULL,25,1,'خانوم محمدزاده',NULL,'teeth','11_12_13،21_22_23،24_25','A1','',8,1900000.00,15200000.00,1280000.00,'2026-08-09',NULL,2,NULL,NULL,NULL,13,12,2,250000.00,'doctor',26,4,'2026-08-09 19:31:43','2026-09-01 00:51:14','2026-08-15 18:12:57'),(1100,1,NULL,NULL,2,1,'فاطمه عبدیپور',NULL,'teeth','45','A2','',1,1200000.00,1200000.00,0.00,'2026-08-04',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-09 19:39:52','2026-08-26 22:44:44','2026-08-15 18:12:57'),(1101,1,NULL,NULL,2,1,'نجمه باغبانی',NULL,'teeth','44_45','A3','',2,1200000.00,2400000.00,0.00,'2026-08-05',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-09 19:41:32','2026-08-26 22:44:44','2026-08-15 18:12:57'),(1102,1,NULL,NULL,2,1,'مرتضی خدابخشی',NULL,'teeth','12_21','A1_A2','',2,1200000.00,2400000.00,320000.00,'2026-08-08',29,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,12,'2026-08-09 19:42:38','2026-08-31 20:02:08','2026-08-15 18:12:57'),(1104,1,NULL,NULL,12,1,'رقیه شکری',NULL,'teeth','47','A2','',1,1900000.00,1900000.00,0.00,'2026-08-09',27,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-09 20:42:45','2026-08-26 17:39:57','2026-08-15 18:12:57'),(1105,1,NULL,NULL,2,1,'مجتبی میرزایی',NULL,'teeth','36،37','A2','',2,1200000.00,2400000.00,0.00,'2026-08-09',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-09 21:01:29','2026-08-26 22:44:44','2026-08-15 18:12:57'),(1106,1,NULL,NULL,3,1,'آقای آقایی','0905','teeth','35','A3','',1,1900000.00,1900000.00,120000.00,'2026-08-09',26,1,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',23,4,'2026-08-10 12:48:05','2026-08-26 17:37:24','2026-08-15 18:12:57'),(1107,2,1,NULL,20,1,'مهناز باباها',NULL,'teeth','22','C2','',1,1900000.00,1900000.00,120000.00,'2026-08-10',NULL,1,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',23,4,'2026-08-10 14:35:27','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1108,2,1,NULL,20,1,'تقی رستمی',NULL,'teeth','12_13','A3','',2,1900000.00,3800000.00,0.00,'2026-08-10',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',1,4,'2026-08-10 14:44:31','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1109,1,NULL,NULL,12,7,'حسن حیدری',NULL,'teeth','43_42_41_31_32_33','A1','',6,0.00,0.00,0.00,'2026-08-10',27,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',NULL,4,'2026-08-10 18:40:16','2026-08-31 14:27:08','2026-08-15 18:12:57'),(1110,1,2,NULL,12,1,'شهناز عبدیان',NULL,'teeth','16','BL2','',1,1900000.00,1900000.00,120000.00,'2026-08-10',27,1,NULL,NULL,NULL,13,13,1,250000.00,'doctor',23,4,'2026-08-10 19:24:37','2026-08-31 15:25:16','2026-08-15 18:12:57'),(1111,1,NULL,NULL,2,1,'رقیه کشاورز',NULL,'teeth','15','A3','',1,1200000.00,1200000.00,120000.00,'2026-08-11',29,1,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',23,4,'2026-08-11 01:38:47','2026-08-26 22:44:44','2026-08-15 18:12:57'),(1112,1,2,NULL,12,1,'زهرا صالحی',NULL,'teeth','36،46','A2','',2,1900000.00,3800000.00,0.00,'2026-08-11',27,NULL,NULL,NULL,NULL,13,12,2,250000.00,'doctor',1,4,'2026-08-14 13:32:19','2026-08-31 15:25:16','2026-08-26 19:08:04'),(1113,1,NULL,NULL,16,11,'زهره نورانی','0216','teeth','24','','',1,1000000.00,1000000.00,0.00,'2026-08-10',28,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'lab_out',NULL,18,'2026-08-15 10:59:32','2026-08-26 17:41:28','2026-08-15 18:12:57'),(1114,1,NULL,NULL,16,1,'حسین ماضی','0213','teeth','16،36_37','A3','',3,1900000.00,5700000.00,480000.00,'2026-08-09',28,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-15 11:05:50','2026-09-01 00:51:14','2026-08-15 18:12:57'),(1115,1,NULL,NULL,22,1,'امین بابایی','0214','teeth','35','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-10',28,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,3,'2026-08-15 11:13:15','2026-09-01 00:51:14','2026-08-15 18:12:57'),(1116,2,1,NULL,20,1,'مهدیس خلیلی',NULL,'teeth','25','A1','',1,1900000.00,1900000.00,0.00,'2026-08-15',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',1,4,'2026-08-15 12:01:58','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1117,2,1,NULL,20,1,'فاطمه مظفری',NULL,'teeth','14_15','A3','متصل',2,1900000.00,3800000.00,0.00,'2026-08-15',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',1,4,'2026-08-15 12:13:33','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1118,2,1,NULL,21,1,'علیرضا صنعتی',NULL,'teeth','23_24_25','BL2','',3,1900000.00,5700000.00,0.00,'2026-08-01',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-15 12:26:50','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1119,2,1,NULL,21,1,'مهین جلیلوند',NULL,'teeth','36','A3','',1,1900000.00,1900000.00,0.00,'2026-08-01',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-15 12:28:12','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1120,2,1,NULL,21,1,'مهدی بابا',NULL,'teeth','24','BL2','',1,1900000.00,1900000.00,0.00,'2026-08-01',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-15 12:28:57','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1121,2,1,NULL,20,1,'شقایق شیرمحمدی',NULL,'teeth','36','A2','',1,1900000.00,1900000.00,0.00,'2026-08-05',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-15 12:30:43','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1122,2,1,NULL,20,1,'فاطمه صفری',NULL,'teeth','14','A3','',1,1900000.00,1900000.00,0.00,'2026-08-05',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',NULL,4,'2026-08-15 12:31:35','2026-08-28 13:23:41','2026-08-15 18:12:57'),(1123,1,2,NULL,3,1,'مریم فیضی زاده',NULL,'teeth','12_13،22_23','BL2','تجدید ساخت - یک بار ساختیم ولی ترک داشت و شکست، دکتر هم گفت کلا طراحی رو عوض کنید. قراره سانترال ها رو ایمپلنت کنه ، با توجه به این نکته ابعاد لترال ها رو متناسب در نظر بگیرید.',4,0.00,0.00,960000.00,'2026-08-08',26,2,NULL,NULL,NULL,13,12,2,250000.00,'doctor',26,4,'2026-08-15 14:44:13','2026-09-01 00:51:14','2026-08-15 18:12:57'),(1124,1,NULL,NULL,12,1,'حبیبه پناهی',NULL,'teeth','31_32_33','A2','متصل',3,1900000.00,5700000.00,480000.00,'2026-08-15',27,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-15 18:11:57','2026-09-01 00:51:14','2026-08-17 12:33:39'),(1125,1,NULL,NULL,3,1,'خانوم فولادی','0906','teeth','15،25','A3','تا 30 مرداد تحویل شود',2,1900000.00,3800000.00,0.00,'2026-08-15',26,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-15 21:01:43','2026-08-31 14:27:08','2026-08-17 12:33:39'),(1126,1,NULL,NULL,22,1,'نیلوفر زمانی','0215','teeth','46','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-16',28,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,3,'2026-08-16 13:07:04','2026-09-01 00:51:14','2026-08-17 12:33:39'),(1127,1,NULL,NULL,2,1,'محمد رضا کربلایی حسن خانی',NULL,'teeth','25','A3','',1,1200000.00,1200000.00,0.00,'2026-08-16',29,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-16 19:04:45','2026-08-31 16:23:36','2026-08-17 12:33:39'),(1128,1,NULL,NULL,3,1,'عماد معظمی',NULL,'teeth','11_12_21_22','A2','',4,1900000.00,7600000.00,640000.00,'2026-08-16',26,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-16 19:10:31','2026-08-31 15:25:16','2026-08-17 12:33:39'),(1129,1,NULL,NULL,2,1,'هانیه خلیل نسب','1901','teeth','24','A3','',1,1200000.00,1200000.00,160000.00,'2026-08-17',29,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-17 16:19:30','2026-08-31 16:23:36','2026-08-22 17:54:09'),(1130,1,NULL,NULL,2,1,'شهناز حیدری','1902','teeth','16','A3','',1,1200000.00,1200000.00,160000.00,'2026-08-17',29,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-17 17:31:18','2026-08-31 16:23:36','2026-08-22 17:54:09'),(1131,1,2,NULL,25,1,'خانم ملکی','1903','teeth','11،12،13،14،15،21،22،23،24،25،34،33،32،31،41،42،43،44','BL2','',18,1900000.00,34200000.00,2880000.00,'2026-08-18',NULL,2,NULL,NULL,NULL,13,12,2,250000.00,'doctor',26,14,'2026-08-18 14:23:47','2026-08-29 15:33:42','2026-08-22 17:54:09'),(1132,1,NULL,NULL,2,1,'حسن توحید نیا','1904','teeth','13_14_15_16','A3','متصل هستند',4,1900000.00,7600000.00,640000.00,'2026-08-19',29,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-19 16:27:49','2026-08-31 16:23:36','2026-08-22 17:54:09'),(1133,1,NULL,NULL,25,1,'خانوم بیگدلی','1905','teeth','44_45_46','A3','متصل',3,1900000.00,5700000.00,480000.00,'2026-08-20',NULL,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,3,'2026-08-22 11:59:49','2026-08-31 16:28:07','2026-08-22 17:54:09'),(1134,1,NULL,NULL,3,1,'آقای پیران','1907','teeth','13،27','A3','',2,1900000.00,3800000.00,320000.00,'2026-08-20',26,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,3,'2026-08-22 12:02:16','2026-08-31 16:28:07','2026-08-22 17:54:09'),(1135,1,NULL,NULL,3,1,'خانوم لطیفی','1908','teeth','15_16_17','A3','',3,1900000.00,5700000.00,480000.00,'2026-08-20',26,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,12,'2026-08-22 12:09:32','2026-08-31 20:02:08','2026-08-22 17:54:09'),(1136,1,NULL,NULL,3,1,'آقای محمدی','1909','teeth','15','BL2','فوری',1,1900000.00,1900000.00,160000.00,'2026-08-20',26,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-22 12:11:35','2026-08-29 12:27:02','2026-08-22 17:54:09'),(1137,1,NULL,NULL,3,1,'آقای گیلانی','1910','teeth','26،42_43_44_45','A3','متصل',5,1900000.00,9500000.00,800000.00,'2026-08-20',26,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,12,'2026-08-22 12:15:35','2026-08-31 20:02:08','2026-08-22 17:54:09'),(1138,1,NULL,NULL,15,11,'حنانه ملکپور','0217','teeth','36','','',1,1000000.00,1000000.00,0.00,'2026-08-18',28,NULL,NULL,NULL,17,17,11,1,1000000.00,'lab_out',NULL,18,'2026-08-22 13:15:19','2026-08-26 17:41:28','2026-08-22 17:54:09'),(1139,1,NULL,NULL,15,11,'اسما سلمانی','0218','teeth','14','','',1,1000000.00,1000000.00,0.00,'2026-08-18',28,NULL,NULL,NULL,17,17,11,1,1000000.00,'lab_out',NULL,18,'2026-08-22 13:43:04','2026-08-26 17:41:28','2026-08-22 17:54:09'),(1140,1,NULL,NULL,15,1,'حمید طحانیان','0221','teeth','46','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-19',28,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,3,'2026-08-22 13:56:30','2026-08-31 16:28:08','2026-08-22 17:54:09'),(1141,2,NULL,NULL,21,1,'اکرم قدیری','0818','teeth','15_16','BL2','',2,1900000.00,3800000.00,320000.00,'2026-08-19',NULL,2,NULL,NULL,13,NULL,NULL,0,NULL,'doctor',26,4,'2026-08-22 14:17:54','2026-09-01 00:52:04','2026-08-22 17:54:09'),(1142,1,NULL,NULL,16,1,'فهیمه کرمی','0219','teeth','35','A2','',1,1900000.00,1900000.00,160000.00,'2026-08-19',28,2,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,3,'2026-08-22 14:18:54','2026-08-31 16:28:08','2026-08-22 17:54:09'),(1143,2,1,NULL,21,1,'سعید ولیه','817','teeth','11_12،21_22،13_14','B1','',6,1900000.00,11400000.00,960000.00,'2026-08-22',NULL,2,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',26,7,'2026-08-22 14:41:21','2026-08-31 15:27:59','2026-08-22 17:54:09'),(1144,2,1,NULL,21,1,'پروانه کشاورز','816','teeth','46_47','BL3','',2,1900000.00,3800000.00,320000.00,'2026-08-19',NULL,2,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',26,4,'2026-08-22 14:44:39','2026-08-28 13:23:41','2026-08-22 17:54:09'),(1145,2,1,NULL,21,1,'سمیه رضی','820','teeth','16،25_26_27','BL3','',4,1900000.00,7600000.00,640000.00,'2026-08-21',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',26,9,'2026-08-22 16:58:40','2026-08-31 19:10:43','2026-08-22 17:54:09'),(1146,2,1,NULL,21,1,'علی آقایی','819','teeth','25،45_46','BL3','متصل',3,1900000.00,5700000.00,480000.00,'2026-08-21',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',26,9,'2026-08-22 17:16:04','2026-08-31 19:10:34','2026-08-22 17:54:09'),(1147,1,NULL,NULL,2,1,'زهرا عین الله زاده','1911','teeth','25','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-23',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,12,'2026-08-23 17:01:30','2026-08-31 20:02:08','2026-08-26 17:51:51'),(1148,1,NULL,NULL,2,1,'مرضیه نوراللهی','1913','teeth','25','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-24',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-24 18:50:09','2026-08-31 16:23:36','2026-08-26 17:51:51'),(1149,1,NULL,NULL,3,1,'آقای شهریار','2871','teeth','46_47','A3','',2,1300000.00,2600000.00,320000.00,'2026-08-24',NULL,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',26,9,'2026-08-24 19:10:43','2026-08-31 19:10:25','2026-08-26 17:51:51'),(1150,1,NULL,1149,3,14,'آقای شهریار','2871','teeth','24_25_26','A1','فایلها با کیس 1149 مشترک هستند.',3,460000.00,1380000.00,180000.00,'2026-08-24',NULL,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',26,9,'2026-08-24 19:21:54','2026-08-31 19:10:58','2026-08-26 17:51:51'),(1151,1,NULL,NULL,3,1,'خانوم دلیمی','2870','teeth','15','BL2','',1,1300000.00,1300000.00,160000.00,'2026-08-24',NULL,NULL,NULL,NULL,18,NULL,NULL,0,NULL,'lab_in',26,9,'2026-08-24 19:24:13','2026-08-31 19:11:17','2026-08-26 17:51:51'),(1152,1,NULL,NULL,16,1,'زهرا افکاریان','0222','teeth','14،24_25_26،45','','رنگ تعیین نشده است - عکس نمونه رنگ ارسال میشود.',5,1900000.00,9500000.00,800000.00,'2026-08-23',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,8,'2026-08-24 19:43:47','2026-08-26 18:54:09','2026-08-26 18:54:09'),(1153,1,NULL,NULL,2,16,'حدیث میرخانی',NULL,'upper','','','',1,6000000.00,6000000.00,0.00,'2026-08-24',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,4,'2026-08-24 21:56:51','2026-08-31 14:27:08',NULL),(1154,1,2,1153,2,17,'حدیث میرخانی',NULL,'upper','','','',17,1200000.00,20400000.00,0.00,'2026-08-25',NULL,NULL,NULL,NULL,NULL,13,12,17,250000.00,'doctor',1,18,'2026-08-25 00:53:30','2026-08-28 13:23:22',NULL),(1155,1,NULL,NULL,2,16,'داود حسینی',NULL,'lower','','','',1,6000000.00,6000000.00,0.00,'2026-08-25',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',1,18,'2026-08-25 01:04:34','2026-08-25 16:38:55',NULL),(1156,1,2,1155,2,17,'داود حسینی',NULL,'lower','','','',16,1200000.00,19200000.00,0.00,'2026-08-25',NULL,NULL,NULL,NULL,NULL,13,12,16,250000.00,'doctor',NULL,18,'2026-08-25 12:53:16','2026-08-28 13:23:22',NULL),(1157,1,NULL,NULL,15,1,'حسین ولدخانی','223','teeth','12','A2','',1,1900000.00,1900000.00,160000.00,'2026-08-25',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-26 18:24:32','2026-08-29 14:12:59','2026-08-26 18:57:39'),(1158,1,NULL,NULL,16,1,'لیلی کاظمی','224','teeth','13_14_15_16_17,23_24_25_26','B1','12 الی 22 طراحی فریم برای لیرینگ توسط پودرگذار',9,1900000.00,17100000.00,1440000.00,'2026-08-26',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-26 18:30:23','2026-08-29 14:12:59','2026-08-26 18:54:09'),(1159,1,NULL,NULL,16,1,'علیرضا آتشین','225','teeth','13_14_15','BL3','',3,1900000.00,5700000.00,480000.00,'2026-08-26',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-26 18:36:51','2026-09-01 00:52:04','2026-08-26 18:54:09'),(1160,1,2,1158,16,18,'لیلی کاظمی','225','teeth','11_12_21_22','B1','فایل اسکن داخل دهانی و کست داخل کیس قبلی',4,3000000.00,12000000.00,240000.00,'2026-08-26',NULL,NULL,NULL,NULL,NULL,13,18,4,1500000.00,'doctor',26,19,'2026-08-26 18:51:56','2026-08-29 14:12:59','2026-08-26 18:54:09'),(1161,1,NULL,NULL,15,1,'فرشته درویشی','226','teeth','33','D2','',1,1900000.00,1900000.00,160000.00,'2026-08-26',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-26 22:53:28','2026-08-29 19:02:56','2026-08-29 17:43:38'),(1162,1,NULL,NULL,3,1,'خانوم سیفی','907','teeth','35','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-26',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-26 22:54:19','2026-08-29 19:02:56','2026-08-29 17:43:38'),(1163,1,NULL,NULL,3,11,'خانوم سیفی','908','teeth','35','','',1,1000000.00,1000000.00,0.00,'2026-08-26',NULL,NULL,NULL,NULL,17,NULL,NULL,0,NULL,'lab_out',NULL,18,'2026-08-26 23:05:41','2026-08-29 17:43:38','2026-08-29 17:43:38'),(1164,1,NULL,NULL,25,1,'لعیا کنکاوی','1914','teeth','16','A2','',1,1900000.00,1900000.00,160000.00,'2026-08-27',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-29 13:36:15','2026-08-29 17:43:38','2026-08-29 17:43:38'),(1165,1,NULL,NULL,25,1,'مریم کنکاوی','1915','teeth','15,46','A2','',2,1900000.00,3800000.00,160000.00,'2026-08-27',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-29 13:49:31','2026-08-29 19:02:29','2026-08-29 17:43:38'),(1166,1,NULL,NULL,25,1,'آقای سخاوت','1916','teeth','37','A2','',1,1900000.00,1900000.00,160000.00,'2026-08-27',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-29 14:01:42','2026-08-29 17:43:38','2026-08-29 17:43:38'),(1167,1,NULL,NULL,15,1,'مریم لجلی','0227','teeth','36','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-31',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-31 15:53:00','2026-08-31 15:53:00',NULL),(1168,1,NULL,NULL,2,1,'یعقوب تشکری','1917','teeth','25','A3','',1,1900000.00,1900000.00,160000.00,'2026-08-31',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,19,'2026-08-31 16:37:48','2026-08-31 16:37:48',NULL),(1169,1,NULL,NULL,16,1,'QA-001621-A ساده دکتر',NULL,NULL,NULL,NULL,NULL,2,1900000.00,3800000.00,320000.00,'2026-09-01',NULL,NULL,NULL,NULL,NULL,NULL,NULL,0,NULL,'doctor',26,1,'2026-09-01 01:46:21','2026-09-01 01:46:21',NULL),(1170,1,2,NULL,25,1,'QA-001621-B جانبی قزوین',NULL,NULL,NULL,NULL,NULL,4,1900000.00,7600000.00,640000.00,'2026-09-01',NULL,NULL,NULL,NULL,NULL,13,12,2,250000.00,'doctor',26,1,'2026-09-01 01:46:21','2026-09-01 01:46:21',NULL),(1171,1,NULL,NULL,15,11,'QA-001621-C برونسپاری ساجدی',NULL,NULL,NULL,NULL,NULL,1,1000000.00,1000000.00,0.00,'2026-09-01',NULL,NULL,NULL,NULL,17,17,11,1,1000000.00,'lab_out',NULL,1,'2026-09-01 01:46:21','2026-09-01 01:46:21',NULL),(1172,2,1,NULL,21,1,'QA-001621-D قزوین به ما',NULL,NULL,NULL,NULL,NULL,2,1900000.00,3800000.00,320000.00,'2026-09-01',NULL,NULL,NULL,NULL,27,NULL,NULL,0,NULL,'lab_out',26,1,'2026-09-01 01:46:21','2026-09-01 01:46:21',NULL);
/*!40000 ALTER TABLE `cases` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `designer_invoice_items`
--

DROP TABLE IF EXISTS `designer_invoice_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `designer_invoice_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `invoice_id` int(11) NOT NULL,
  `case_id` int(11) DEFAULT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `doctor_name` varchar(191) DEFAULT NULL,
  `service_id` int(11) DEFAULT NULL,
  `service_title` varchar(191) DEFAULT NULL,
  `patient_name` varchar(191) DEFAULT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `unit_design_fee` decimal(15,2) NOT NULL DEFAULT 0.00,
  `total_amount` decimal(15,2) NOT NULL DEFAULT 0.00,
  `received_date` date DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `invoice_id` (`invoice_id`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `designer_invoice_items`
--

LOCK TABLES `designer_invoice_items` WRITE;
/*!40000 ALTER TABLE `designer_invoice_items` DISABLE KEYS */;
INSERT INTO `designer_invoice_items` VALUES (1,1,1085,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','خانوم حسینی',5,120000.00,600000.00,'2026-08-06','2026-08-22 19:38:19'),(2,1,1098,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','خانوم داداش زاده',2,120000.00,240000.00,'2026-08-07','2026-08-22 19:38:19'),(3,1,1106,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','آقای آقایی',1,120000.00,120000.00,'2026-08-09','2026-08-22 19:38:19'),(4,1,1107,20,'شیخی',1,'روکش زیرکونیا مولتی لیر','مهناز باباها',1,120000.00,120000.00,'2026-08-10','2026-08-22 19:38:19'),(5,1,1110,12,'میلاد پوریا',1,'روکش زیرکونیا مولتی لیر','شهناز عبدیان',1,120000.00,120000.00,'2026-08-10','2026-08-22 19:38:19'),(6,1,1111,2,'زهرا حسینی',1,'روکش زیرکونیا مولتی لیر','رقیه کشاورز',1,120000.00,120000.00,'2026-08-11','2026-08-22 19:38:19'),(7,2,1067,12,'میلاد پوریا',1,'روکش زیرکونیا مولتی لیر','زهرا خانکی',2,160000.00,320000.00,'2026-07-26','2026-08-26 19:05:51'),(8,2,1068,12,'میلاد پوریا',1,'روکش زیرکونیا مولتی لیر','فائزه مقصودی',1,160000.00,160000.00,'2026-07-26','2026-08-26 19:05:51'),(9,2,1090,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','خانوم فتحی',1,160000.00,160000.00,'2026-08-08','2026-08-26 19:05:51'),(10,2,1102,2,'زهرا حسینی',1,'روکش زیرکونیا مولتی لیر','مرتضی خدابخشی',2,160000.00,320000.00,'2026-08-08','2026-08-26 19:05:51'),(11,2,1123,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','مریم فیضی زاده',4,160000.00,640000.00,'2026-08-08','2026-08-26 19:05:51'),(12,2,1099,25,'احمد عمیدی',1,'روکش زیرکونیا مولتی لیر','خانوم محمدزاده',8,160000.00,1280000.00,'2026-08-09','2026-08-26 19:05:51'),(13,2,1114,16,'مهدی آرزوبخش',1,'روکش زیرکونیا مولتی لیر','حسین ماضی',3,160000.00,480000.00,'2026-08-09','2026-08-26 19:05:51'),(14,2,1115,22,'کاشفی',1,'روکش زیرکونیا مولتی لیر','امین بابایی',1,160000.00,160000.00,'2026-08-10','2026-08-26 19:05:51'),(15,2,1124,12,'میلاد پوریا',1,'روکش زیرکونیا مولتی لیر','حبیبه پناهی',3,160000.00,480000.00,'2026-08-15','2026-08-26 19:05:51'),(16,2,1126,22,'کاشفی',1,'روکش زیرکونیا مولتی لیر','نیلوفر زمانی',1,160000.00,160000.00,'2026-08-16','2026-08-26 19:05:51'),(17,2,1128,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','عماد معظمی',4,160000.00,640000.00,'2026-08-16','2026-08-26 19:05:51'),(18,2,1129,2,'زهرا حسینی',1,'روکش زیرکونیا مولتی لیر','هانیه خلیل نسب',1,160000.00,160000.00,'2026-08-17','2026-08-26 19:05:51'),(19,2,1130,2,'زهرا حسینی',1,'روکش زیرکونیا مولتی لیر','شهناز حیدری',1,160000.00,160000.00,'2026-08-17','2026-08-26 19:05:51'),(20,2,1131,25,'احمد عمیدی',1,'روکش زیرکونیا مولتی لیر','خانم ملکی',18,160000.00,2880000.00,'2026-08-18','2026-08-26 19:05:51'),(21,2,1132,2,'زهرا حسینی',1,'روکش زیرکونیا مولتی لیر','حسن توحید نیا',4,160000.00,640000.00,'2026-08-19','2026-08-26 19:05:51'),(22,2,1140,15,'محمد موسی زاده',1,'روکش زیرکونیا مولتی لیر','حمید طحانیان',1,160000.00,160000.00,'2026-08-19','2026-08-26 19:05:51'),(23,2,1141,21,'خطیب',1,'روکش زیرکونیا مولتی لیر','اکرم قدیری',2,160000.00,320000.00,'2026-08-19','2026-08-26 19:05:51'),(24,2,1142,16,'مهدی آرزوبخش',1,'روکش زیرکونیا مولتی لیر','فهیمه کرمی',1,160000.00,160000.00,'2026-08-19','2026-08-26 19:05:51'),(25,2,1144,21,'خطیب',1,'روکش زیرکونیا مولتی لیر','پروانه کشاورز',2,160000.00,320000.00,'2026-08-19','2026-08-26 19:05:51'),(26,2,1133,25,'احمد عمیدی',1,'روکش زیرکونیا مولتی لیر','خانوم بیگدلی',3,160000.00,480000.00,'2026-08-20','2026-08-26 19:05:51'),(27,2,1134,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','آقای پیران',2,160000.00,320000.00,'2026-08-20','2026-08-26 19:05:51'),(28,2,1135,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','خانوم لطیفی',3,160000.00,480000.00,'2026-08-20','2026-08-26 19:05:51'),(29,2,1136,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','آقای محمدی',1,160000.00,160000.00,'2026-08-20','2026-08-26 19:05:51'),(30,2,1137,3,'احمدرضا ربیعی',1,'روکش زیرکونیا مولتی لیر','آقای گیلانی',5,160000.00,800000.00,'2026-08-20','2026-08-26 19:05:51'),(31,2,1143,21,'خطیب',1,'روکش زیرکونیا مولتی لیر','سعید ولیه',6,160000.00,960000.00,'2026-08-22','2026-08-26 19:05:51');
/*!40000 ALTER TABLE `designer_invoice_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `designer_invoices`
--

DROP TABLE IF EXISTS `designer_invoices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `designer_invoices` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `invoice_number` varchar(50) NOT NULL,
  `designer_id` int(11) NOT NULL,
  `total_amount` decimal(15,2) NOT NULL DEFAULT 0.00,
  `payment_status` enum('unpaid','partial','paid') NOT NULL DEFAULT 'unpaid',
  `period_label` varchar(120) DEFAULT NULL,
  `invoice_date` date NOT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `designer_id` (`designer_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `designer_invoices`
--

LOCK TABLES `designer_invoices` WRITE;
/*!40000 ALTER TABLE `designer_invoices` DISABLE KEYS */;
INSERT INTO `designer_invoices` VALUES (1,1,'INV-DES-202608-001',23,1320000.00,'paid','مرداد 1405','2026-08-22','فاکتور طراحی — بازه: مرداد 1405','2026-08-22 19:38:19'),(2,1,'INV-DES-202608-002',26,12800000.00,'paid','مرداد 1405','2026-08-26','فاکتور طراحی — بازه: مرداد 1405','2026-08-26 19:05:51');
/*!40000 ALTER TABLE `designer_invoices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctor_gallery`
--

DROP TABLE IF EXISTS `doctor_gallery`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doctor_gallery` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `doctor_id` int(11) NOT NULL,
  `image_path` varchar(255) NOT NULL,
  `caption` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `doctor_id` (`doctor_id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctor_gallery`
--

LOCK TABLES `doctor_gallery` WRITE;
/*!40000 ALTER TABLE `doctor_gallery` DISABLE KEYS */;
INSERT INTO `doctor_gallery` VALUES (1,3,'9f5f725694a3e31f.png','توی کارهای قالب :\r\nAxial 0.35\r\nradial 0.2','2026-08-10 12:07:42','2026-08-10 12:07:42'),(2,3,'83a0b35f5e583074.png','نمونه خط تراش ترسیم شده توسط پزشک','2026-08-10 12:08:31','2026-08-10 12:08:31'),(3,3,'d8d500775cf6d159.png','این موارد مورد قبول نیست . باعث سخت شدن فرایند تحویل میشن.','2026-08-10 12:09:16','2026-08-10 12:09:16'),(4,3,'9b34a7ba044e0039.png','این موارد مورد قبول نیست . باعث سخت شدن فرایند تحویل میشن.','2026-08-10 12:09:45','2026-08-10 12:09:45'),(5,3,'2a07ecf259eefe16.png','این ناهمواری ها توی خط تراش قابل قبول نیست.','2026-08-10 12:10:36','2026-08-10 12:10:36');
/*!40000 ALTER TABLE `doctor_gallery` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctor_invoices`
--

DROP TABLE IF EXISTS `doctor_invoices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doctor_invoices` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `invoice_number` varchar(50) NOT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `doctor_name` varchar(255) NOT NULL,
  `doctor_phone` varchar(20) DEFAULT NULL,
  `doctor_email` varchar(120) DEFAULT NULL,
  `total_amount` decimal(15,2) DEFAULT NULL,
  `payment_status` varchar(20) DEFAULT 'unpaid',
  `invoice_date` date DEFAULT NULL,
  `due_date` date DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `bank_account_id` int(11) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `invoice_number` (`invoice_number`),
  KEY `fk_invoices_user` (`doctor_id`),
  KEY `fk_invoice_bank_account` (`bank_account_id`),
  CONSTRAINT `fk_invoices_user` FOREIGN KEY (`doctor_id`) REFERENCES `users` (`id`) ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctor_invoices`
--

LOCK TABLES `doctor_invoices` WRITE;
/*!40000 ALTER TABLE `doctor_invoices` DISABLE KEYS */;
INSERT INTO `doctor_invoices` VALUES (17,1,'INV-202607-001',3,'احمدرضا ربیعی','09129351238','Dr_Rabiei@exolab.ir',84200000.00,'paid','2026-07-30',NULL,'فاکتور ماهانه خودکار',1,'2026-07-30 14:22:36','2026-08-23 13:15:18'),(19,1,'INV-LAB-202608-001',NULL,'امین',NULL,NULL,16900000.00,'paid','2026-08-18',NULL,'فاکتور لابراتوار — بازه: مرداد 1405',1,'2026-08-18 19:40:20','2026-08-23 18:51:22'),(22,1,'INV-202608-001',2,'زهرا حسینی','09127727903','hoseinizahra70@gmail.com',16720000.00,'paid','2026-08-19','2026-08-19','فاکتور ماهانه خودکار',1,'2026-08-19 14:20:19','2026-08-23 18:58:13'),(26,NULL,'INV-202608-002',3,'احمدرضا ربیعی','09129351238','Dr_Rabiei@exolab.ir',120200000.00,'paid','2026-08-26',NULL,'فاکتور ماهانه خودکار',1,'2026-08-26 17:37:23','2026-08-29 16:50:34'),(27,NULL,'INV-202608-003',12,'میلاد پوریا','09128338892','Dr_pouya@exolab.ir',36100000.00,'unpaid','2026-08-26','2026-08-26','فاکتور ماهانه خودکار',1,'2026-08-26 17:39:57','2026-08-26 17:40:37'),(28,NULL,'INV-CLN-202608-001',14,'کلینیک مهدی آرزوبخش','09124979760','CLINIC_Arezoubakhsh@exolab.ir',32400000.00,'unpaid','2026-08-26','2026-08-26','فاکتور کلینیک — بازه: مرداد 1405',1,'2026-08-26 17:41:28','2026-08-26 17:41:58'),(29,NULL,'INV-202608-004',2,'زهرا حسینی','09127727903','hoseinizahra70@gmail.com',32800000.00,'paid','2026-08-26','2026-08-26','فاکتور ماهانه خودکار',1,'2026-08-26 22:44:44','2026-08-26 22:46:00');
/*!40000 ALTER TABLE `doctor_invoices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctor_payment_invoices`
--

DROP TABLE IF EXISTS `doctor_payment_invoices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doctor_payment_invoices` (
  `payment_id` int(11) NOT NULL,
  `invoice_id` int(11) NOT NULL,
  `amount_applied` decimal(15,2) DEFAULT 0.00,
  PRIMARY KEY (`payment_id`,`invoice_id`),
  KEY `invoice_id` (`invoice_id`),
  CONSTRAINT `fk_payment_invoice_invoice` FOREIGN KEY (`invoice_id`) REFERENCES `doctor_invoices` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk_payment_invoice_payment` FOREIGN KEY (`payment_id`) REFERENCES `doctor_payments` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctor_payment_invoices`
--

LOCK TABLES `doctor_payment_invoices` WRITE;
/*!40000 ALTER TABLE `doctor_payment_invoices` DISABLE KEYS */;
INSERT INTO `doctor_payment_invoices` VALUES (1,17,84200000.00),(2,22,6000000.00),(3,19,16900000.00),(4,22,16720000.00),(5,29,32800000.00),(6,26,120200000.00);
/*!40000 ALTER TABLE `doctor_payment_invoices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctor_payments`
--

DROP TABLE IF EXISTS `doctor_payments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doctor_payments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `doctor_name` varchar(255) NOT NULL,
  `amount` decimal(15,2) NOT NULL,
  `payment_method` varchar(50) NOT NULL,
  `payment_date` date NOT NULL,
  `transaction_number` varchar(100) DEFAULT NULL,
  `bank_account_id` int(11) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `bank_account_id` (`bank_account_id`),
  KEY `fk_payments_user` (`doctor_id`),
  CONSTRAINT `fk_payments_bank_account` FOREIGN KEY (`bank_account_id`) REFERENCES `bank_accounts` (`id`),
  CONSTRAINT `fk_payments_user` FOREIGN KEY (`doctor_id`) REFERENCES `users` (`id`) ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctor_payments`
--

LOCK TABLES `doctor_payments` WRITE;
/*!40000 ALTER TABLE `doctor_payments` DISABLE KEYS */;
INSERT INTO `doctor_payments` VALUES (1,1,3,'',84200000.00,'پایا','2026-08-01','14053619860304',1,NULL,'2026-08-08 06:30:38','2026-08-23 13:15:18'),(2,1,2,'',6000000.00,'پایا','2026-08-13',NULL,1,NULL,'2026-08-20 18:53:05','2026-08-23 13:15:18'),(3,1,18,'',16900000.00,'پایا','2026-08-23','140506011811324520563444584344',1,NULL,'2026-08-23 18:51:22','2026-08-26 16:34:25'),(4,1,2,'',16720000.00,'پل','2026-07-22',NULL,1,NULL,'2026-08-23 18:58:13','2026-08-26 16:34:25'),(5,1,2,'',32800000.00,'پل','2026-08-26',NULL,1,NULL,'2026-08-26 22:46:00','2026-08-26 22:46:00'),(6,1,3,'',120200000.00,'پایا','2026-08-29','14054506341791',1,NULL,'2026-08-29 16:50:34','2026-08-29 16:50:34');
/*!40000 ALTER TABLE `doctor_payments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doctor_price_overrides`
--

DROP TABLE IF EXISTS `doctor_price_overrides`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doctor_price_overrides` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `doctor_id` int(11) NOT NULL,
  `branch_id` int(11) DEFAULT NULL,
  `price_type` varchar(30) NOT NULL DEFAULT 'service',
  `service_id` int(11) DEFAULT NULL,
  `custom_price` decimal(15,2) NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_doctor_price_overrides_doctor_service` (`doctor_id`,`service_id`),
  KEY `idx_doctor_price_overrides_doctor_id` (`doctor_id`),
  KEY `idx_doctor_price_overrides_service_id` (`service_id`),
  CONSTRAINT `fk_doctor_price_overrides_doctor` FOREIGN KEY (`doctor_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_doctor_price_overrides_service` FOREIGN KEY (`service_id`) REFERENCES `site_prices` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk_doctor_price_overrides_user` FOREIGN KEY (`doctor_id`) REFERENCES `users` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doctor_price_overrides`
--

LOCK TABLES `doctor_price_overrides` WRITE;
/*!40000 ALTER TABLE `doctor_price_overrides` DISABLE KEYS */;
INSERT INTO `doctor_price_overrides` VALUES (2,18,1,'service',1,1300000.00,'2026-08-08 16:41:13','2026-08-23 13:15:18'),(3,13,1,'service',1,1000000.00,'2026-08-08 16:41:38','2026-08-23 13:15:18'),(4,23,1,'design_fee',NULL,120000.00,'2026-08-09 19:17:22','2026-08-23 13:15:18'),(5,26,1,'design_fee',1,160000.00,'2026-08-17 16:43:50','2026-09-01 01:50:00'),(6,26,1,'design_fee',14,60000.00,'2026-08-24 19:19:07','2026-08-26 16:34:25'),(7,26,1,'design_fee',15,80000.00,'2026-08-24 19:19:25','2026-08-26 16:34:25'),(10,13,1,'service',18,1500000.00,'2026-08-26 18:44:04','2026-08-26 18:44:04'),(11,16,1,'service',1,1950000.00,'2026-09-01 01:43:13','2026-09-01 01:43:40');
/*!40000 ALTER TABLE `doctor_price_overrides` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `entity_comments`
--

DROP TABLE IF EXISTS `entity_comments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `entity_comments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `entity_type` varchar(50) NOT NULL,
  `entity_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `message` text NOT NULL,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `idx_entity_comments_entity` (`entity_type`,`entity_id`),
  KEY `idx_entity_comments_user` (`user_id`),
  CONSTRAINT `fk_entity_comments_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `entity_comments`
--

LOCK TABLES `entity_comments` WRITE;
/*!40000 ALTER TABLE `entity_comments` DISABLE KEYS */;
INSERT INTO `entity_comments` VALUES (1,'case',1085,23,'سلام و درود\r\nدندان چسبید و فایل نهایی ارسال شد خدمتتون','2026-08-09 22:04:12','2026-08-09 22:04:12'),(2,'case',1060,23,'سلام و درود\r\nحتما فایل کیس هارو به صورت زیپ ارسال کنید که اینجوری نیاشن و همه 1 فایل باشن ممنون','2026-08-10 16:42:08','2026-08-10 16:42:08'),(3,'case',1098,1,'متصل است.','2026-08-10 18:14:47','2026-08-10 18:14:47'),(4,'case',1110,23,'سلام\r\nکار دندان مقابل ندارد\r\nاحتیاج به طراحی کست هست؟','2026-08-14 13:37:26','2026-08-14 13:37:26'),(8,'case',1101,1,'متصل است','2026-08-15 17:29:11','2026-08-15 17:29:11'),(9,'case',1124,1,'هارمونی با راست مهم است\r\nحتما میرور شود mirror\r\nمتصل است','2026-08-15 19:29:32','2026-08-15 19:29:32'),(10,'case',1123,1,'بایت توی اسکن داخل دهانی درست ثبت نشده بوده ، برای همین دکتر قالبگیری مجدد دستی انجام داده که اون رو هم آپلود کردم. \r\nچون از فک پایین راضی بوده، چسبونده اما فک بالا رو راضی نبوده و گفته مجدد طراحی بشه. \r\ncase_1123_intraoral.zip اسکن اولیه داخل دهانی که بایت اش درست ثبت نشده\r\ncase_1123.zip قالب گیری با آلژینات با بایت صحیح','2026-08-17 12:14:25','2026-08-17 12:14:25'),(11,'case',1115,26,'لطفا مارژین چک شود','2026-08-20 01:44:25','2026-08-20 01:44:25'),(12,'case',1068,1,'این کار رو خود دکتر با اسکنرش اسکن کرده بود. \r\nطراحی کردیم و ساختیم و تحویل دادیم ، و گفت که :\r\nسلام وقت بخیر\r\nاین بیمارو مجدد اسکن کردیم براتون\r\nخواستیم تحویل بدیم مارجین روکش از سمت باکال یک میل کوتاه بود!','2026-08-23 13:22:40','2026-08-23 13:22:40'),(14,'case',1146,26,'اسکن مستقیم از اباتمنت!!','2026-08-25 21:45:49','2026-08-25 21:45:49'),(15,'case',1149,26,'قالب مستقیم از اباتمنت!!','2026-08-27 12:29:32','2026-08-27 12:29:32'),(16,'case',1150,26,'قالب مستقیم از اباتمنت!!','2026-08-27 12:30:10','2026-08-27 12:30:10'),(17,'case',1151,26,'قالب مستقیم از اباتمنت!!','2026-08-27 12:31:07','2026-08-27 12:31:07');
/*!40000 ALTER TABLE `entity_comments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `expense_payments`
--

DROP TABLE IF EXISTS `expense_payments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `expense_payments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `expense_type` varchar(20) NOT NULL,
  `invoice_id` int(11) NOT NULL,
  `party_name` varchar(255) DEFAULT NULL,
  `amount` decimal(15,2) NOT NULL DEFAULT 0.00,
  `payment_method` varchar(50) DEFAULT NULL,
  `payment_date` date DEFAULT NULL,
  `transaction_number` varchar(255) DEFAULT NULL,
  `recipient_bank` varchar(120) DEFAULT NULL,
  `recipient_card` varchar(120) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `expense_type` (`expense_type`,`invoice_id`),
  KEY `branch_id` (`branch_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `expense_payments`
--

LOCK TABLES `expense_payments` WRITE;
/*!40000 ALTER TABLE `expense_payments` DISABLE KEYS */;
INSERT INTO `expense_payments` VALUES (1,1,'designer',1,NULL,1320000.00,'کارت به کارت','2026-08-22',NULL,'ملی','6037998213355463',NULL,'2026-08-26 19:17:43','2026-08-26 19:17:43'),(2,1,'designer',2,NULL,12800000.00,'پل','2026-08-29','050607132522BCG17395','ملی','290570100911515689564001',NULL,'2026-08-29 09:58:47','2026-08-29 09:58:47');
/*!40000 ALTER TABLE `expense_payments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `invoice_items`
--

DROP TABLE IF EXISTS `invoice_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `invoice_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `invoice_id` int(11) NOT NULL,
  `price_id` int(11) DEFAULT NULL,
  `case_id` int(11) DEFAULT NULL,
  `item_title` varchar(255) NOT NULL,
  `item_description` text DEFAULT NULL,
  `patient_name` varchar(255) DEFAULT NULL,
  `quantity` int(11) DEFAULT 1,
  `unit_price` decimal(15,2) DEFAULT 0.00,
  `total_amount` decimal(15,2) DEFAULT 0.00,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `invoice_id` (`invoice_id`),
  KEY `price_id` (`price_id`),
  KEY `idx_invoice_items_case` (`case_id`),
  CONSTRAINT `fk_invoice_items_invoice` FOREIGN KEY (`invoice_id`) REFERENCES `doctor_invoices` (`id`) ON DELETE CASCADE,
  CONSTRAINT `fk_invoice_items_price` FOREIGN KEY (`price_id`) REFERENCES `site_prices` (`id`) ON DELETE SET NULL
) ENGINE=InnoDB AUTO_INCREMENT=483 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `invoice_items`
--

LOCK TABLES `invoice_items` WRITE;
/*!40000 ALTER TABLE `invoice_items` DISABLE KEYS */;
INSERT INTO `invoice_items` VALUES (240,17,1,1021,'روکش زیرکونیا مولتی لیر','(45)','خانوم محمودی',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(241,17,1,1022,'روکش زیرکونیا مولتی لیر','(12,13)','خانوم شکوری',2,1900000.00,3800000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(242,17,1,1023,'روکش زیرکونیا مولتی لیر','(11,12,13,21)','خانوم حیدری',4,1900000.00,7600000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(243,17,1,1026,'روکش زیرکونیا مولتی لیر','(26)','خانوم نعمتنژاد',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(244,17,1,1027,'روکش زیرکونیا مولتی لیر','(27)','خانوم محمودی',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(245,17,1,1028,'روکش زیرکونیا مولتی لیر','(47)','خانوم بالادستیان',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(246,17,1,1029,'روکش زیرکونیا مولتی لیر','(21_11_12_13، 22_23_24_25)','صفدر کاظمی',8,1900000.00,15200000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(247,17,1,1030,'روکش زیرکونیا مولتی لیر','(15_16_17)','آرزو قلیزاده',3,1900000.00,5700000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(248,17,2,1031,'روکش زیرکونیای پایه ایمپلنت','(44_45_46،36)','آقای ربیعی',4,2300000.00,9200000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(249,17,2,1032,'روکش زیرکونیای پایه ایمپلنت','(45_46،35)','خانوم ربیعی',3,2300000.00,6900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(250,17,1,1046,'روکش زیرکونیا مولتی لیر','(14،24،35)','خانوم محمدزاده',3,1900000.00,5700000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(251,17,1,1047,'روکش زیرکونیا مولتی لیر','(16،26،47)','آقای عالیش زاده',3,1900000.00,5700000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(252,17,1,1058,'روکش زیرکونیا مولتی لیر','(27)','خانوم نکودری',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(253,17,1,1059,'روکش زیرکونیا مولتی لیر','(17،35)','آقای قریب زاده',2,1900000.00,3800000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(254,17,1,1060,'روکش زیرکونیا مولتی لیر','(17)','خانم باغبانی',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(255,17,1,1070,'روکش زیرکونیا مولتی لیر','15','خانوم لطیفی',1,1900000.00,1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(256,17,NULL,NULL,'تخفیف','تخفیف','تخفیف اولین همکاری',1,-1900000.00,-1900000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(257,17,NULL,NULL,'تخفیف','تخفیف','تخفیف اعضای خانواده',1,-6000000.00,-6000000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(258,17,1,1071,'روکش زیرکونیا مولتی لیر','12_13،22_23،45،33_34_35','مریم فیضی زاده',8,1900000.00,15200000.00,'2026-07-30 14:31:59','2026-07-30 14:31:59'),(264,19,1,1097,'روکش زیرکونیا مولتی لیر','احمدرضا ربیعی - دندان (24_25)','خانوم لطیفی',2,1300000.00,2600000.00,'2026-08-18 19:40:20','2026-08-18 19:40:20'),(265,19,1,1098,'روکش زیرکونیا مولتی لیر','احمدرضا ربیعی - دندان (15_16)','خانوم داداش زاده',2,1300000.00,2600000.00,'2026-08-18 19:40:20','2026-08-18 19:40:20'),(266,19,1,1089,'روکش زیرکونیا مولتی لیر','مرسلی - دندان (24_25_26،34)','خانوم خلیلی',4,1300000.00,5200000.00,'2026-08-18 19:40:20','2026-08-18 19:40:20'),(267,19,1,1095,'روکش زیرکونیا مولتی لیر','مرسلی - دندان (15)','خانوم گرشاسبی',1,1300000.00,1300000.00,'2026-08-18 19:40:20','2026-08-18 19:40:20'),(268,19,1,1088,'روکش زیرکونیا مولتی لیر','مرسلی - دندان (35_36_37_38)','آقای داوودی',4,1300000.00,5200000.00,'2026-08-18 19:40:20','2026-08-18 19:40:20'),(290,22,1,1025,'روکش زیرکونیا مولتی لیر','(12،44)','حمید مهاجری',2,960000.00,1920000.00,'2026-08-19 14:20:52','2026-08-19 14:20:52'),(291,22,1,1034,'روکش زیرکونیا مولتی لیر','(26)','حمیده حسینپور',1,1200000.00,1200000.00,'2026-08-19 14:20:52','2026-08-19 14:20:53'),(292,22,1,1041,'روکش زیرکونیا مولتی لیر','(15)','زهرا سادات میریعقوبی',1,1200000.00,1200000.00,'2026-08-19 14:20:52','2026-08-19 14:20:53'),(293,22,5,1043,'کاستوم اباتمنت کره ای','(22)','حمیده قربانی',1,1600000.00,1600000.00,'2026-08-19 14:20:52','2026-08-19 14:20:53'),(294,22,2,1044,'روکش زیرکونیای پایه ایمپلنت','(22)','حمیده قربانی',1,1200000.00,1200000.00,'2026-08-19 14:20:52','2026-08-19 14:20:53'),(295,22,1,1045,'روکش زیرکونیا مولتی لیر','(21)','آذرشیخ محمدی',1,1200000.00,1200000.00,'2026-08-19 14:20:52','2026-08-19 14:20:54'),(296,22,1,1049,'روکش زیرکونیا مولتی لیر','(45_46)','زینب موسیقلیزاده',2,1200000.00,2400000.00,'2026-08-19 14:20:52','2026-08-19 14:20:54'),(297,22,1,1048,'روکش زیرکونیا مولتی لیر','(15،16_17)','منصور احمدزاده',3,1200000.00,3600000.00,'2026-08-19 14:20:52','2026-08-19 14:20:54'),(298,22,1,1055,'روکش زیرکونیا مولتی لیر','(15)','مهدی نوراللهی',1,1200000.00,1200000.00,'2026-08-19 14:20:52','2026-08-19 14:20:55'),(299,22,1,1040,'روکش زیرکونیا مولتی لیر','12','رومینا عبدی',1,1200000.00,1200000.00,'2026-08-19 14:20:52','2026-08-19 14:20:55'),(371,26,2,1061,'روکش زیرکونیای پایه ایمپلنت','دندان (45)','آقای تقی زاده',1,2300000.00,2300000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(372,26,1,1062,'روکش زیرکونیا مولتی لیر','دندان (21_22_23_24_25_26_27،11_12_13_14_15)','محمد سرداری',12,1900000.00,22800000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(373,26,2,1063,'روکش زیرکونیای پایه ایمپلنت','دندان (36،25)','آقای آقایی',2,2300000.00,4600000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(374,26,1,1064,'روکش زیرکونیا مولتی لیر','دندان (25،27)','آقای کریمی',2,1900000.00,3800000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(375,26,1,1065,'روکش زیرکونیا مولتی لیر','دندان (13_14_15)','آقای حمزه پور',3,1900000.00,5700000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(376,26,1,1094,'روکش زیرکونیا مولتی لیر','دندان (46)','خانوم مموئی',1,1900000.00,1900000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(377,26,1,1078,'روکش زیرکونیا مولتی لیر','دندان (35)','خانم ابراهیم پور',1,1900000.00,1900000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(378,26,11,1081,'پست NPG','دندان (11،12،21،22)','آقای معظمی',4,1000000.00,4000000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(379,26,11,1082,'پست NPG','دندان (15)','خانوم گرسابی',1,1000000.00,1000000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(380,26,1,1079,'روکش زیرکونیا مولتی لیر','دندان (11_12_13_14_15_16_17،21_22_23_24_25_26_27)','علی اعظمی',14,1900000.00,26600000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(381,26,1,1085,'روکش زیرکونیا مولتی لیر','دندان (32،33_34_35_36)','خانوم حسینی',5,1900000.00,9500000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(382,26,1,1090,'روکش زیرکونیا مولتی لیر','دندان (34)','خانوم فتحی',1,1900000.00,1900000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(383,26,1,1123,'روکش زیرکونیا مولتی لیر','دندان (12_13،22_23)','مریم فیضی زاده',4,0.00,0.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(384,26,1,1106,'روکش زیرکونیا مولتی لیر','دندان (35)','آقای آقایی',1,1900000.00,1900000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(385,26,1,1125,'روکش زیرکونیا مولتی لیر','دندان (15،25)','خانوم فولادی',2,1900000.00,3800000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(386,26,1,1128,'روکش زیرکونیا مولتی لیر','دندان (11_12_21_22)','عماد معظمی',4,1900000.00,7600000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(387,26,1,1134,'روکش زیرکونیا مولتی لیر','دندان (13،27)','آقای پیران',2,1900000.00,3800000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(388,26,1,1135,'روکش زیرکونیا مولتی لیر','دندان (15_16_17)','خانوم لطیفی',3,1900000.00,5700000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(389,26,1,1136,'روکش زیرکونیا مولتی لیر','دندان (15)','آقای محمدی',1,1900000.00,1900000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(390,26,1,1137,'روکش زیرکونیا مولتی لیر','دندان (26،42_43_44_45)','آقای گیلانی',5,1900000.00,9500000.00,'2026-08-26 17:37:23','2026-08-26 17:37:24'),(402,27,1,1066,'روکش زیرکونیا مولتی لیر','(26)','زهرا داوودآبادی',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(403,27,1,1067,'روکش زیرکونیا مولتی لیر','(13،23)','زهرا خانکی',2,1900000.00,3800000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(404,27,1,1068,'روکش زیرکونیا مولتی لیر','(16)','فائزه مقصودی',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(405,27,1,1069,'روکش زیرکونیا مولتی لیر','(45)','سمیرا ایمانی',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(406,27,1,1072,'روکش زیرکونیا مولتی لیر','(15،25)','اکرم جعفرسعیدی',2,1900000.00,3800000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(407,27,1,1086,'روکش زیرکونیا مولتی لیر','(14،24)','علی کریمی',2,1900000.00,3800000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(408,27,1,1104,'روکش زیرکونیا مولتی لیر','(47)','رقیه شکری',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(409,27,7,1109,'روکش موقت PMMA','(43_42_41_31_32_33)','حسن حیدری',6,0.00,0.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(410,27,1,1110,'روکش زیرکونیا مولتی لیر','(16)','شهناز عبدیان',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(411,27,1,1112,'روکش زیرکونیا مولتی لیر','(36،46)','زهرا صالحی',2,1900000.00,3800000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(412,27,1,1124,'روکش زیرکونیا مولتی لیر','(31_32_33)','حبیبه پناهی',3,1900000.00,5700000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(413,27,1,1057,'روکش زیرکونیا مولتی لیر','45','زهرا زنده دل',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(414,27,1,1056,'روکش زیرکونیا مولتی لیر','37','مینا بابایی',1,1900000.00,1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(415,27,1,1042,'روکش زیرکونیا مولتی لیر','14_15','پروین کشاورز',2,1900000.00,3800000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(416,27,NULL,NULL,'تخفیف اولین همکاری','تخفیف اولین همکاری','یک واحد مولتی لیر',1,-1900000.00,-1900000.00,'2026-08-26 17:40:37','2026-08-26 17:40:37'),(436,28,1,1074,'روکش زیرکونیا مولتی لیر','محمد موسی زاده - دندان (11)','مهناز حسینی',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(437,28,1,1075,'روکش زیرکونیا مولتی لیر','محمد موسی زاده - دندان (17)','حسین محمدزاده',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(438,28,1,1076,'روکش زیرکونیا مولتی لیر','محمد موسی زاده - دندان (24)','سعید مالکی',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(439,28,11,1077,'پست NPG','محمد موسی زاده - دندان (25)','اسما سلمانی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(440,28,11,1080,'پست NPG','محمد موسی زاده - دندان (26)','محمد هادی بابایی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(441,28,1,1087,'روکش زیرکونیا مولتی لیر','محمد موسی زاده - دندان (15)','پرویز قره داغی',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(442,28,11,1091,'پست NPG','محمد موسی زاده - دندان (15)','طاهره طهماسبی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(443,28,11,1093,'پست NPG','محمد موسی زاده - دندان (33)','فرشته درویشی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(444,28,11,1096,'پست NPG','محمد موسی زاده - دندان (23)','علی اکبر ابولحسنی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(445,28,11,1138,'پست NPG','محمد موسی زاده - دندان (36)','حنانه ملکپور',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(446,28,11,1139,'پست NPG','محمد موسی زاده - دندان (14)','اسما سلمانی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(447,28,1,1140,'روکش زیرکونیا مولتی لیر','محمد موسی زاده - دندان (46)','حمید طحانیان',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(448,28,1,1073,'روکش زیرکونیا مولتی لیر','مهدی آرزوبخش - دندان (14،15)','زینب رضایی',2,1900000.00,3800000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(449,28,1,1114,'روکش زیرکونیا مولتی لیر','مهدی آرزوبخش - دندان (16،36_37)','حسین ماضی',3,1900000.00,5700000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(450,28,11,1113,'پست NPG','مهدی آرزوبخش - دندان (24)','زهره نورانی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(451,28,1,1142,'روکش زیرکونیا مولتی لیر','مهدی آرزوبخش - دندان (35)','فهیمه کرمی',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(452,28,11,1092,'پست NPG','کاشفی - دندان (12)','حسین ولدخانی',1,1000000.00,1000000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(453,28,1,1115,'روکش زیرکونیا مولتی لیر','کاشفی - دندان (35)','امین بابایی',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(454,28,1,1126,'روکش زیرکونیا مولتی لیر','کاشفی - دندان (46)','نیلوفر زمانی',1,1900000.00,1900000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(455,28,NULL,NULL,'تخفیف قیمت زیرکونیا','تخفیف قیمت زیرکونیا',NULL,13,-100000.00,-1300000.00,'2026-08-26 17:41:58','2026-08-26 17:41:58'),(467,29,1,1083,'روکش زیرکونیا مولتی لیر','(16)','سمیرا عبداللهی',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(468,29,1,1084,'روکش زیرکونیا مولتی لیر','(23،24_25_26)','فرزانه نورمحمدی',4,1200000.00,4800000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(469,29,1,1100,'روکش زیرکونیا مولتی لیر','(45)','فاطمه عبدیپور',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(470,29,1,1101,'روکش زیرکونیا مولتی لیر','(44_45)','نجمه باغبانی',2,1200000.00,2400000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(471,29,1,1102,'روکش زیرکونیا مولتی لیر','(12_21)','مرتضی خدابخشی',2,1200000.00,2400000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(472,29,1,1105,'روکش زیرکونیا مولتی لیر','(36،37)','مجتبی میرزایی',2,1200000.00,2400000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(473,29,1,1111,'روکش زیرکونیا مولتی لیر','(15)','رقیه کشاورز',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(474,29,1,1127,'روکش زیرکونیا مولتی لیر','(25)','محمد رضا کربلایی حسن خانی',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(475,29,1,1129,'روکش زیرکونیا مولتی لیر','(24)','هانیه خلیل نسب',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(476,29,1,1130,'روکش زیرکونیا مولتی لیر','(16)','شهناز حیدری',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(477,29,1,1132,'روکش زیرکونیا مولتی لیر','(13_14_15_16)','حسن توحید نیا',4,1900000.00,7600000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(478,29,1,1038,'روکش زیرکونیا مولتی لیر','15','مهدی اخوی',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(479,29,1,1039,'روکش زیرکونیا مولتی لیر','46','زهرا سادات میریعقوبی',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(480,29,1,1037,'روکش زیرکونیا مولتی لیر','35','مجتبی پولادوند',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(481,29,1,1035,'روکش زیرکونیا مولتی لیر','36','الهام خجسته',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03'),(482,29,1,1036,'روکش زیرکونیا مولتی لیر','35','حمیده حسین پور',1,1200000.00,1200000.00,'2026-08-26 22:45:03','2026-08-26 22:45:03');
/*!40000 ALTER TABLE `invoice_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `lab_price_overrides`
--

DROP TABLE IF EXISTS `lab_price_overrides`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `lab_price_overrides` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `lab_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `custom_price` decimal(15,2) NOT NULL DEFAULT 0.00,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_lab_service` (`lab_id`,`service_id`),
  KEY `idx_lpo_lab` (`lab_id`),
  KEY `idx_lpo_service` (`service_id`),
  CONSTRAINT `fk_lpo_lab` FOREIGN KEY (`lab_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `fk_lpo_service` FOREIGN KEY (`service_id`) REFERENCES `site_prices` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `lab_price_overrides`
--

LOCK TABLES `lab_price_overrides` WRITE;
/*!40000 ALTER TABLE `lab_price_overrides` DISABLE KEYS */;
INSERT INTO `lab_price_overrides` VALUES (1,1,17,11,1100000.00,'2026-09-01 01:43:14','2026-09-01 01:43:40');
/*!40000 ALTER TABLE `lab_price_overrides` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `login_attempts`
--

DROP TABLE IF EXISTS `login_attempts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `login_attempts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ip_address` varchar(45) NOT NULL,
  `attempted_at` datetime NOT NULL DEFAULT current_timestamp(),
  `success` tinyint(4) DEFAULT 0,
  PRIMARY KEY (`id`),
  KEY `idx_login_ip` (`ip_address`),
  KEY `idx_login_time` (`attempted_at`)
) ENGINE=InnoDB AUTO_INCREMENT=250 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `login_attempts`
--

LOCK TABLES `login_attempts` WRITE;
/*!40000 ALTER TABLE `login_attempts` DISABLE KEYS */;
INSERT INTO `login_attempts` VALUES (241,'5.208.238.53','2026-08-31 15:51:09',1),(242,'109.125.167.52','2026-08-31 19:13:30',1),(243,'109.125.167.52','2026-08-31 19:28:45',1),(244,'109.125.167.52','2026-08-31 19:28:55',1),(245,'109.125.167.52','2026-08-31 19:34:34',1),(246,'109.125.167.52','2026-08-31 19:37:13',1),(247,'5.115.82.203','2026-08-31 22:12:18',1),(248,'5.115.82.203','2026-09-01 00:14:25',1),(249,'::1','2026-09-01 01:34:01',1);
/*!40000 ALTER TABLE `login_attempts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `notifications`
--

DROP TABLE IF EXISTS `notifications`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `notifications` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `case_id` int(11) DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `message` text DEFAULT NULL,
  `type` varchar(50) NOT NULL DEFAULT 'info' COMMENT 'info, assignment, status_change',
  `is_read` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `idx_notifications_user` (`user_id`),
  KEY `idx_notifications_unread` (`user_id`,`is_read`),
  KEY `idx_notifications_created` (`created_at`),
  CONSTRAINT `fk_notifications_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=197 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notifications`
--

LOCK TABLES `notifications` WRITE;
/*!40000 ALTER TABLE `notifications` DISABLE KEYS */;
INSERT INTO `notifications` VALUES (1,1,1070,'کیس جدید: خانوم لطیفی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-07-30 12:30:00'),(2,11,1071,'کیس جدید: مریم فیضی زاده','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-07-30 14:31:20'),(3,1,1071,'کیس جدید: مریم فیضی زاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-07-30 14:31:20'),(4,11,1069,'کیس جدید: سمیرا ایمانی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 11:29:46'),(5,11,1072,'کیس جدید: اکرم جعفرسعیدی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 11:31:13'),(6,1,1072,'کیس جدید: اکرم جعفرسعیدی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-01 11:31:13'),(7,11,1073,'کیس جدید: زینب رضایی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 13:03:39'),(8,1,1073,'کیس جدید: زینب رضایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-01 13:03:39'),(9,11,1074,'کیس جدید: مهناز حسینی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 13:05:46'),(10,1,1074,'کیس جدید: مهناز حسینی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-01 13:05:46'),(11,11,1075,'کیس جدید: حسین محمدزاده','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 13:08:02'),(12,1,1075,'کیس جدید: حسین محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-01 13:08:02'),(13,11,1076,'کیس جدید: سعید مالکی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 13:09:32'),(14,1,1076,'کیس جدید: سعید مالکی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-01 13:09:32'),(15,17,1077,'کیس جدید: اسما سلمانی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-01 13:15:39'),(16,1,1078,'کیس جدید: خانم ابراهیم پور','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-03 10:52:58'),(17,1,1079,'کیس جدید: علی اعظمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-03 10:54:15'),(18,17,1080,'کیس جدید: محمد هادی بابایی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-03 10:57:10'),(19,17,1081,'کیس جدید: آقای معظمی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-03 10:58:10'),(20,17,1081,'کیس جدید: آقای معظمی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-03 10:58:21'),(21,17,1082,'کیس جدید: خانوم گرسابی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-03 10:59:05'),(22,1,1084,'کیس جدید: فرزانه نورمحمدی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-03 11:03:48'),(23,11,1075,'کیس جدید: حسین محمدزاده','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-05 00:00:12'),(24,1,1075,'کیس جدید: حسین محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-05 00:00:12'),(25,1,1087,'کیس جدید: پرویز قره داغی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-08 16:39:42'),(26,18,1088,'کیس جدید: آقای داوودی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 16:44:28'),(27,1,1088,'کیس جدید: آقای داوودی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-08 16:44:28'),(28,18,1089,'کیس جدید: خانوم خلیلی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 16:45:48'),(29,18,1089,'کیس جدید: خانوم خلیلی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 16:46:00'),(30,17,1091,'کیس جدید: طاهره طهماسبی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 18:37:33'),(31,17,1092,'کیس جدید: حسین ولدخانی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 18:41:42'),(32,17,1093,'کیس جدید: فرشته درویشی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 18:42:33'),(33,18,1095,'کیس جدید: خانوم گرشاسبی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-08 20:58:02'),(34,1,1095,'کیس جدید: خانوم گرشاسبی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-08 20:58:02'),(35,23,1085,'کیس جدید: خانوم حسینی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 15:24:00'),(36,17,1096,'کیس جدید: علی اکبر ابولحسنی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-09 18:30:26'),(37,17,1096,'کیس جدید: علی اکبر ابولحسنی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-09 18:36:51'),(38,18,1097,'کیس جدید: خانوم لطیفی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-09 19:21:15'),(39,23,1097,'کیس جدید: خانوم لطیفی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:21:15'),(40,18,1098,'کیس جدید: خانوم داداش زاده','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-09 19:24:16'),(41,23,1098,'کیس جدید: خانوم داداش زاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:24:16'),(42,23,1099,'کیس جدید: خانوم محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:31:43'),(43,1,1100,'کیس جدید: فاطمه عبدیپور','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:39:52'),(44,1,1101,'کیس جدید: نجمه باغبانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:41:32'),(45,1,1102,'کیس جدید: مرتضی خدابخشی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:42:38'),(46,1,1103,'کیس جدید: فائزه غنیمت','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 19:44:40'),(47,1,1104,'کیس جدید: رقیه شکری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-09 20:42:45'),(48,3,1085,'کامنت جدید در خانوم حسینی','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: سلام و درود\r\nدندان چسبید و فایل نهایی ارسال شد خدمتتون','comment',0,'2026-08-09 22:04:12'),(49,1,1105,'کیس جدید: مجتبی میرزایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 12:45:19'),(50,23,1102,'کیس جدید: مرتضی خدابخشی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 12:45:39'),(51,23,1106,'کیس جدید: آقای آقایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 12:48:05'),(52,13,1107,'کیس جدید: مهناز باباها','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 14:35:27'),(53,23,1107,'کیس جدید: مهناز باباها','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:35:27'),(54,13,1107,'کیس جدید: مهناز باباها','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 14:36:16'),(55,23,1107,'کیس جدید: مهناز باباها','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:36:16'),(56,13,1108,'کیس جدید: تقی رستمی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 14:44:31'),(57,23,1108,'کیس جدید: تقی رستمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:44:31'),(58,13,1107,'کیس جدید: مهناز باباها','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 14:58:12'),(59,23,1107,'کیس جدید: مهناز باباها','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:58:12'),(60,13,1108,'کیس جدید: تقی رستمی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 14:58:21'),(61,23,1108,'کیس جدید: تقی رستمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:58:21'),(62,23,1106,'کیس جدید: آقای آقایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:58:32'),(63,23,1099,'کیس جدید: خانوم محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 14:58:46'),(64,23,1099,'کیس جدید: خانوم محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 15:07:00'),(65,23,1106,'کیس جدید: آقای آقایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 15:07:08'),(66,23,1106,'کیس جدید: آقای آقایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 15:07:26'),(67,23,1102,'کیس جدید: مرتضی خدابخشی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 15:07:36'),(68,18,1097,'کیس جدید: خانوم لطیفی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 15:07:44'),(69,23,1097,'کیس جدید: خانوم لطیفی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 15:07:44'),(70,11,1060,'کیس جدید: خانم باغبانی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-10 15:30:53'),(71,23,1060,'کیس جدید: خانم باغبانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 15:30:53'),(72,3,1060,'کامنت جدید در خانم باغبانی','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: سلام و درود\r\nحتما فایل کیس هارو به صورت زیپ ارسال کنید که اینجوری نیاشن و همه 1 ...','comment',0,'2026-08-10 16:42:08'),(73,11,1060,'کامنت جدید در خانم باغبانی','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: سلام و درود\r\nحتما فایل کیس هارو به صورت زیپ ارسال کنید که اینجوری نیاشن و همه 1 ...','comment',0,'2026-08-10 16:42:08'),(74,3,1098,'کامنت جدید در خانوم داداش زاده','مدیر سایت یک پیام جدید در این کیس ثبت کرد: متصل است.','comment',0,'2026-08-10 18:14:47'),(75,23,1098,'کامنت جدید در خانوم داداش زاده','مدیر سایت یک پیام جدید در این کیس ثبت کرد: متصل است.','comment',1,'2026-08-10 18:14:48'),(76,18,1098,'کامنت جدید در خانوم داداش زاده','مدیر سایت یک پیام جدید در این کیس ثبت کرد: متصل است.','comment',0,'2026-08-10 18:14:48'),(77,23,1109,'کیس جدید: حسن حیدری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 18:40:16'),(78,23,1110,'کیس جدید: شهناز عبدیان','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-10 19:24:37'),(79,23,1111,'کیس جدید: رقیه کشاورز','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-11 01:38:47'),(80,23,1101,'کیس جدید: نجمه باغبانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-14 13:27:13'),(81,23,1112,'کیس جدید: زهرا صالحی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-14 13:32:19'),(82,12,1110,'کامنت جدید در شهناز عبدیان','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: سلام\r\nکار دندان مقابل ندارد\r\nاحتیاج به طراحی کست هست؟','comment',0,'2026-08-14 13:37:26'),(83,2,1102,'کامنت جدید در مرتضی خدابخشی','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: تلگرام\r\n چک شود جهت فاینال کردن طراحی','comment',0,'2026-08-14 13:52:38'),(84,2,1101,'کامنت جدید در نجمه باغبانی','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: دو واحد کارشون جداست یا متصل؟','comment',0,'2026-08-14 21:17:30'),(85,17,1113,'کیس جدید: زهره نورانی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 10:59:32'),(86,23,1114,'کیس جدید: حسین ماضی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 11:05:50'),(87,13,1116,'کیس جدید: مهدیس خلیلی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:01:58'),(88,23,1116,'کیس جدید: مهدیس خلیلی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 12:01:58'),(89,13,1117,'کیس جدید: فاطمه مظفری','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:13:33'),(90,23,1117,'کیس جدید: فاطمه مظفری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 12:13:33'),(91,23,1115,'کیس جدید: امین بابایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 12:17:51'),(92,13,1118,'کیس جدید: علیرضا صنعتی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:26:50'),(93,13,1119,'کیس جدید: مهین جلیلوند','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:28:12'),(94,13,1120,'کیس جدید: مهدی بابا','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:28:57'),(95,13,1121,'کیس جدید: شقایق شیرمحمدی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:30:43'),(96,13,1122,'کیس جدید: فاطمه صفری','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-15 12:31:35'),(97,23,1111,'کیس جدید: رقیه کشاورز','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 12:33:11'),(98,23,1123,'کیس جدید: مریم فیضی زاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 14:44:13'),(99,23,1090,'کیس جدید: خانوم فتحی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 14:53:58'),(100,23,1078,'کیس جدید: خانم ابراهیم پور','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 14:55:48'),(101,25,1099,'کامنت جدید در خانوم محمدزاده','امید میرجوادی یک پیام جدید در این کیس ثبت کرد: 3 ها ارتفاعی متفاوت هستند ببینید کدوم مورد تاییده متناسب با اون ساخته بشه چون سم...','comment',0,'2026-08-15 15:03:49'),(102,2,1101,'کامنت جدید در نجمه باغبانی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: متصل است','comment',0,'2026-08-15 17:29:11'),(103,23,1101,'کامنت جدید در نجمه باغبانی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: متصل است','comment',0,'2026-08-15 17:29:11'),(104,23,1124,'کیس جدید: حبیبه پناهی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 18:11:57'),(105,12,1124,'کامنت جدید در حبیبه پناهی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: هارمونی با راست مهم است\r\nحتما میرور شود mirror\r\nمتصل است','comment',0,'2026-08-15 19:29:32'),(106,23,1124,'کامنت جدید در حبیبه پناهی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: هارمونی با راست مهم است\r\nحتما میرور شود mirror\r\nمتصل است','comment',0,'2026-08-15 19:29:32'),(107,23,1125,'کیس جدید: خانوم فولادی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-15 21:01:43'),(108,1,1078,'کیس جدید: خانم ابراهیم پور','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-16 13:55:54'),(109,3,1123,'کامنت جدید در مریم فیضی زاده','مدیر سایت یک پیام جدید در این کیس ثبت کرد: بایت توی اسکن داخل دهانی درست ثبت نشده بوده ، برای همین دکتر قالبگیری مجدد دستی ...','comment',0,'2026-08-17 12:14:25'),(110,1,1129,'کیس جدید: هانیه خلیل نسب','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-17 16:19:31'),(111,26,1128,'کیس جدید: عماد معظمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-17 16:47:14'),(112,1,1101,'کیس جدید: نجمه باغبانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-17 22:20:59'),(113,26,1131,'کیس جدید: خانم ملکی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-18 14:23:47'),(114,26,1102,'کیس جدید: مرتضی خدابخشی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-19 10:55:44'),(115,26,1132,'کیس جدید: حسن توحید نیا','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-19 16:27:49'),(116,22,1115,'کامنت جدید در امین بابایی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: لطفا مارژین چک شود','comment',0,'2026-08-20 01:44:25'),(117,26,1133,'کیس جدید: خانوم بیگدلی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 11:59:49'),(118,26,1134,'کیس جدید: آقای پیران','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:02:17'),(119,26,1135,'کیس جدید: خانوم لطیفی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:09:32'),(120,26,1136,'کیس جدید: خانوم محمدی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:11:35'),(121,26,1136,'کیس جدید: خانوم محمدی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:12:38'),(122,26,1137,'کیس جدید: آقای گیلانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:15:35'),(123,26,1136,'کیس جدید: آقای محمدی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:18:24'),(124,26,1136,'کیس جدید: آقای محمدی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:18:52'),(125,26,1137,'کیس جدید: آقای گیلانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:20:44'),(126,26,1099,'کیس جدید: خانوم محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:55:35'),(127,26,1099,'کیس جدید: خانوم محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 12:56:13'),(128,17,1138,'کیس جدید: حنانه ملکپور','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 13:15:19'),(129,17,1139,'کیس جدید: اسما سلمانی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 13:43:04'),(130,17,1138,'کیس جدید: حنانه ملکپور','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 13:43:36'),(131,26,1140,'کیس جدید: حمید طحانیان','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 13:56:30'),(132,13,1141,'کیس جدید: اکرم قدیری','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 14:17:54'),(133,26,1141,'کیس جدید: اکرم قدیری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 14:17:54'),(134,26,1142,'کیس جدید: فهیمه کرمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 14:18:54'),(135,26,1140,'کیس جدید: حمید طحانیان','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 14:19:17'),(136,13,1143,'کیس جدید: سعید ولیه','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 14:41:21'),(137,26,1143,'کیس جدید: سعید ولیه','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 14:41:21'),(138,13,1144,'کیس جدید: پروانه کشاورز','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 14:44:39'),(139,26,1144,'کیس جدید: پروانه کشاورز','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 14:44:39'),(140,13,1145,'کیس جدید: سمیه رضی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 16:58:40'),(141,26,1145,'کیس جدید: سمیه رضی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 16:58:40'),(142,13,1146,'کیس جدید: علی آقایی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 17:16:04'),(143,26,1146,'کیس جدید: علی آقایی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 17:16:04'),(144,13,1141,'کیس جدید: اکرم قدیری','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 18:26:04'),(145,26,1141,'کیس جدید: اکرم قدیری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 18:26:04'),(146,13,1141,'کیس جدید: اکرم قدیری','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-22 19:13:05'),(147,26,1141,'کیس جدید: اکرم قدیری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-22 19:13:05'),(148,12,1068,'کامنت جدید در فائزه مقصودی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: این کار رو خود دکتر با اسکنرش اسکن کرده بود. \r\nطراحی کردیم و ساختیم و تحویل دادی...','comment',0,'2026-08-23 13:22:40'),(149,26,1068,'کامنت جدید در فائزه مقصودی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: این کار رو خود دکتر با اسکنرش اسکن کرده بود. \r\nطراحی کردیم و ساختیم و تحویل دادی...','comment',1,'2026-08-23 13:22:40'),(150,11,1068,'کامنت جدید در فائزه مقصودی','مدیر سایت یک پیام جدید در این کیس ثبت کرد: این کار رو خود دکتر با اسکنرش اسکن کرده بود. \r\nطراحی کردیم و ساختیم و تحویل دادی...','comment',0,'2026-08-23 13:22:40'),(151,26,1147,'کیس جدید: زهرا عین الله زاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-23 17:01:30'),(152,26,1131,'کیس جدید: خانم ملکی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 13:23:53'),(153,26,1123,'کیس جدید: مریم فیضی زاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 13:24:44'),(154,26,1099,'کیس جدید: خانوم محمدزاده','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 13:25:32'),(155,1,1112,'کیس جدید: زهرا صالحی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 13:26:03'),(156,23,1110,'کیس جدید: شهناز عبدیان','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-24 13:27:04'),(157,26,1148,'کیس جدید: مرضیه نوراللهی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 18:50:09'),(158,18,1149,'کیس جدید: آقای شهریار','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-24 19:10:44'),(159,26,1149,'کیس جدید: آقای شهریار','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 19:10:44'),(160,18,1150,'کیس جدید: آقای شهریار','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-24 19:21:54'),(161,26,1150,'کیس جدید: آقای شهریار','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 19:21:54'),(162,18,1151,'کیس جدید: خانوم دلیمی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-24 19:24:13'),(163,26,1151,'کیس جدید: خانوم دلیمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 19:24:13'),(164,26,1152,'کیس جدید: زهرا افکاریان','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 19:43:47'),(165,1,1153,'کیس جدید: حدیث مرخانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-24 21:56:51'),(166,1,1154,'کیس جدید: حدیث میرخانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-25 00:53:30'),(167,1,1153,'کیس جدید: میرخانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-25 00:54:00'),(168,1,1153,'کیس جدید: حدیث میرخانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-25 00:54:21'),(169,1,1155,'کیس جدید: داود حسینی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-25 01:04:34'),(170,26,1148,'کیس جدید: مرضیه نوراللهی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-25 16:27:56'),(171,1,1148,'کیس جدید: مرضیه نوراللهی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-25 17:03:03'),(172,21,1145,'کامنت جدید در سمیه رضی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: اسکن مستقیم از اباتمنت!!','comment',0,'2026-08-25 21:45:28'),(173,13,1145,'کامنت جدید در سمیه رضی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: اسکن مستقیم از اباتمنت!!','comment',0,'2026-08-25 21:45:28'),(174,21,1146,'کامنت جدید در علی آقایی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: اسکن مستقیم از اباتمنت!!','comment',0,'2026-08-25 21:45:49'),(175,13,1146,'کامنت جدید در علی آقایی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: اسکن مستقیم از اباتمنت!!','comment',0,'2026-08-25 21:45:49'),(176,26,1157,'کیس جدید: حسین ولدخانی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 18:24:32'),(177,26,1158,'کیس جدید: لیلی کاظمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 18:30:23'),(178,26,1159,'کیس جدید: علیرضا آتشین','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 18:36:51'),(179,26,1160,'کیس جدید: لیلی کاظمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 18:51:56'),(180,26,1158,'کیس جدید: لیلی کاظمی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 21:25:11'),(181,26,1161,'کیس جدید: فرشته درویشی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 22:53:28'),(182,26,1162,'کیس جدید: خانوم سیفی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-26 22:54:19'),(183,17,1163,'کیس جدید: خانوم سیفی','یک کیس جدید برای شما به عنوان لابراتوار ثبت شده است.','assignment',0,'2026-08-26 23:05:41'),(184,3,1149,'کامنت جدید در آقای شهریار','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: قالب مستقیم از اباتمنت!!','comment',0,'2026-08-27 12:29:32'),(185,18,1149,'کامنت جدید در آقای شهریار','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: قالب مستقیم از اباتمنت!!','comment',0,'2026-08-27 12:29:32'),(186,3,1150,'کامنت جدید در آقای شهریار','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: قالب مستقیم از اباتمنت!!','comment',0,'2026-08-27 12:30:10'),(187,18,1150,'کامنت جدید در آقای شهریار','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: قالب مستقیم از اباتمنت!!','comment',0,'2026-08-27 12:30:10'),(188,3,1151,'کامنت جدید در خانوم دلیمی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: قالب مستقیم از اباتمنت!!','comment',0,'2026-08-27 12:31:07'),(189,18,1151,'کامنت جدید در خانوم دلیمی','محمد علی یگانه یک پیام جدید در این کیس ثبت کرد: قالب مستقیم از اباتمنت!!','comment',0,'2026-08-27 12:31:07'),(190,26,1164,'کیس جدید: لعیا کنکاوی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-29 13:36:15'),(191,26,1165,'کیس جدید: مریم کنکاوی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-29 13:49:31'),(192,26,1166,'کیس جدید: آقای سخاوت','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-29 14:01:42'),(193,26,1166,'کیس جدید: آقای سخاوت','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-29 17:43:19'),(194,26,1165,'کیس جدید: مریم کنکاوی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',1,'2026-08-29 19:02:29'),(195,26,1167,'کیس جدید: مریم لجلی','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-31 15:53:00'),(196,26,1168,'کیس جدید: یعقوب تشکری','یک کیس جدید برای شما به عنوان طراح ثبت شده است.','assignment',0,'2026-08-31 16:37:48');
/*!40000 ALTER TABLE `notifications` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `outsource_invoice_items`
--

DROP TABLE IF EXISTS `outsource_invoice_items`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `outsource_invoice_items` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `invoice_id` int(11) NOT NULL,
  `case_id` int(11) DEFAULT NULL,
  `doctor_id` int(11) DEFAULT NULL,
  `doctor_name` varchar(191) DEFAULT NULL,
  `service_id` int(11) DEFAULT NULL,
  `service_title` varchar(191) DEFAULT NULL,
  `patient_name` varchar(191) DEFAULT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `unit_rate` decimal(15,2) NOT NULL DEFAULT 0.00,
  `total_amount` decimal(15,2) NOT NULL DEFAULT 0.00,
  `received_date` date DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `invoice_id` (`invoice_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `outsource_invoice_items`
--

LOCK TABLES `outsource_invoice_items` WRITE;
/*!40000 ALTER TABLE `outsource_invoice_items` DISABLE KEYS */;
/*!40000 ALTER TABLE `outsource_invoice_items` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `outsource_invoices`
--

DROP TABLE IF EXISTS `outsource_invoices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `outsource_invoices` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `invoice_number` varchar(50) NOT NULL,
  `lab_id` int(11) NOT NULL,
  `total_amount` decimal(15,2) NOT NULL DEFAULT 0.00,
  `payment_status` enum('unpaid','partial','paid') NOT NULL DEFAULT 'unpaid',
  `period_label` varchar(120) DEFAULT NULL,
  `invoice_date` date NOT NULL,
  `notes` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `lab_id` (`lab_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `outsource_invoices`
--

LOCK TABLES `outsource_invoices` WRITE;
/*!40000 ALTER TABLE `outsource_invoices` DISABLE KEYS */;
/*!40000 ALTER TABLE `outsource_invoices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `outsource_rates`
--

DROP TABLE IF EXISTS `outsource_rates`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `outsource_rates` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `lab_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `rate` decimal(15,2) NOT NULL DEFAULT 0.00,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `lab_id` (`lab_id`,`service_id`,`branch_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `outsource_rates`
--

LOCK TABLES `outsource_rates` WRITE;
/*!40000 ALTER TABLE `outsource_rates` DISABLE KEYS */;
INSERT INTO `outsource_rates` VALUES (1,1,17,11,1000000.00,'2026-08-15 17:28:23','2026-08-31 22:18:43'),(2,1,13,12,250000.00,'2026-08-15 17:30:35','2026-08-23 09:45:36'),(3,1,13,13,250000.00,'2026-08-15 17:30:42','2026-08-23 09:45:36'),(4,NULL,27,1,1000000.00,'2026-08-28 09:53:41','2026-08-28 09:53:41');
/*!40000 ALTER TABLE `outsource_rates` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `portfolio_works`
--

DROP TABLE IF EXISTS `portfolio_works`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `portfolio_works` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `image_filename` varchar(255) NOT NULL,
  `active` tinyint(1) DEFAULT 1,
  `display_order` int(11) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `image_filename` (`image_filename`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `portfolio_works`
--

LOCK TABLES `portfolio_works` WRITE;
/*!40000 ALTER TABLE `portfolio_works` DISABLE KEYS */;
INSERT INTO `portfolio_works` VALUES (2,'لمینیت 1','کیس لمینیت زیرکونیا پودر ایمکس','work_6a1d9b7fe92d1.jpg',1,0,'2026-06-01 18:17:27','2026-06-01 18:38:55'),(3,'لمینیت 2_1','کیس لمینیت زیرکونیا پودر ایمکس','work_6a1da04208be8.jpg',1,0,'2026-06-01 18:37:46','2026-06-01 18:39:03'),(4,'لمینیت 2_2','کیس لمینیت زیرکونیا پودر ایمکس','work_6a1da060c9b01.jpg',1,0,'2026-06-01 18:38:16','2026-06-01 18:38:16'),(5,'لمینیت 3','کیس لمینیت زیرکونیا پودر ایمکس','work_6a1da0a5cb5a9.jpg',1,0,'2026-06-01 18:39:25','2026-06-01 18:39:25'),(6,'لمینیت 4','کیس لمینیت زیرکونیا پودر ایمکس','work_6a1da0bb64734.jpg',1,1,'2026-06-01 18:39:47','2026-06-01 18:39:54'),(7,'لمینیت 5','کیس لمینیت زیرکونیا پودر ایمکس','work_6a1da0e6880e7.jpg',1,0,'2026-06-01 18:40:30','2026-06-01 18:40:30'),(8,'ترکیبی لمینیت و زیرکونیا','کیس ترکیبی لمینیت زیرکونیا پودر ایمکس و ایمپلنت و اباتمنت اختصاصی','work_6a1da11bd1ae5.jpg',1,0,'2026-06-01 18:41:23','2026-06-01 18:41:23');
/*!40000 ALTER TABLE `portfolio_works` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `price_links`
--

DROP TABLE IF EXISTS `price_links`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `price_links` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `service_id` int(11) DEFAULT NULL,
  `provider_type` enum('branch','lab','doctor','designer') NOT NULL,
  `provider_id` int(11) NOT NULL,
  `receiver_type` enum('branch','lab','doctor','designer') NOT NULL,
  `receiver_id` int(11) DEFAULT NULL,
  `price` decimal(15,2) NOT NULL DEFAULT 0.00,
  `price_type` enum('general','specific','outsource','design_fee','branch_default') NOT NULL DEFAULT 'general',
  `branch_id` int(11) DEFAULT NULL,
  `note` varchar(255) DEFAULT NULL,
  `active` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `service_id` (`service_id`),
  KEY `provider_type` (`provider_type`,`provider_id`),
  KEY `receiver_type` (`receiver_type`,`receiver_id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `price_links`
--

LOCK TABLES `price_links` WRITE;
/*!40000 ALTER TABLE `price_links` DISABLE KEYS */;
INSERT INTO `price_links` VALUES (1,NULL,'designer',23,'branch',1,120000.00,'design_fee',1,'نرخ طراحی — پرداخت توسط شعبه اصلی',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(2,1,'designer',26,'branch',1,160000.00,'design_fee',1,'نرخ طراحی — پرداخت توسط شعبه اصلی',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(3,14,'designer',26,'branch',1,60000.00,'design_fee',1,'نرخ طراحی — پرداخت توسط شعبه اصلی',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(4,15,'designer',26,'branch',1,80000.00,'design_fee',1,'نرخ طراحی — پرداخت توسط شعبه اصلی',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(5,12,'branch',2,'branch',1,250000.00,'outsource',1,'برون‌سپاری جانبی به شعبه قزوین (پرینت کست فک کامل)',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(6,13,'branch',2,'branch',1,250000.00,'outsource',1,'برون‌سپاری جانبی به شعبه قزوین (پرینت کست نیم فک)',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(7,18,'branch',2,'branch',1,1500000.00,'outsource',1,'برون‌سپاری جانبی به شعبه قزوین (لیرینگ روی فریم)',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(8,11,'lab',17,'branch',1,1000000.00,'outsource',1,'برون‌سپاری به لابراتوار ساجدی (پست NPG)',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(9,1,'branch',1,'branch',2,1000000.00,'outsource',NULL,'نرخ بین‌شعبه‌ای: قزوین → شعبه اصلی (روکش زیرکونیا مولتی لیر)',1,'2026-08-31 21:57:38','2026-08-31 21:57:38'),(10,1,'branch',1,'lab',18,1300000.00,'specific',1,'قیمت اختصاصی: لابراتوار امین به شعبه اصلی (کیس لابراتوار همکار)',1,'2026-08-31 21:57:38','2026-08-31 21:57:38');
/*!40000 ALTER TABLE `price_links` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `roles`
--

DROP TABLE IF EXISTS `roles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `roles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `label` varchar(100) NOT NULL,
  `permissions` text DEFAULT NULL COMMENT 'JSON array of permission keys',
  `created_at` datetime NOT NULL DEFAULT current_timestamp(),
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_roles_name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `roles`
--

LOCK TABLES `roles` WRITE;
/*!40000 ALTER TABLE `roles` DISABLE KEYS */;
INSERT INTO `roles` VALUES (1,'admin','مدیر سیستم','[\"*\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(2,'doctor','دندانپزشک','[\"view_own_cases\", \"view_own_invoices\", \"view_own_payments\", \"view_case_files\", \"create_cases\"]','2026-07-22 01:23:41','2026-08-10 11:28:17'),(3,'staff','کارمند','[\"view_all_cases\",\"create_cases\",\"edit_cases\",\"edit_case_status\",\"upload_files\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(4,'secretary','منشی','[\"view_all_cases\",\"create_cases\",\"edit_cases\",\"edit_case_status\",\"upload_files\",\"delete_files\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(5,'designer','طراح','[\"view_assigned_cases\",\"upload_design_files\",\"edit_case_status\",\"view_own_invoices\",\"view_own_payments\"]','2026-07-22 01:23:41','2026-09-01 00:51:14'),(6,'technician','تکنیسین','[\"view_all_cases\",\"view_own_cases\",\"view_assigned_cases\",\"create_cases\",\"edit_cases\",\"edit_case_status\",\"update_case_status\",\"upload_files\",\"upload_design_files\",\"view_case_files\",\"view_invoices\",\"batch_print_labels\",\"batch_update_status\",\"export_csv\"]','2026-07-22 01:23:41','2026-08-09 19:09:58'),(7,'operator','اپراتور دستگاه','[\"view_all_cases\",\"update_case_status\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(8,'powder','پودرگذار','[\"view_all_cases\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(9,'courier','پیک','[\"view_all_cases\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(10,'finance','امور مالی','[\"view_all_cases\",\"view_invoices\",\"view_payments\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(11,'outsource_lab','لابراتوار برونسپاری','[\"view_assigned_cases\",\"view_case_files\",\"view_own_invoices\",\"view_own_payments\"]','2026-07-22 01:23:41','2026-09-01 00:51:14'),(12,'customer_lab','لابراتوار مشتری','[\"view_assigned_cases\",\"view_case_files\",\"view_own_invoices\",\"view_own_payments\"]','2026-07-22 01:23:41','2026-09-01 00:51:14'),(13,'partner_lab','لابراتوار همکار','[\"view_assigned_cases\",\"view_case_files\",\"view_own_invoices\",\"view_own_payments\"]','2026-07-22 01:23:41','2026-09-01 00:51:14'),(14,'clinic','کلینیک','[\"view_clinic_cases\",\"view_clinic_invoices\",\"view_clinic_payments\",\"view_case_files\"]','2026-07-22 01:23:41','2026-07-22 01:23:41'),(15,'branch_admin','مدیر شعبه','[\"*\"]','2026-08-23 13:15:26','2026-08-23 13:15:26');
/*!40000 ALTER TABLE `roles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `site_prices`
--

DROP TABLE IF EXISTS `site_prices`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `site_prices` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `branch_id` int(11) DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `price` decimal(15,2) NOT NULL DEFAULT 0.00,
  `category` varchar(120) DEFAULT 'عمومی',
  `active` tinyint(1) DEFAULT 1,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `display_order` int(11) DEFAULT 0,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `site_prices`
--

LOCK TABLES `site_prices` WRITE;
/*!40000 ALTER TABLE `site_prices` DISABLE KEYS */;
INSERT INTO `site_prices` VALUES (1,1,'روکش زیرکونیا مولتی لیر','روکش زیرکونیای فول آناتومیک مولتی لیر با طراحی دیجیتال CAD/CAM',1900000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',1),(2,1,'روکش زیرکونیای پایه ایمپلنت','روکش زیرکونیای ایمپلنتی با طراحی دیجیتال و ساخت دقیق',2300000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',2),(3,1,'لمینیت ای-مکس','لمینیت سرامیکی با طراحی دیجیتال و لایه گذاری دستی',5500000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',3),(4,1,'مریلند بریج زیرکونیا','بریج مریلند زیرکونیایی با طراحی دیجیتال',2400000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',4),(5,1,'کاستوم اباتمنت کره ای','Custom Abutment سازگار با سیستم های کره ای',2000000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',5),(6,1,'کاستوم اباتمنت اروپایی','Custom Abutment سازگار با سیستم های اروپایی و Narrow',2300000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',6),(7,1,'روکش موقت PMMA','روکش موقت CAD/CAM از جنس PMMA',1100000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',7),(8,1,'نایت گارد سخت','Hard Night Guard طراحی و ساخته شده به روش دیجیتال',2000000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',9),(9,1,'نایت گارد نرم','Soft Night Guard با ساخت دیجیتال',1800000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',8),(10,1,'تری بلیچینگ','Bleaching Tray سفارشی بر اساس اسکن داخل دهانی',1500000.00,'دندانپزشک',1,'2026-06-01 17:34:09','2026-08-23 13:15:18',10),(11,1,'پست NPG','پست از جنس NPG',1000000.00,'عمومی',1,'2026-08-01 13:12:46','2026-08-23 13:15:18',0),(12,1,'پرینت کست یک فک کامل','پرینت کست یک فک کامل با رزین استاندارد',900000.00,'عمومی',1,'2026-08-15 20:58:59','2026-08-23 13:15:18',0),(13,1,'پرینت کست یک نیم فک','پرینت کست یک نیم فک با رزین استاندارد',700000.00,'عمومی',1,'2026-08-15 20:59:30','2026-08-23 13:15:18',0),(14,1,'فریم زیرکونیا روی دندان','HT استفاده میشود.',460000.00,'عمومی',1,'2026-08-24 18:56:19','2026-08-26 16:34:25',0),(15,1,'فریم زیرکونیا روی اباتمنت','HT - در صورت نیاز رنگ آمیزی میشود.',500000.00,'عمومی',1,'2026-08-24 19:18:33','2026-08-26 16:34:25',0),(16,1,'طرح درمان الاینر شفاف','طرح درمان ارتودنسی با الاینر شفاف، توسط همکار دندانپزشک\r\nیک بار برای هر فک محسابه شده و مجزا از خود الاینر می باشد.',6000000.00,'دندانپزشک',1,'2026-08-24 21:53:57','2026-08-26 16:34:25',0),(17,1,'الاینر شفاف','هر عدد الاینر شفاف',1200000.00,'دندانپزشک',1,'2026-08-24 21:55:29','2026-08-26 16:34:25',0),(18,NULL,'لیرینگ روی فریم زیرکونیا','لیرینگ لبه شفاف روی فریم زیرکونیا - معمولا پودر نوریتاکه \r\nزمان تحویل بالا میباشد.',3000000.00,'عمومی',1,'2026-08-26 18:40:26','2026-08-26 18:40:26',0);
/*!40000 ALTER TABLE `site_prices` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_uploads`
--

DROP TABLE IF EXISTS `user_uploads`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `user_uploads` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `branch_id` int(11) DEFAULT NULL,
  `case_id` int(11) DEFAULT NULL,
  `filename` varchar(255) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `mime` varchar(100) DEFAULT NULL,
  `size` int(11) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`),
  KEY `case_id` (`case_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_uploads`
--

LOCK TABLES `user_uploads` WRITE;
/*!40000 ALTER TABLE `user_uploads` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_uploads` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(100) NOT NULL,
  `password_hash` varchar(255) NOT NULL,
  `full_name` varchar(255) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(20) DEFAULT NULL,
  `role` enum('admin','doctor','staff','secretary','designer','technician','operator','powder','courier','finance','outsource_lab','customer_lab','partner_lab','clinic','branch_admin') NOT NULL DEFAULT 'staff',
  `branch_id` int(11) DEFAULT NULL,
  `clinic_id` int(11) DEFAULT NULL,
  `lab_id` int(11) DEFAULT NULL,
  `is_designer` tinyint(1) NOT NULL DEFAULT 0,
  `is_default_designer` tinyint(1) NOT NULL DEFAULT 0,
  `active` tinyint(1) DEFAULT 1,
  `last_login` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `notes` text DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`),
  KEY `idx_users_clinic_id` (`clinic_id`),
  KEY `idx_users_is_designer` (`is_designer`),
  CONSTRAINT `fk_users_clinic` FOREIGN KEY (`clinic_id`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','$2y$12$Qs8SyaEtzenAYp7NHeMFi.q0algCQ7p1TzObGBD1mJXaQZutY5uT6','مدیر سایت','admin@exolab.ir','09120889892','admin',1,NULL,NULL,1,0,1,'2026-09-01 01:34:01','2026-07-05 02:07:35','2026-09-01 01:34:01',NULL),(2,'hoseinizahra70@gmail.com','$2y$10$p4dN00EmPCn5CxD4vBxsdeyaZ.UdgSFtYzmws7ZpbtSjrrb/YloRO','زهرا حسینی','hoseinizahra70@gmail.com','09127727903','doctor',1,NULL,NULL,0,0,1,'2026-08-10 18:33:30','2026-06-07 15:19:10','2026-08-23 13:15:36',NULL),(3,'Rabiei@exolab.ir','$2y$10$nWIbCJ9ij9k8JZI9oV1Gru4jabucwElt04mgmvodHb2WK6g6ZSdma','احمدرضا ربیعی','Dr_Rabiei@exolab.ir','09129351238','doctor',1,NULL,NULL,0,0,1,NULL,'2026-07-03 15:54:42','2026-08-23 13:15:36','تو کارهای قالب \r\nfrom morgin = 0\r\ncement gap = .2\r\nradial and axial gap = .1\r\nتوی کارهایی که با اسکنر داخل دهانی تهیه شدن :\r\nfrom morgin = 0.2\r\ncement gap = .08\r\nradial and axial gap = .1\r\nهمه جاهایی که آندرکات دارن باید با دادن گپ اضافی، پوشش داده بشن.\r\nکانتکت ها جوری بسته بشه که گیر غذایی بوجود نیاد.\r\nپونتیک ها یک میلیمتر زیر لثه کار شود\r\nآناتومی ترجیحا Generic و یا smoothed generic \r\nدر مواردی که حباب داخل قالب بود یا بزاق و مواردی در کست یا اسکن بود، به نحوی طراحی بکنید که اولویت اول ، سهولت و سرعت بالای تحویل کار توسط پزشک باشه. (شل بشه روکش بهتر از اینه که زمان دکتر گرفته بشه)'),(10,'dr_sahar_mohebbi@exolab.ir','$2y$10$ZAjM1NIufwHztpQP9gSKi.J8rYr8ZwdqNdECmXV7QfZfGEU4pcSh2','سحر محبی','dr_sahar_mohebbi@exolab.ir','09120993858','doctor',1,NULL,NULL,0,0,1,NULL,'2026-07-08 15:40:51','2026-08-23 13:15:36','درمانگاه ایمانعلیزاده قائمیه _ خانم خوش نظر'),(11,'tehrandent','$2y$10$WSRRWPcgIERZHIlPpShSVehu721K2KVnRHbQKJfCQwnoGH8RtxGZ6','تهران دنت','tehrandent@exolab.ir','09056188565','outsource_lab',NULL,NULL,NULL,0,0,0,NULL,'2026-07-10 16:16:20','2026-08-26 22:39:46',NULL),(12,'Dr_pouya@exolab.ir','$2y$12$5BFU7MSQePQ3jM/DN5rf9eC73CkNTAwQSDSu8TItjaWvruqd.qING','میلاد پوریا','Dr_pouya@exolab.ir','09128338892','doctor',1,NULL,NULL,0,0,1,'2026-08-11 09:47:11','2026-07-15 01:44:29','2026-08-23 13:15:36','اسکنر اش شاینینگ 3 هستش\r\nشکل اسکن شاید یکم گمراه کننده باشه. بهتره از راهنمای موقعیتی که اگزوکد موقع انتخاب مارجین میاره استفاده کنی.\r\nسمنت گپ یک دهم میلیمتر'),(13,'fatabjikhala','$2y$12$qm7i0furrXfBZC.M8M99WO7W9wuKU/6sfaLc0G8rKDDAxmyppx4NO','فاطمه حسینی','fatabjikhala@exolab.ir','09120678199','branch_admin',2,NULL,NULL,0,0,1,'2026-08-29 12:40:51','2026-07-21 13:05:54','2026-08-29 12:40:51',NULL),(14,'CLINIC_Arezoubakhsh','$2y$12$nOQgQNVWz1XJTxRVqH3NmeiZ7YmXsv5ezazgdNcO7j8Zo6qlqHgbm','کلینیک مهدی آرزوبخش','CLINIC_Arezoubakhsh@exolab.ir','09124979760','clinic',NULL,NULL,NULL,0,0,1,NULL,'2026-08-01 11:36:42','2026-08-01 13:00:56','کوچه 5 باغ فیض'),(15,'Dr_M_Mousazade','$2y$12$k/VaWPdWpvPPerKia0ABNuesVtEr0a0W2QI2QORtpDAoQ.Tbp8fmS','محمد موسی زاده','Dr_M_Mousazade@exolab.ir','09124979760','doctor',1,14,NULL,0,0,1,NULL,'2026-08-01 11:43:18','2026-08-23 13:15:36',NULL),(16,'DR_M_Arezoubakhsh','$2y$12$TS59HJpySSI9Ff7OrJomzeBd9fMgR7s1et29qImN5fHjyTju8CPV6','مهدی آرزوبخش','DR_M_Arezoubakhsh@exolab.ir','09124979760','doctor',1,14,NULL,0,0,1,NULL,'2026-08-01 13:02:21','2026-08-23 13:15:36',NULL),(17,'Sajedi','$2y$12$hhiUREVJ2shRJw2LXsBZjuMiar/LGQLQl952ekyhYPrsNPIbJ69Qi','سید مسعود ساجدی','sajedi@exolab.ir','09123867044','outsource_lab',NULL,NULL,NULL,0,0,1,NULL,'2026-08-01 13:11:45','2026-08-10 19:28:25',NULL),(18,'Amin','$2y$12$7ORqFly1Ks/THxl7bLHGtOgli8CjUurdMf9qin9BBjksCJnj7tTui','امین','Amin@exolab.ir','09358595690','customer_lab',NULL,NULL,NULL,0,0,1,NULL,'2026-08-05 15:27:58','2026-08-08 18:07:34',NULL),(19,'morsali@exolab.ir','$2y$12$9VCavTiWnYvURx7QFKuKvuIGM3qSvnIz.dcaXuc9qrAQUQFWA1/0C','مرسلی','morsali@exolab.ir','09358595690','doctor',1,NULL,NULL,0,0,1,NULL,'2026-08-08 15:17:00','2026-08-23 13:15:36',NULL),(20,'sheykhi@exolab.ir','$2y$12$8qs2.htm8c9VeTK4NtY8tOpsKgwG.OvHMt62Pv4l2hzzVh/kKoSIK','شیخی','sheykhi@exolab.ir','09120678199','doctor',2,NULL,NULL,0,0,1,NULL,'2026-08-08 15:17:56','2026-08-26 22:43:43',NULL),(21,'khatib@exolab.ir','$2y$12$Z72yqyOAiK65r65rrJb4m.7PvpmlMjpk/w2pKZdLrtc5AEks9xhU6','خطیب','khatib@exolab.ir','09120678199','doctor',2,NULL,NULL,0,0,1,NULL,'2026-08-08 15:18:33','2026-08-26 22:43:36',NULL),(22,'kashef@exolab.ir','$2y$12$YFnKUdpmpPnrcpCeO84Wwu7OR9ddP4RMw9z4TEg3Fq9SuZ9OPvQ8e','کاشفی','kashef@exolab.ir','09129154153','doctor',1,14,NULL,0,0,1,NULL,'2026-08-08 18:40:29','2026-08-23 13:15:36',NULL),(23,'omir_mir','$2y$12$qrW6Xf/i2tQnjqsh3Qiuiuxs07VFC7GbKQFx92FhiiMTo2WDvPzZW','امید میرجوادی','omir_mir@exolab.ir','09147440434','designer',1,NULL,NULL,0,0,0,'2026-08-15 21:16:54','2026-08-09 15:23:36','2026-08-26 22:39:55',NULL),(24,'DONYA','$2y$12$y3TM.TGM1fG62aq44dH7WOADLDUzJqkqsG.jVYsvO9oWRDum9zyeG','دنیا منصوری','DONYA@EXOLAB.IR','09198248209','technician',NULL,NULL,NULL,0,0,1,'2026-08-31 15:51:09','2026-08-09 19:08:59','2026-08-31 15:51:09',NULL),(25,'DR_A_AMIDI@EXOLAB.IR','$2y$12$tUa79MYtgl8sHsIEgPDw1uJ25ChcDbUV8A1sipbPGiI1JlwLsP3YW','احمد عمیدی','DR_A_AMIDI@EXOLAB.IR','09124217228','doctor',1,NULL,NULL,0,0,1,NULL,'2026-08-09 19:29:46','2026-08-23 13:15:36',NULL),(26,'M.A.Yegane','$2y$12$3lTt9meY0Kh8KIcWbYbi7OI0Z.EZaZuDngEbJZyNVgUCDIBT2G8cG','محمد علی یگانه','M.A.Yegane@exolab.ir','09153234191','designer',1,NULL,NULL,1,0,1,'2026-09-01 00:14:25','2026-08-17 11:55:00','2026-09-01 00:14:25',NULL),(27,'central_lab','$2y$10$bHvgL8OXZ.bonANyUOahMuIeH1TJoNV7EgatqIfEAZ1GOK8kr5ama','لابراتوار مرکزی',NULL,NULL,'outsource_lab',1,NULL,NULL,0,0,1,NULL,'2026-08-28 13:23:30','2026-08-28 13:23:30',NULL),(28,'central_admin','$2y$10$nhUjiHidau76.pSnJSUFn..gw.3f/hFRTnuj01sAhbXh7Jqedg0U2','مدیر شعبه مرکزی',NULL,NULL,'branch_admin',1,NULL,NULL,0,0,1,NULL,'2026-08-28 13:23:41','2026-08-28 13:23:41',NULL);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'exolabir_index'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-09-01  1:52:18
